[{"Title":"California Chicken Spaghetti","Description":"Angel hair pasta is tossed with chicken and roma tomatoes in this simple but flavorful dish. The…"},{"Title":"Parmesan Garlic Bread","Description":"Butter and Italian-style spices are blended with Parmesan cheese to make a great spread for…"},{"Title":"Pesto Polenta Lasagna","Description":"Sliced polenta is layered with marinara sauce and pesto, and topped with mozzarella…"},{"Title":"Classic Minestrone","Description":"This is a traditional minestrone complete with leeks and zucchini in a tomato soup base with…"},{"Title":"Rich Italian Sausage and Potato Soup","Description":"Strips of kale, cream, and cooked sausage are added in the final stage to this potato soup…"},{"Title":"Pasta e Fagioli I","Description":"Rich and savory, a wonderful soup, it can be a meal in itself, serve with garlic toast, its great!"},{"Title":"Chicken and Bowtie Pasta with Asiago Cream Sauce","Description":"A tasty mix of chicken, garlic, mushrooms, and prosciutto tossed with bow tie pasta and a…"},{"Title":"Italian Roast Beef I","Description":"Tender beef, seasoned with oregano, basil and garlic then boiled in beef bouillon. Can also…"},{"Title":"Tofu Lasagna","Description":"Tofu is combined with eggs, spaghetti sauce, mozzarella cheese and spices. The mixture is…"},{"Title":"Spaghetti Sauce","Description":"Quick and easy homemade spaghetti sauce with tomatoes, onions, garlic, basil and oregano. …"},{"Title":"Fresh Tomato Shrimp Pasta","Description":"Fresh tomatoes and spinach, fresh herbs, and fresh mozzarella combine with shrimp and…"},{"Title":"Michael's Foccacia Bread","Description":"This version of the classic is easy to make while remaining authentic and true to the original. …"},{"Title":"Tomato Basil Salmon","Description":"This quick salmon dish is perfect for a weeknight dinner. Serve with a side of…"},{"Title":"Bread Machine Calzone","Description":"The calzone dough is prepared in the bread machine, and then it's stuffed with Italian…"},{"Title":"Elegant Orzo with Wilted Spinach and Pine Nuts","Description":"Orzo pasta with wilted spinach, feta cheese, tomatoes, and balsamic vinegar - goes well…"},{"Title":"Asparagus Wrapped in Crisp Prosciutto","Description":"Extremely easy and elegant appetizer. Asparagus spears are wrapped in a sheath of…"},{"Title":"Sausage-Stuffed Eggplant","Description":"A local winery/restaurant serves a stuffed eggplant appetizer that is so delicious. While…"},{"Title":"Flounder Mediterranean","Description":"Flounder is baked in a Parmesan tomato sauce made with Italian herbs and seasonings,…"},{"Title":"Zucchini Parmesan","Description":"The wonderful, complementary flavors of zucchini, onions and garlic are brought…"},{"Title":"Pizza Crust for the Bread Machine II","Description":"Bread flour has a higher gluten content and so makes a durable dough that holds its own…"},{"Title":"Italian Chicken Marinade","Description":"Italian dressing marinade is the prelude to a tasty grilled chicken."},{"Title":"Ciabatta","Description":"Take five minutes today to make the starter, also called sponge, and tomorrow you can bake…"},{"Title":"Cinnamon Sugar Biscotti","Description":"This is an Italian version of cinnamon toast. Everyone is sure to enjoy these!"},{"Title":"Mom's Italian Beef Barley Soup","Description":"Cubed beef, barley, onion and tomato sauce are cooked in a slow cooker with water and beef…"},{"Title":"Basic Microwave Risotto","Description":"If all the stirring, and stirring and stirring has discouraged you from making creamy risotto,…"},{"Title":"Easy Italian Chicken II","Description":"Your favorite Italian-style salad dressing makes a simple but splendid marinade."},{"Title":"Cheese Herb Bread","Description":"With this recipe, Parmesan bread, fragrant with oregano, basil and other herbs, is made easily…"},{"Title":"Ricotta Cookies III","Description":"Light and fluffy ricotta cookies frosted with lemon icing."},{"Title":"Pasta Salad","Description":"The veggies match the colors in the tri-colored pasta. And the dressing is real zesty and spicy.…"},{"Title":"Ricardo's Pizza Crust","Description":"This herb laced pizza crust is mixed in the bread machine but baked in the oven. Add your…"},{"Title":"Garlic Butter Sauce I","Description":"Fragrant garlic, sauteed in butter and seasoned with dried oregano and basil, makes a…"},{"Title":"Baked Eggplant Parmesan","Description":"Eggplant slices are coated with bread crumbs and Parmesan cheese and baked between…"},{"Title":"Nanny's Spaghetti Sauce","Description":"A splendid marinara is just minutes away when you simmer crushed tomatoes, tomato sauce…"},{"Title":"Fresh Semolina and Egg Pasta","Description":"Fresh pasta is literally at your fingertips as you knead together flour, salt, eggs and olive oil to…"},{"Title":"Jet Swirl Pizza Appetizers","Description":"Similar to meat-filled calzones, these cheesy little swirls were invented during football…"},{"Title":"Coq au Vin alla Italiana","Description":"Take the usual coq au vin ingredients of chicken, vegetables and red wine, toss in loads of…"},{"Title":"Best Ever Slow Cooker Italian Beef Roast","Description":"A tender, juicy pot roast needs just a few minutes to get ready before simmering for 6…"},{"Title":"Slow Cooker Bolognese","Description":"The slow cooker takes the work and mess out of simmering an Italian-inspired Bolognese meat…"},{"Title":"California Italian Wedding Soup","Description":"This is my variation of a standard recipe. I like fresh basil and a little lemon rind, so those are…"},{"Title":"Instant Pot(R) Mushroom Risotto","Description":"An Instant Pot(R) pressure cooker makes it so easy and quick to make this creamy, cheesy…"},{"Title":"Zucchini Pasta II","Description":"A thick sauce packed with zucchini and chicken is the perfect topping for a delicious summer…"},{"Title":"Best Ever Party Appetizer","Description":"These little cheese bites are marinated overnight to bring out the full flavor of the…"},{"Title":"Easy Spinach Lasagna with White Sauce","Description":"Use a ready-made Alfredo sauce to layer with spinach, egg and ricotta, carrots and…"},{"Title":"Pasta Salad with Homemade Dressing","Description":"This colorful pasta salad is packed with vegetables, pepperoni, and cheese. Toss with…"},{"Title":"Shrimp Florentine with Zoodles","Description":"Shrimp and spinach are cooked in a buttery sauce with zoodles (zucchini noodles) in this…"},{"Title":"Twelve Minute Pasta Toss","Description":"This easy-to-prepare chicken pasta dish gets its delicious flavors from sun-dried tomatoes,…"},{"Title":"Summer Lasagna","Description":"Zucchini takes the place of pasta in this recipe, making it lighter than a regular lasagna. It's…"},{"Title":"Classic Lasagna","Description":"Make this classic lasagna recipe zestier by using hot Italian sausage or a little milder with…"},{"Title":"Vegetarian Four Cheese Lasagna","Description":"Fresh pasta sheets baked with ricotta, feta, eggplant, tomato, pesto, pumpkin, Parmesan…"},{"Title":"Hot Italian Giardiniera","Description":"A hot and tangy, pickled pepper and jalapeno topping for Italian beef sandwiches, sausages,…"},{"Title":"Italian Creme Layer Cake","Description":"This moist cake is topped with coconut and pecans for a delicious and elegant dessert."},{"Title":"Hoagie Dip","Description":"This mouth-watering dip tastes like a hoagie!"},{"Title":"Carrie's Artichoke and Sun-Dried Tomato Pasta","Description":"Fresh pasta is tossed with a simple yet flavorful sauce of garlic, mushrooms, artichoke hearts,…"},{"Title":"Tilapia Scaloppine","Description":"Tilapia, always quick and easy to cook, gets an Italian update with capers and fresh…"},{"Title":"Balsamic Cream Sauce","Description":"The vinegar and cream go very well together. Best when sauteed chicken and asparagus is…"},{"Title":"Savory Kale, Cannellini Bean, and Potato Soup","Description":"A savory kale, white bean, and potato soup, seasoned with fresh herbs, and one spicy red…"},{"Title":"Chef John's Tomato Sauce","Description":"This is the sauce you want to use as a base for so many different dishes, add meat to, or flavor…"},{"Title":"Baked Tomatoes Oregano","Description":"Ripe tomatoes are baked with Romano cheese, fresh bread crumbs, garlic and herbs."},{"Title":"Chicken and Broccoli Pasta","Description":"Bite-sized bits of sauteed chicken meld with the fresh flavors of tomatoes and broccoli. Onion,…"},{"Title":"Chef John's Spaghetti alla Carbonara","Description":"Spaghetti alla carbonara in its authentic form: peppery, creamy without using cream,…"},{"Title":"Cheesy Stuffed Shells","Description":"This is a delicious baked pasta dish with large shells filled with meat, spinach and cheese…"},{"Title":"Spinach Lasagna II","Description":"Use uncooked lasagna noodles to add to the easy preparation of this tasty casserole!…"},{"Title":"Mediterranean Pasta","Description":"Chicken breast chunks flavored with bacon, artichoke hearts and herbs in a tomato sauce…"},{"Title":"Spicy Italian Pork Cutlets","Description":"A delicious garlic and fresh tomato sauce covers tender pork cutlets. Serve with crusty bread, a…"},{"Title":"Italian Sausage and Zucchini","Description":"A simple recipe for a quick dinner. Italian sausage is browned with summer squash,…"},{"Title":"Make Ahead Manicotti","Description":"The secret to this marvelous manicotti is in the chill. After stuffing cooked pasta with a tasty…"},{"Title":"Meat Filled Manicotti","Description":"A pleasing blend of ground beef, cottage cheese, mozzarella, Parmesan, egg whites and dried…"},{"Title":"Simply Traditional Lasagna","Description":"A traditional lasagna, with about half the time and effort! I always cook extra to have…"},{"Title":"Eggplant Rollatini","Description":"After having eggplant rollatine at a restaurant, and it was absolutely delicious! I decided that…"},{"Title":"Spaghetti Cacio e Pepe","Description":"This Roman \"cheese and pepper\" spaghetti is a delicious side dish or simple dinner. It's a…"},{"Title":"Instant Pot(R) Chicken Cacciatore","Description":"Make chicken cacciatore in the Instant Pot® for a super flavorful meal ready in minutes; your…"},{"Title":"Northern Italian Beef Stew","Description":"This hearty beef stew packed with vegetables and herbs is a family favorite."},{"Title":"Ziti with Italian Sausage","Description":"Ziti and Italian sausage baked with mushrooms, onion, celery, mozzarella and a simple tomato…"},{"Title":"Pasta Siciliano","Description":"This wonderful and easy skillet pasta dish includes sun-dried tomatoes, olives, pine…"},{"Title":"Caprese on a Stick","Description":"Serve your Caprese salad on toothpicks for a fun, easy appetizer. It takes just a few minutes…"},{"Title":"Traditional Osso Buco","Description":"This recipe is a traditional but simple way of cooking Osso Buco (veal shanks). The white…"},{"Title":"Cara's Creamy Stuffed Shells","Description":"This is a unique perspective to boring ground-beef stuffed shells. You and everyone will love…"},{"Title":"Pesto Stuffed Pork Chops","Description":"Bone-in pork chops are stuffed with feta cheese, basil, and pine nuts and baked with a…"},{"Title":"Stephan's Broiled Salmon Pesto","Description":"Fresh salmon fillets--or a whole side of salmon--is slathered in pesto and then broiled until a…"},{"Title":"Italian Cream Cake II","Description":"Creamy Italian frosting and a light and fluffy cake with pecans and coconut create this…"},{"Title":"Italian Sausage Soup II","Description":"A great soup for dinner, can be made as spicy as you like, and freezes wonderfully. Add freshly…"},{"Title":"Kalamata Olive Tapenade","Description":"You don't need to use anchovies to make a delicious tapenade; try this recipe for…"},{"Title":"Chicken Cacciatore in a Slow Cooker","Description":"Easy and delicious, this recipe features chicken breast, spaghetti sauce, pepper, mushroom,…"},{"Title":"Italian Kale","Description":"An easy Italian-style preparation of kale. The simple additions of balsamic vinegar and…"},{"Title":"Wedding Gift Spaghetti Sauce","Description":"This rich and aromatic spaghetti sauce recipe is so special it was given as part of a wedding…"},{"Title":"Chicken and Sun-Dried Tomato Bruschetta","Description":"Marinated chicken, spinach, feta, and sun-dried tomatoes are tossed with dressing and served…"},{"Title":"Cheesy Sausage Pasta","Description":"Seashell pasta is bathed in a luxurious sausage and tomato cheese sauce to create the…"},{"Title":"Cheesy Vegetable Lasagna","Description":"This rich lasagna is loaded with broccoli, carrots, onion, bell pepper, zucchini, and spinach in a…"},{"Title":"Antipasto Salad","Description":"Here's a great picnic salad! Corkscrew-shaped pasta soaks up a tasty blend of oil, vinegar,…"},{"Title":"Italian Biscotti","Description":"A traditional biscotti recipe. Great for dunking in coffee or tea."},{"Title":"Mid-Summer Italian Bread Salad","Description":"A crusty rosemary bread works nicely for this classic Italian salad. The bread - pulled into…"},{"Title":"Spinach Alfredo Sauce (Better than Olive Garden(R))","Description":"Crowd-pleasing spinach Alfredo sauce is quick and easy to prepare and tastes better than the…"},{"Title":"Rolled Flank Steak","Description":"Rolled flank steak makes for a beautiful presentation, with the pinwheel cuts…"},{"Title":"American-Italian Pasta Salad","Description":"Garden veggies with fusilli pasta, Italian Parsley, Genoa salami and creamy Italian dressing…"},{"Title":"Veggie Lasagna Florentine","Description":"A host of vegetables are in every bite of this substantial lasagna made with mushrooms,…"},{"Title":"Prune and Olive Chicken","Description":"In Chicken Marbella, as this dish is commonly known, chicken marinates in a sauce of…"},{"Title":"Linguine with Chicken and Sauteed Vegetables","Description":"I've been making this recipe for a long time and I usually don't make it the same way twice. I…"},{"Title":"Creamy Spinach Tortellini","Description":"In this family favorite, cheesy tortellini is dressed up with tomatoes, mushrooms,…"},{"Title":"Homemade Sweet Italian Sausage (Mild or Hot)","Description":"It's easy to make your own Italian-style sausage with a lot of delicious herbs and spices. Freeze…"},{"Title":"Broccoli Garlic Angel Hair Pasta","Description":"A beautiful side dish of broccoli and angel hair pasta with red pepper flakes is so delicious…"},{"Title":"Hearty Meatball Sandwich","Description":"A cross between meatloaf and meatballs, this sandwich holds together without being messy."},{"Title":"Pesto Pizza","Description":"Top a prepared pizza crust with pesto, your favorite veggies and feta cheese and you've…"},{"Title":"Fabulous Cilantro Pesto","Description":"This is a delicious version of the classic with a little more zip! You can substitute the vinegar…"},{"Title":"Fresh Tomato Pie","Description":"This savory layered pie is a great way to use up extra summer tomatoes--and it's delicious…"},{"Title":"Calamari","Description":"This is a delicious, very easy, quick but moderately expensive recipe. Everyone I've…"},{"Title":"Spinach and Cheese Stuffed Pasta Shells","Description":"Magnificent jumbo pasta shells stuffed to bursting with cheesy spinach filling."},{"Title":"Pizzelles II","Description":"An thin traditional anise flavored Italian cookie made with a pizzelle iron."},{"Title":"Pizza Chicken","Description":"Kick the flavor of ordinary breaded chicken breasts into a higher gear by topping them…"},{"Title":"Classic and Simple Meat Lasagna","Description":"A family-pleasing version of lasagna is made with lean ground beef, whole wheat lasagna…"},{"Title":"Italian Style Flounder","Description":"In this simple preparation, baked flounder fillets take on a delicious Italian-inspired flavor."},{"Title":"Easy Pasta Fagioli","Description":"White cannellini beans, ditalini pasta with vegetables, tomato sauce and herbs in a…"},{"Title":"Restaurant-Style Chicken Scampi","Description":"Toss together tender chicken morsels with spaghetti, a rainbow of bell peppers, loads of…"},{"Title":"Lemon Orzo Primavera","Description":"Colorful vegetables and the flavors of lemon and thyme make this orzo dish great for picnics.…"},{"Title":"Pizza Crust I","Description":"Your bread machine prepares this classic dough, with olive oil lending an authenticity to the…"},{"Title":"Chef John's Chicken Riggies","Description":"This regional dish from Central New York is a rich pasta sauce made with Italian sausage,…"},{"Title":"Slow-Cooker Lasagna","Description":"Have all the flavors you love in homemade lasagna without the fussy preparation and…"},{"Title":"Chicken Pesto a la Lisa","Description":"The sunny, nutty taste of basil and pine nuts melds with the rich notes of sun-dried…"},{"Title":"Easy Alfredo Sauce II","Description":"No cooking for this sauce, just toss with hot pasta."},{"Title":"Pasta Fagioli Soup II","Description":"A quick and easy Italian favorite. Garnish with grated Romano cheese."},{"Title":"Easy Pizza Sauce II","Description":"Let your oven do the cooked when you spread your home-made pizza with a delicious…"},{"Title":"Salmon and Spinach Fettuccine","Description":"Smoked salmon, spinach, capers, and sun-dried tomatoes in a creamy Parmesan cheese sauce…"},{"Title":"Italian Style Turkey Meatloaf","Description":"Turkey meatloaf gets an Italian flair through the use of Italian-style bread crumbs and Italian…"},{"Title":"Sweet Pepper Pasta Toss with Kale","Description":"Sauteed sweet peppers and kale are tossed with farfalle pasta and sprinkled with a generous…"},{"Title":"Parmesan Tomatoes","Description":"It only takes a few minutes to transform plain tomatoes into a spicy delicacy. Just slice ripe…"},{"Title":"Sauceless Garden Lasagna","Description":"I developed this tasty lasagna to help use up the tomatoes, spinach, and zucchini from my…"},{"Title":"Tuscan Cream Cheese Spread","Description":"Spread your bread with the earthy flavors of the Italian countryside. Cream cheese, garlic,…"},{"Title":"Fabulous Foolproof Lasagna","Description":"A simple ricotta lasagna made with no-boil noodles and spaghetti sauce from a jar…"},{"Title":"Italian Sausage Tortellini Bake","Description":"This delicious Italian baked tortellini dish will have you coming back for seconds."},{"Title":"Italian BBQ Pork Chops","Description":"Pork chops with a quick homemade BBQ sauce made with balsamic vinegar, ketchup, and…"},{"Title":"Bread Machine Thin Crust Pizza Dough","Description":"Use your bread machine to make a thin, chewy, flavorful pizza crust with just a few basic…"},{"Title":"Homemade Chicken Parmigiana","Description":"Show the love with these breaded chicken breasts and homemade creamy tomato sauce.…"},{"Title":"Linguine with Seafood and Sundried Tomatoes","Description":"Tender whole scallops and shrimp get a quick saute in hot, garlicky olive oil and butter…"},{"Title":"Vegan Lasagna I","Description":"A thick tomato-based sauce is cooked up with hints of garlic, onion, parsley, and basil, and…"},{"Title":"Chicken Marsala II","Description":"Flour coated chicken sauteed with a mushroom and Marsala wine sauce. Mmmm, rich Marsala…"},{"Title":"Premium Pizza Crust","Description":"This is a very simple crust that will take some practice to perfect, unless you already know…"},{"Title":"Garlic Lover's Pizza Crust for the Bread Machine","Description":"A delicious chewy crust with the wonderful flavor of garlic baked right in! Quick and…"},{"Title":"Chicken Rotini Stovetop Casserole","Description":"Pasta noodles tossed with chicken, bell pepper and a creamy herb sauce--all prepared on the…"},{"Title":"Camp David Spaghetti with Italian Sausage","Description":"A hearty ground beef and tomato pasta sauce is mixed with spaghetti, and topped with an…"},{"Title":"Chicken Scallopini","Description":"Using a chicken demi-glace, a very concentrated and flavorful sauce base, will add a gourmet…"},{"Title":"Crunchy Eggplant Parmesan","Description":"A deluxe version of eggplant Parmesan is layered like a lasagna with panko-breaded…"},{"Title":"Easy Pepperoni Bread","Description":"Frozen bread dough makes this tasty recipe a breeze to prepare! Pepperoni, mozzarella…"},{"Title":"Marinara Sauce","Description":"A simple tomato sauce with garlic, red wine and fresh bail. You'll never want to buy store…"},{"Title":"Slow Cooker Italian Beef","Description":"Roast beef simmered with Italian-style spices, pepperoncini and beef broth for a tasty…"},{"Title":"Chicken Piccata I","Description":"Lemon perks up this chicken in wine sauce, an easy company favorite."},{"Title":"Chicken Penne Italiano","Description":"An Italian version of stir-fry, this tasty dish mixes cubed, boneless chicken and penne pasta…"},{"Title":"Baked Spaghetti Casserole","Description":"This baked spaghetti casserole has layers of pasta, cottage cheese, spaghetti sauce, and…"},{"Title":"Cavatelli and Broccoli","Description":"The freshest tips of broccoli are blanched and quickly sauteed in olive oil and garlic, then…"},{"Title":"Italian Cookies II","Description":"Italian cookies made with ricotta cheese and frosted with a confectioners' icing. Delicious…"},{"Title":"Spaghetti Italian","Description":"Delicious and not so sweet. Good to the last bowl!!"},{"Title":"Homemade Four Cheese Ravioli","Description":"Fresh pasta filled with ricotta cheese, cream cheese, mozzarella cheese, and provolone…"},{"Title":"Baked Pasta","Description":"Warm up a chilly evening with this hearty bake of ground beef and ziti pasta in a tasty tomato…"},{"Title":"Chunky Marinara Sauce","Description":"You'll love this Marinara sauce! This is great with fried eggplant or meatballs. I'm sure you…"},{"Title":"Romano Chicken","Description":"Rollups of chicken, Swiss and Parmesan cheeses, ham and herbs - breaded and quickly…"},{"Title":"Italian Chicken with Garlic and Lemon","Description":"Chicken and pan-fried potatoes baked in a potent lemon, garlic and herb sauce."},{"Title":"Sicilian Ricotta Cheesecake","Description":"This ricotta cheesecake is similar in style to an American cheesecake, but is much lighter.…"},{"Title":"Ricotta Cheese Cookies","Description":"These soft Italian-style cookies are a hit with everyone. The ricotta keeps them moist, and…"},{"Title":"Risotto with Tomato, Corn and Basil","Description":"This is a labor of love, lots of stirring and timing to get all the ingredients added and the…"},{"Title":"Baked Pasta with Sausage and Baby Portobello Mushroom White Sauce","Description":"Cremini mushrooms (also called 'Baby Portobellos') join Italian sausage in this hot…"},{"Title":"Tortellini Salad","Description":"An easy and delicious cold pasta salad tastes like an Italian antipasto platter, with cheese…"},{"Title":"Jackie's Sausage Soup","Description":"This one-pot soup doesn't take a lot of time, but it sure tastes like it does. Italian sausage,…"},{"Title":"Italian Stuffed Chicken Breast","Description":"Italian-inspired stuffed chicken breasts are loaded with plenty of cheese and seasonings…"},{"Title":"Zucchini Saute","Description":"Zucchini is sauteed with red onion, mushrooms, tomato and herbs. You can use any veggies…"},{"Title":"Creamy Italian Dressing II","Description":"This smooth and creamy dressing has the pungency of lemon juice and red wine vinegar…"},{"Title":"Allie's Mushroom Pizza","Description":"A simple mushroom spinach pizza, much better then takeout pizza!"},{"Title":"Mama Corleone's Sausage and Peppers","Description":"This dish was inspired by a description in the novel, 'The Godfather.' It is also a favorite with…"},{"Title":"Mike's Homemade Pizza","Description":"A great recipe for homemade pizza dough and sauce. The sauce is especially good. Top with…"},{"Title":"Pignoli Cookies I","Description":"They are pleasantly sweet, made with almond paste and pine nuts, but no flour."},{"Title":"Mediterranean Black Olive Bread","Description":"Any olive will work in this bread, so try Kalamata today, and Nicoise next week."},{"Title":"Pasta Fazool (Pasta e Fagioli)","Description":"This classic Italian-American comfort food works with any kind of sausage, but Chef…"},{"Title":"Clams Italiano","Description":"These clams are steamed in wine, butter, and spices. When the clams are gone, dip Italian…"},{"Title":"Lentil Rice and Veggie Bake","Description":"Lentils, rice, tomato sauce, herbs, and vegetables yield a wonderful meal for vegans…"},{"Title":"Cream of Chicken and Gnocchi Soup","Description":"Cream of chicken and gnocchi soup just like the famous Italian restaurant chain's soup can be…"},{"Title":"Caprese Salad with Balsamic Reduction","Description":"The lovely Italian salad of sliced tomato, mozzarella cheese, and fresh basil leaves gets…"},{"Title":"Easy Polenta with Tomato Sauce","Description":"My entire family loves this recipe. A quick baked polenta topped with red sauce. Very easy to…"},{"Title":"Pesto Pasta","Description":"For a simple, savory dish cook chopped onions in olive oil and ready-made pesto. Toss with…"},{"Title":"Pizzelles III","Description":"This recipe calls for a batter-like dough and is baked on a pizzelle iron. Powdered sugar adds…"},{"Title":"Italian Anisette Cookies","Description":"Traditional Italian anisette cookies are quick and easy to make with just a few ingredients,…"},{"Title":"Swordfish a la Siciliana","Description":"Sweet raisins, sour olives and piquant capers conspire to make this a memorable main dish."},{"Title":"How to Make Perfect Polenta","Description":"Creamy, cheesy polenta is a side dish that goes great with all kinds of meats and sauces. You…"},{"Title":"Meatball Sub Casserole","Description":"Start with frozen meatballs, prepared sauce, and a loaf of frozen garlic bread and serve your…"},{"Title":"Pesto Pasta Caprese Salad","Description":"Rotini pasta is tossed with pesto, fresh mozzarella, and tomatoes for a colorful pasta…"},{"Title":"Summer Squash Chicken Alfredo","Description":"Chicken, zucchini, and yellow squash are served over pasta with an Alfredo sauce, and…"},{"Title":"Chris's Incredible Italian Turkey Meatloaf","Description":"A household favorite, I created this recipe after giving up flour, cheese and most sugar. It is a…"},{"Title":"Italian Chicken and Chickpeas","Description":"This spin on an Italian tradition consists of chicken breasts and garbanzo beans in a…"},{"Title":"Johnsonville(R) Italian Meatballs","Description":"Using ground Italian sausage plus a few simple ingredients makes these flavorful meatballs…"},{"Title":"Chicken Scampi I","Description":"A wonderful, fresh, light way to serve chicken. Good over rice."},{"Title":"Roasted Garlic without Foil","Description":"I love garlic! It's so easy to roast, and there are so many different ways to do it. It's great…"},{"Title":"Personal Portobello Pizza","Description":"A delicious recipe that substitutes a portobello mushroom for a pizza crust. Try using pesto…"},{"Title":"Key West Penne","Description":"A deliciously rich medley of scallops, shrimp, artichokes, sun-dried tomatoes and pasta! …"},{"Title":"Risotto with Sun-Dried Tomatoes and Mozzarella","Description":"This is a great risotto when you have the time, it is not a lot of work but it can take awhile to…"},{"Title":"Easy Butternut Squash Ravioli","Description":"These easy butternut squash ravioli are a terrific way to use up leftover roasted butternut…"},{"Title":"Chicken Piccata with Angel Hair Pasta","Description":"This stunning classic piccata made with a tangy and savory lemon and white wine sauce is…"},{"Title":"Zeppole","Description":"This is a simple recipe for an Italian delicacy. These fried ricotta doughnut-like cookies are…"},{"Title":"Insalata Caprese I","Description":"Thick wedges of ripe tomatoes, fresh Mozzarella and slices of red onion are tossed in olive oil…"},{"Title":"Pasta e Fagioli II","Description":"Wonderful Italian veggie soup. My parents had it while in Rome and convinced the chef to give…"},{"Title":"Yummy Lasagna","Description":"Lasagna with ground beef and pepperoni, ricotta and mozzarella."},{"Title":"Penne Pasta with Veggies","Description":"Penne is baked with asparagus, broccoli, red bell pepper, zucchini, prosciutto, sun-dried…"},{"Title":"Jasmine's Brussels Sprouts","Description":"A tasty side dish that combines the flavors of garlic and pancetta with Brussels sprouts."},{"Title":"New York Italian Pizza Dough","Description":"Real New York-style pizza crust is chewy, thin, a little flexible, and dotted with bubbles and…"},{"Title":"Fettucine Carbonara","Description":"Creamy fettuccini flavored with crispy bacon and delicious Parmesan cheese."},{"Title":"Pepperoni Casserole","Description":"Spaghetti with a twist! Your standard spaghetti topped with a combination of…"},{"Title":"Seafood Lasagna II","Description":"This super rich, Alfredo based seafood lasagna is a huge hit in our family. It takes a while to…"},{"Title":"Amazing Sun-Dried Tomato Cream Sauce","Description":"This is a recipe I've created myself - and everyone that tries it loves it. It tastes just like…"},{"Title":"Spaghetti Pizza Lasagna","Description":"Baked spaghetti with ground beef and pepperoni topped with shredded cheese."},{"Title":"Limoncello","Description":"Truly distinguished ice cold refreshing drink! Lemon zest is steeped in vodka for a week,…"},{"Title":"Italian Meatballs","Description":"Baked meatballs seasoned with oregano and garlic, simmered in spaghetti sauce."},{"Title":"Awesome Broccoli Marinara","Description":"This is a great quick version of an Italian traditional side dish in our family all the way…"},{"Title":"Cheese Lasagna","Description":"A meatless lasagna made with ricotta, parmesan and mozzarella cheese."},{"Title":"Angel's Yummy Bruschetta","Description":"A delicious Italian appetizer that was divided and revised and modified over several years. I…"},{"Title":"Penne Pasta with Cannellini Beans and Escarole","Description":"This is a great pasta dish. The hardest part of the whole recipe is cutting the escarole. It is fast,…"},{"Title":"Italian Summer Squash Polenta Bake","Description":"Even the name of this dish makes your mouth water. But we love polenta, and so will you…"},{"Title":"Chicken Valdostano","Description":"Delicious Italian skillet dish with prosciutto ham, fontina cheese (one of Italy's best…"},{"Title":"Mushrooms and Spinach Italian Style","Description":"This recipe is a typical recipe of Southern Italy, specifically Apulia. Spinach and mushrooms…"},{"Title":"Rosemary Pasta in Roasted Garlic Sauce","Description":"My mother has been making this dish for as long as I can remember. Lots of rosemary and…"},{"Title":"Chicken with Artichokes and Sundried Tomatoes","Description":"Angel hair pasta topped with chicken, artichoke hearts, sun-dried tomatoes, and feta cheese is…"},{"Title":"Batman's Best Caesar Dressing","Description":"Fast, easy, creamy Caesar salad dressing that is also an excellent marinade for chicken or…"},{"Title":"Rita's Spinach Casserole","Description":"This is a quick and delicious way to get kids to eat spinach! Ground beef and tomato sauce…"},{"Title":"Amazing 'Pizza' Pork Chops","Description":"Topping your pork chops with tomato, basil, oregano, garlic, and mozzarella cheese will…"},{"Title":"Pasta Sauce with Italian Sausage","Description":"A flavorful homemade recipe for those who like meaty, savory sauces. Serve over your favorite…"},{"Title":"Simple Sicilian Salad Dressing","Description":"Shake olive oil and balsamic vinegar in a jar with dried oregano and freshly ground pepper to…"},{"Title":"Turkey Tetrazzini","Description":"This is a great recipe for leftover turkey. Even those who say they don't like turkey will eat…"},{"Title":"Parmesan Puffs","Description":"Parmesan cheese dough drops are baked into puffy little appetizer balls and dipped in warm…"},{"Title":"Pasta with Italian Sausage and Pumpkin Sauce","Description":"Tender campanelle (trumpet-shaped pasta) are served in a creamy sauce with Italian sausage…"},{"Title":"Four Cheese Sauce","Description":"A marvelous alchemy of heavy cream, butter and Parmesan, mozzarella, provolone and…"},{"Title":"Sweet Sausage Marsala","Description":"This is a great Italian dish that doesn't require a lot of work. Sweet Italian sausage is cooked…"},{"Title":"Eggplant Parmesan Casserole","Description":"Use Chef John's simple techniques to make an eggplant casserole that has all the flavor and…"},{"Title":"Italian Sausage with Farfalle and Broccoli Rabe","Description":"A beautiful two pan entree that'll please anyone who likes Italian sausage. Delicious with…"},{"Title":"Chicken Manicotti Alfredo","Description":"Large manicotti noodles are stuffed with an aromatic blend of marinated chicken, ricotta…"},{"Title":"Italian Style Sausage","Description":"Custom-blend herbs and spices to make your own Italian sausage! Try this earthy mix of…"},{"Title":"Italian Baked Cannelloni","Description":"A savory, creamy, cheesy meat filling is stuffed into pasta shells and topped with a…"},{"Title":"Italian Butter","Description":"If you are looking for a Italian bread dip, try this. It makes a spectacular bread dip, suitable for…"},{"Title":"Spicy Oil and Vinegar Bread Dip","Description":"This recipe is fantastic with warm crusty Italian bread, or any other bread for that matter! Use…"},{"Title":"Orzo with Chicken and Artichokes","Description":"Orzo with Artichokes, Balsamic vinegar and Chicken -- as easy as A-B-C! Pancetta, spinach,…"},{"Title":"Easy Four Cheese Lasagna","Description":"Meatless lasagna with cottage cheese, mozzarella, Cheddar and Parmesan."},{"Title":"Italian Cookies I","Description":"This cookie recipe has been handed down to me from my grandmother. It has been in the…"},{"Title":"Italian Subs - Restaurant Style","Description":"This is a classic Italian sub sandwich with three kinds of meat and provolone cheese. The kind…"},{"Title":"Ellen's Chicken Cacciatore","Description":"Tender chicken thigh meat simmers in a savory tomato sauce for an Italian-inspired meal…"},{"Title":"Exquisite Yeastless Focaccia","Description":"This recipe for focaccia was given to me by my best friend, who is Italian. It's incredibly…"},{"Title":"Aunt Anne's Sesame Cookies","Description":"After trying my hand at countless sesame cookie recipes, my Italian girlfriend shared her Aunt…"},{"Title":"Stuffed Eggplant Parmesan","Description":"Eggplant centers are cooked with onion, garlic, and seasonings, then re-stuffed into the…"},{"Title":"Cranberry Almond Biscotti","Description":"I modified a recipe to make this a darker biscotti. For a richer almond flavor, use…"},{"Title":"Italian Rice Balls","Description":"These cheesy deep-fried rice balls are served with Italian dinners as a side like a bread.…"},{"Title":"Owen's Mozzarella and Tomato Salad","Description":"So easy, looks great, and tastes fabulous. Plump tomatoes are topped with thick slices of…"},{"Title":"Fantastic Focaccia Bread","Description":"This easy to make focaccia bread is terrific for sandwich making."},{"Title":"Chicken Lasagna IV","Description":"This lasagna is baked with a creamy blend of cream of chicken soup, cream of mushroom…"},{"Title":"Fettuccini Tomato Rustica II","Description":"Fettuccini is tossed with olive oil, chicken, pesto, ricotta, feta and sun-dried tomatoes."},{"Title":"Cabbage and Smoked Sausage Soup","Description":"Even kids who don't care for vegetable soup may enjoy this one. Very good flavor.…"},{"Title":"Skillet Spinach Lasagna","Description":"Sausage, lasagna noodles, and spinach are simmered with tomatoes and ricotta cheese…"},{"Title":"Basic Cheese Polenta","Description":"Parmesan cheese gives this polenta a nice, subtle cheese flavor. Serve it immediately as a…"},{"Title":"Brian's Favorite Sauce","Description":"Italian sausage is sauteed with onion and garlic, then simmered with tomatoes, oregano and…"},{"Title":"Italian Eggplant Tomato Bake","Description":"Eggplant, tomato, and cheeses are layered, baked, then served over pasta. An easy and…"},{"Title":"Artichoke and Tomato Chicken","Description":"This is a delicious recipe that I came up with one afternoon when I couldn't find anything to…"},{"Title":"Manicotti Shells","Description":"Fill with your favorite filling, fold over sides and bake with sauce and cheese."},{"Title":"Fideo (Mexican Spaghetti)","Description":"A very unusual but very delicious pasta dish. My Mexican grandfather used to make it and I…"},{"Title":"Braised Pork Ragu","Description":"This rich pork and tomato ragu is best when served over Parmesan risotto, but also tastes…"},{"Title":"Vegetable Medley I","Description":"Basil, oregano and olive oil, and lots of fresh vegetables are warmed together, sprinkled…"},{"Title":"Sirloin Marinara","Description":"Sirloin strips and onions are sauteed, and then simmered with tomato sauce, red wine, and…"},{"Title":"Pizza Crust for Bread Machine","Description":"Semolina flour is specified here for its ability to hold shape. No floppy crust from this recipe,…"},{"Title":"Ham and Asparagus Fettuccine","Description":"Asparagus and diced ham dress up this springtime fettuccine Alfredo."},{"Title":"Crab Alfredo","Description":"Simply put, delicious! A little on the decadent side, but it can be made with fat-free…"},{"Title":"Grandma's Best Ever Sour Cream Lasagna","Description":"Sour cream is the surprise ingredient in this meaty lasagna. It makes the cheese layer…"},{"Title":"Gourmet White Pizza","Description":"Yummy! This is a wonderful pizza for those who are looking to get away from the basic, cheese…"},{"Title":"Quick Italian Vegetable Soup","Description":"A quick Italian vegetable soup ready in less than an hour. A sprinkle of fresh grated Parmesan…"},{"Title":"Party Italian Wedding Soup","Description":"A large batch of traditional Italian Wedding soup. This soup offers plenty of meat,…"},{"Title":"Baked Fettuccine Lasagna","Description":"Creamy and comforting, this noodle casserole combines sauteed onion and bell peppers…"},{"Title":"Delicious and Easy Mock Risotto","Description":"If you love creamy risotto, but can't stand the fuss behind making it, this is a great and…"},{"Title":"My Best Chicken Piccata","Description":"Golden-brown pieces of chicken breast are served in a light lemon and white wine sauce…"},{"Title":"Cannoli","Description":"Ana and Lydia's cannoli, recipe invented on July 31st, 2005. I spent a lot of time looking for a…"},{"Title":"Lori's Spicy Chipotle Lasagna","Description":"This version of lasagna packs lots of flavor from Parmesan and Asiago!"},{"Title":"Beef Parmesan with Garlic Angel Hair Pasta","Description":"If you love garlic, try tossing angel hair pasta with garlic, butter, Parmesan and parsley. Use…"},{"Title":"Emily's Famous Tiramisu","Description":"Homemade ladyfingers are soaked in a rum-coffee syrup and layered with sweetened…"},{"Title":"Meatloaf with Italian Sausage","Description":"Ground beef and Italian sausage mixed with bell pepper, onion, hot wheat cereal and meatloaf…"},{"Title":"Shrimp Linguine with Tomatoes","Description":"Pasta with shrimp in a creamy cheese and herb sauce. I created this dish after trying a similar…"},{"Title":"Pork Chops with Italian Sausage","Description":"Popular Italian ingredients like mushrooms, sausage, red wine and herbs make this pork…"},{"Title":"Ricotta Cookies II","Description":"Delicate Italian ricotta cookies with an almond flavored glaze. Very good!"},{"Title":"Osso Buco","Description":"Osso Buco is an Italian dish made with veal shanks, browned and simmered with…"},{"Title":"Bowties and Broccoli","Description":"Bowties, steamed broccoli, and Romano cheese - Delicious!"},{"Title":"Mom's Best Spaghetti Sauce","Description":"A long, slow simmer of tomatoes, basil, mushrooms, onions, garlic, salt, pepper, sugar…"},{"Title":"Spaghetti With Marinara Sauce","Description":"You'll find many uses for this versatile pasta sauce. Let tomatoes, garlic, sugar, parsley,…"},{"Title":"Ham and Fresh Basil Pinwheels","Description":"Italian standbys--like fresh basil and sun-dried tomatoes--roll up here with ham, cheese and…"},{"Title":"Brenda's Lasagna","Description":"Rich, gooey ricotta and mozzarella are accented by tangy Cheddar, layered with ground beef…"},{"Title":"Sicilian Spaghetti","Description":"Anchovies sauteed with garlic and oil makes a pungently tasty sauce for hot spaghetti. Add…"},{"Title":"Sun-dried Tomatoes I","Description":"Worth their weight in gold. Four pounds of tomatoes and a bit of salt produce a quart of…"},{"Title":"Pasta with Pesto and Scallops","Description":"A fragrant saute of onions, garlic, bell pepper and mushrooms is simmered with white wine…"},{"Title":"Veal Marsala","Description":"Veal cutlets are pounded thin, breaded and cooked in a skillet with butter, mushrooms…"},{"Title":"Zucchini Parmigiana","Description":"Breaded zucchini slices are layered with tomato sauce, ricotta cheese, and mozzarella!"},{"Title":"How to Make Bolognese Sauce","Description":"Chef John's hearty and intensely flavorful Bolognese sauce is more than just a pasta…"},{"Title":"Baked Shrimp Scampi","Description":"Tender shrimp are tossed with butter, garlic, and lemon juice and baked with Italian-seasoned…"},{"Title":"Quick Italian Pasta Salad","Description":"A quick and flavorful pasta salad with salami and bell peppers."},{"Title":"Meatball Grinders with a Yummy Sauce","Description":"Meatballs simmered in pizza sauce and sweetened with apple jelly are served on…"},{"Title":"Vodka Rigatoni","Description":"Roasted peppers and salty prosciutto jump into a saucepan with crushed tomatoes, parsley,…"},{"Title":"Homemade Noodles","Description":"It just takes a few minutes to make wonderful, homemade noodles. All you need is flour, egg…"},{"Title":"Pasta/Pizza Sauce","Description":"A versatile pizza sauce made with tomato paste, Italian herbs and Parmesan cheese."},{"Title":"Spicy Italian Salad","Description":"A marinated artichoke dressing and two types of olives are the highlight of this zesty romaine…"},{"Title":"Pepperoni Stuffed Mushrooms","Description":"Baked, stuffed mushroom caps make a deliciously impressive appetizer for meals or…"},{"Title":"Caprese Chicken","Description":"Chicken breasts are marinated in Italian dressing, seared in a hot skillet, and baked…"},{"Title":"Pasta Melanzana","Description":"A quick, flavorful way to cook eggplant. This is a tasty one-dish meal prepared with spinach…"},{"Title":"Scrambled Eggs with Zucchini","Description":"Adding zucchini, Parmesan cheese, and garlic powder to eggs makes for a delicious meal at…"},{"Title":"Kelli's Fried Green Zucchini","Description":"Fresh zucchini are sliced and coated with seasoned crumbs, then fried in olive oil,…"},{"Title":"Easy Olive Oil, Tomato, and Basil Pasta","Description":"This is a great pasta that can be eaten at room temperature or as a cold salad. Instant,…"},{"Title":"Chicken and Asparagus Fettuccine","Description":"This is so rich and filling that one serving goes a long way. Crusty bread and a salad is all this…"},{"Title":"Creamy Artichoke Pasta","Description":"This is a great fast and simple pasta dish, with a sauce that is lower in fat, yet creamy! If you…"},{"Title":"Italian Cream Cake I","Description":"This is a wonderful, award winning cake. Feel free to substitute your favorite nuts for the…"},{"Title":"Italian Green Beans","Description":"Fresh green beans are simmered with butter and Italian dressing."},{"Title":"Grandma Maggio's Spaghetti Sauce","Description":"Grandma Maggio handed down her recipe for a sweet, garlicky tomato sauce with lots of fresh…"},{"Title":"Shrimp and Asparagus Fettuccine","Description":"A simple, light combination of fresh asparagus, shrimp, and Parmesan cheese is served with…"},{"Title":"Italian Green Bean Chicken","Description":"This is a really flavorful dish featuring simmered chicken and green beans in a simple tomato…"},{"Title":"Pasta Primavera Sauce","Description":"Tomatoes, broccoli, zucchini, bell pepper, onion, and herbs make up this easy fresh-tasting sauce."},{"Title":"Florentine Stuffed Chicken","Description":"Bone-in chicken breasts stuffed with spinach, cheese and onion and baked until tender. This…"},{"Title":"Easter Meat Pie","Description":"This meat pie is a winner every Easter. Stuffed full of ham, salami, and prosciutto, as well as…"},{"Title":"Basil Pesto Bread Rounds","Description":"A very easy and versatile recipe of a pesto topping on French bread slices. One of my…"},{"Title":"Lighter Chicken Fettuccine Alfredo","Description":"Chef John's version of chicken fettuccine alfredo is lightened by substituting some of the heavy…"},{"Title":"Deep Dish Lasagna","Description":"Always a crowd-pleaser: lasagna with mozzarella, ricotta, and Parmesan cheeses,…"},{"Title":"Mozzarella Parmesan Chicken","Description":"Using lowfat cheese and soups, this creamy baked chicken will fool everyone who thinks…"},{"Title":"Braciola I","Description":"Top round steak slices are stuffed and rolled, sauteed in olive oil, then simmered in tomato…"},{"Title":"Pinwheel Italian Calzones","Description":"Once you try these mini calzones, you may never go back to fixing the large ones again! …"},{"Title":"Olive Oil Dip for Italian Bread","Description":"Dip your bread in olive oil seasoned with fresh garlic, balsamic vinegar, Parmesan cheese,…"},{"Title":"Mediterranean Crusted Chicken","Description":"A deliciously rich chicken entree that is best served with mild side dishes such as sauteed…"},{"Title":"Meatball Cookies","Description":"Italian, Christmas cookie, round, chocolate and spicy. The smell always gets me charged for…"},{"Title":"Catfish Tuscany","Description":"Succulent broiled fish fillets topped with a Mediterranean-inspired blend of cheese and…"},{"Title":"Italian-Style Swiss Chard","Description":"Swiss chard is a staple in many European kitchens, this Italian family recipe is easy to…"},{"Title":"Turkey Pinwheel","Description":"Ground turkey makes a tasty rolled meatloaf with Italian flavors and a surprise filling of…"},{"Title":"Kid's Favorite Pizza Casserole","Description":"This easy pizza-flavored macaroni casserole will delight both your family and your budget."},{"Title":"Italian Bread II","Description":"Mixed in the bread machine, this easy yeast bread with olive oil and a dusting of cornmeal…"},{"Title":"Layered Eggplant Hamburger Casserole","Description":"Eggplant goes great with tomato, hamburger and garlic in this easy-to-prepare and…"},{"Title":"Italian Beef in a Bucket","Description":"Italian beef prepared with pantry ingredients. This is wonderful for Super Bowl and parties! …"},{"Title":"Deep Dish Alfredo Pizza","Description":"A family favorite, that is rich, cheesy, creamy and oh so good! The crust may also be prepared in…"},{"Title":"Tofu and Cheese Stuffed Shells","Description":"Jumbo pasta shells are stuffed with a creamy mixture of tofu, carrot, zucchini, onion and…"},{"Title":"Italian Seasoning II","Description":"Better than already prepared types because you can adjust it to your taste. I use the bulk…"},{"Title":"Hot Italian Sausage","Description":"An Italian friend of mine had an Italian restaurant and used this recipe for over 30…"},{"Title":"Italian Leafy Green Salad","Description":"This is a very, very healthy and hearty salad with a fabulous grapeseed oil and balsamic vinegar…"},{"Title":"Minestrone Soup","Description":"This soup uses vegetable stock for the base and then goes on beautifully from there. Fresh…"},{"Title":"Classic Chicken Tetrazzini","Description":"An Italian feast, this dish pairs earthy mushrooms with a nutty Swiss cheese cream…"},{"Title":"Strawberry Goat Cheese Bruschetta","Description":"Charred Italian bread is topped with creamy goat cheese and a mixture of strawberries and…"},{"Title":"Cream Cheese Alfredo Sauce","Description":"A smooth and creamy white sauce with portobello mushrooms is all it takes to make…"},{"Title":"Garlic Cheese Flatbread","Description":"Golden brown, chewy and cheesy, this recipe is a hit with Italian dishes."},{"Title":"Goat Cheese Arugula Pizza - No Red Sauce!","Description":"This pesto-based pizza is an amazingly simple and delicious variation to your regular pizza.…"},{"Title":"Kale Puttanesca","Description":"Whole wheat angel hair pasta and chopped kale receive the puttanesca treatment of capers,…"},{"Title":"Daddy's Sausage and Peppers","Description":"This is a great recipe for anyone who loves bell peppers! My dad always made this for me…"},{"Title":"Mozzarella Puffs","Description":"Buttermilk biscuits are stuffed with mozzarella cheese, covered in pizza sauce and baked to…"},{"Title":"Restaurant Style Lasagna","Description":"Three types of cheese make this lasagna with meat sauce a cheesy, savory delight!"},{"Title":"Blueberry Ricotta Squares","Description":"A blueberry coffeecake with a ricotta cheese topping. Reminiscent of cheesecake, this…"},{"Title":"Provincial Tomatoes","Description":"Delicious fresh tomatoes broiled with a tasty cheese topping."},{"Title":"Stuffed Eggplant","Description":"A large eggplant is hollowed out, and it's flesh is mixed with Italian sausage, garlic, bread…"},{"Title":"Chicken Piccata III","Description":"This spin on the original features the addition of mushrooms and artichokes in the lemony sauce."},{"Title":"Pasta Shells Florentine","Description":"Everything about this entree is big. Big pasta shells, lots of great ingredients, and a huge…"},{"Title":"Italian Country Style Ribs","Description":"Country style ribs smothered in hearty stewed tomatoes are easy to make when you use a jar…"},{"Title":"Nikki's Steak Saltimbocca","Description":"Steak is pounded thin and rolled up with fresh sage, provolone cheese and prosciutto. This is…"},{"Title":"Creamy Baked Ziti","Description":"Ziti pasta bakes with layers of creamy tomato sauce and mozzarella cheese in an easy and…"},{"Title":"How to Make Homemade Pizza Sauce","Description":"It's so easy to whip up your own pizza sauce with plenty of garlic in a tomato base. Chef…"},{"Title":"That's-a Meatloaf","Description":"Interesting, elegant twist on the same old meatloaf. Good enough for company, easy…"},{"Title":"Bow Tie Medley","Description":"This is a great recipe for a vegetarian pasta dish full of flavor. Colorful green and yellow…"},{"Title":"Garlic Penne Pasta","Description":"This recipe is so easy to make, tastes great and is a big hit at dinner time. It's even a hit as…"},{"Title":"Roasted Veggie Pasta","Description":"Wonderful rustic Italian style pasta dish! Meal can be dressed up or down with…"},{"Title":"Bruschetta I","Description":"Fresh tomatoes, parsley, chives, garlic and basil create this beautiful, tasty dish. Add balsamic…"},{"Title":"Italian Cheese Bread","Description":"Fiery pepper-Jack cheese is combined with powdered cheese, black pepper and Italian…"},{"Title":"Pressure Cooker Italian Chicken Soup","Description":"Using a pressure cooker to make this flavorful chicken soup speeds time cooking the pearl…"},{"Title":"Italian Meatloaf in Zucchini Boats","Description":"Meatloaf with Italian flavors is baked inside hollowed-out zucchini boats, and topped with…"},{"Title":"Caprese Burger","Description":"I am always looking for ways to jazz up the boring burger and came up with this after…"},{"Title":"Italian Lasagna","Description":"There is nothing timid about the flavors of this meaty lasagna. Hot Italian sausages are…"},{"Title":"Italian Bread Baked on a Pizza Stone","Description":"Mixed in the bread machine, this easy yeast bread with olive oil and a dusting of cornmeal…"},{"Title":"Sicilian Sausage Soup","Description":"Italian sausage browned with fennel seeds is the beginning of this tomato and chicken broth…"},{"Title":"Three Animal Italian Meatballs","Description":"Turkey, beef, and Italian sausage meatballs that go perfectly with your favorite marinara…"},{"Title":"Slow Cooker Rosemary and Red Pepper Chicken","Description":"In Italy, spirited chicken dishes like this one are known as 'pollo alla contadina' or…"},{"Title":"Lazy Lasagna II","Description":"A simple version of lasagna using cheese ravioli, browned beef, onion and plenty of mozzarella…"},{"Title":"Johnny Marzetti Casserole","Description":"You can't go wrong with these ingredients! A homemade tomato and meat sauce mingles…"},{"Title":"Chef John's Pork al Latte","Description":"When the weather gets a little colder, this pork stew really hits the spot. Pork shoulder meat…"},{"Title":"Chef John's Beans and Greens","Description":"This delicious, soulful beans and greens recipe combine Cannellini beans in a flavorful broth…"},{"Title":"Marinara Sauce II","Description":"Quick and easy red sauce with sauteed garlic, onion seasoned with Italian seasonings."},{"Title":"Italian Beef Sandwiches","Description":"Beef rump slowly roasted with Italian seasonings until tender. Whenever these were…"},{"Title":"Bruschetta with Shallots","Description":"Shallots are the special ingredient in this easy, filling bruschetta. The tomato mixture tastes…"},{"Title":"Old Italian Meat Sauce","Description":"A long simmer of tomatoes with ground beef and pork is wonderfully flavored with…"},{"Title":"Eggplant Pizzas","Description":"A lightly fried slice of eggplant replaces the dough in this versatile pizza."},{"Title":"Bob's Slow Cooker Braciole","Description":"Your slow cooker provides the perfect low and slow heat to braise this traditional Italian…"},{"Title":"Refreshing Limoncello Cake","Description":"Fluffy cake infused with lemony limoncello liqueur is the perfect ending to an Italian dinner."},{"Title":"Spaghetti Squash Primavera","Description":"Spaghetti squash stands in for pasta and is tossed with zucchini, bell pepper, tomato, and…"},{"Title":"Penne with Pancetta and Mushrooms","Description":"I threw this dish of penne pasta, pancetta bacon, and mushrooms together one afternoon for…"},{"Title":"Tuscan Bean, Chicken, and Italian Sausage Soup","Description":"Using canned beans and tomatoes helps make a quick Italian-style soup featuring spinach and…"},{"Title":"Chicken Saltimbocca","Description":"Chicken breasts with slices of prosciutto ham and Provolone cheese, braised in white wine.…"},{"Title":"Italian Almond Cookies II","Description":"This cookie is very chewy on the inside and crisp on the outside, BUT the entire outside is…"},{"Title":"Tasty Spaghetti Sauce","Description":"A quick and tasty spaghetti sauce. I make it for my family all the time, and they love it. Spoon…"},{"Title":"Veal Chop with Portabello Mushrooms","Description":"A quick, delicious entree that is sure to impress any guest, and so easy to throw together. Veal…"},{"Title":"Sicilian Lentil Pasta Sauce","Description":"Onions, mushrooms, garlic and bits of zucchini are saut Eed until tender and then cooked…"},{"Title":"Orange Almond Biscotti II","Description":"These biscotti are very low in fat but they are delicious. You can substitute the almonds…"},{"Title":"Balsamic Glaze","Description":"This is the balsamic glaze you want to keep on hand to brush on burgers, meats, fish, or…"},{"Title":"Zucchini e Pomodori Gratinati (Zucchini and Tomato Gratin)","Description":"Slices of pan-fried zucchini alternate with mozzarella cheese and sliced tomatoes to…"},{"Title":"Homemade Chicken Cacciatore, Sicilian-Style","Description":"This recipe is made with tomatoes, onions, peppers, wine, and seasonings."},{"Title":"Tomato and Basil Pasta Sauce","Description":"Fresh basil is added to a sauce made of canned tomatoes simmered with balsamic vinegar,…"},{"Title":"Risotto with Chicken and Asparagus","Description":"A delicious, authentic-tasting Italian risotto with chicken and asparagus. Perfect with a glass of…"},{"Title":"Kim's Lasagna","Description":"A big baked lasagna features Italian sausage, ground beef, and 3 kinds of Italian cheeses…"},{"Title":"Mariu's Spaghetti with Meat Sauce","Description":"An authentic Italian recipe for a savory spaghetti sauce made with ground beef, onion, celery,…"},{"Title":"Asparagus Lasagna","Description":"This dish has a nice flavor and is fairly easy to make. Ham, asparagus spears, mozzarella and…"},{"Title":"Beefy Manicotti","Description":"This is a very filling, easy to make manicotti dish my whole family loves- including my picky 2…"},{"Title":"Gelato","Description":"Basic Gelato Recipe...from my Italian mother-in-law. This recipe may be used as a base for…"},{"Title":"Tuscan Chicken","Description":"Only four ingredients are needed to make this hearty Italian inspired chicken dinner. Serve…"},{"Title":"Manicotti with Cheese","Description":"Stuff hearty tubes of cooked manicotti with a fabulously rich blend of ricotta, mozzarella,…"},{"Title":"Mushroom Sauce for Pasta","Description":"Mushrooms and bell peppers, sauteed with onions and butter until perfectly tender, are…"},{"Title":"Hearty Italian Meatball Soup","Description":"Using canned beef broth and diced Italian-style tomatoes and frozen meatballs and…"},{"Title":"Easy Vegetarian Spinach Lasagna","Description":"An easy vegetarian lasagna is filled with spinach and ricotta cheese and has a topping of…"},{"Title":"Ham and Butternut Squash Spaghetti","Description":"Smoked ham, butternut squash, and mascarpone cheese combine to create a…"}]