[{"Title":"Chicken Tortilla Soup V","Description":"Lemon juice brightens the flavors in this chicken, corn and salsa soup seasoned with…"},{"Title":"Slow Cooker Taco Soup","Description":"Browned ground beef seasoned with a package of taco seasoning is combined in a slow…"},{"Title":"Delicious Black Bean Burritos","Description":"Onions, bell peppers and jalapenos are heated in a skillet. Black beans come next and then…"},{"Title":"Black Bean and Salsa Soup","Description":"Black beans, salsa, veggie broth and cumin are tossed into the blender. Transfer to a pot and…"},{"Title":"Slow Cooker Carnitas","Description":"Pork simmered in broth and seasonings makes a great filling for tamales and tacos in this slow…"},{"Title":"Black Bean and Corn Quesadillas","Description":"These black bean and corn quesadillas are really cheesy, a little bit spicy, and a little bit sweet. …"},{"Title":"Chicken Tortilla Soup I","Description":"This chicken tortilla soup is quick to make, flavorful, and filling, plus it freezes well.…"},{"Title":"Spanish Rice II","Description":"Rice is sauteed with onion and green bell pepper, and then simmered with water,…"},{"Title":"Slow Cooker Cilantro Lime Chicken","Description":"Chicken breasts, slow-cooked in Mexican-inspired cilantro-lime salsa, makes tasty taco…"},{"Title":"Tres Leches (Milk Cake)","Description":"This light and fluffy tres leches cake recipe uses four types of milk and is topped with whipped…"},{"Title":"Salsa Chicken Rice Casserole","Description":"Layers of rice, chicken, cheese, and a creamy salsa sauce are baked in an easy, flavorful…"},{"Title":"Marinated Flank Steak","Description":"Flank steak is marinated in a flavorful blend of soy sauce, red wine vinegar, and…"},{"Title":"Cottage Cheese Chicken Enchiladas","Description":"Cottage cheese lends a lighter texture to chicken and cheese enchiladas, bathed in classic red…"},{"Title":"Southwestern Egg Rolls","Description":"An assortment of traditional Southwestern-style ingredients are wrapped inside small flour…"},{"Title":"Spicy Bean Salsa","Description":"Also known as 'cowboy caviar', this twist on traditional salsa is enlivened with black…"},{"Title":"Ten Minute Enchilada Sauce","Description":"A super speedy enchilada sauce with a truly authentic taste."},{"Title":"Chicken Enchiladas V","Description":"A spicy chicken and chile pepper mixture is blended with a creamy soup mixture, rolled…"},{"Title":"Spinach Enchiladas","Description":"If you like spinach and Mexican food, you'll love these easy vegetarian enchiladas made with…"},{"Title":"Homemade Flour Tortillas","Description":"This homemade flour tortilla recipe produces warm and soft tortillas perfect for soft tacos or…"},{"Title":"Fabulous Wet Burritos","Description":"Flour tortillas are filled with a mixture of ground beef, refried beans, and chiles then topped…"},{"Title":"Absolute Mexican Cornbread","Description":"This has got to be the tastiest and the most moist cornbread I have ever made. It is the…"},{"Title":"Chipotle Crusted Pork Tenderloin","Description":"Sweet and spicy rub for pork tenderloins. Just coat, let stand for 20 minutes and grill! Goes…"},{"Title":"Charley's Slow Cooker Mexican Style Meat","Description":"A hot and spicy chuck roast that can be made into burritos, tacos, or any number of other…"},{"Title":"Pollo Fajitas","Description":"Fajitas at home! Chicken briefly steeps in a zesty marinade before a saute with onions and…"},{"Title":"Taqueria Style Tacos - Carne Asada","Description":"This is a great recipe for authentic Mexican taqueria style carne asada tacos (beef tacos).…"},{"Title":"Beef and Bean Chimichangas","Description":"This is an awesome recipe, if you like Mexican food! These tasty beef and bean treats are…"},{"Title":"Easy Chicken Enchiladas","Description":"This is a great recipe for a quick dinner. There aren't many ingredients and doesn't take a lot…"},{"Title":"Beer Margaritas","Description":"Who would believe that beer would be the perfect solution to eradicating fluorescent…"},{"Title":"D's Famous Salsa","Description":"You can make this salsa as fiery as you like by adding more or less peppers. But whatever…"},{"Title":"Chicken Quesadillas","Description":"Zesty chicken and cooked peppers are a tasty delight when mixed with cheese and stuffed…"},{"Title":"Mexican Rice III","Description":"This is an excellent authentic Mexican rice recipe (not to be confused with Spanish rice) that I…"},{"Title":"Grilled Fish Tacos with Chipotle-Lime Dressing","Description":"Marinated tilapia fillets are grilled instead of fried in this tangy, flavorful twist on fish tacos."},{"Title":"Chili Rellenos Casserole","Description":"This Chili Rellenos Casserole is very easy to prepare and is loaded with flavor. Great for a…"},{"Title":"Avocado, Tomato and Mango Salsa","Description":"Looking for a refreshing salsa for a warm summer evening? This is our favorite. Serve…"},{"Title":"Terrific Turkey Chili","Description":"This quick turkey chili recipe using zucchini, green onion, sour cream, and cheddar cheese…"},{"Title":"Mexican Casserole","Description":"Chicken breast simmered with a spicy black bean and corn mixture, then topped with…"},{"Title":"Beef Enchiladas II","Description":"Simple and quick beef enchiladas. Ground beef and onion are wrapped in flour tortillas,…"},{"Title":"Amy's Cilantro Cream Sauce","Description":"A spicy light green sauce fragrant with cilantro. Refreshing."},{"Title":"Tacos in Pasta Shells","Description":"Jumbo pasta shells stuffed with a rich, spicy blend of cooked ground beef, cream cheese,…"},{"Title":"Mexican Baked Fish","Description":"Make this Mexican baked fish as hot or mild as you like. Serve with rice, black beans, warm…"},{"Title":"Pico de Gallo Chicken Quesadillas","Description":"Pico de gallo combines with Jack cheese and a saute of chicken, onion and green pepper to…"},{"Title":"Easy Guacamole","Description":"A simple go-to guacamole recipe that makes you beg for more. Try it if you're learning how to…"},{"Title":"Quick and Easy Green Chile Chicken Enchilada Casserole","Description":"Shredded chicken is layered with charred tortillas, sour cream, cheese, and enchilada…"},{"Title":"Ground Beef Enchiladas","Description":"These are beef filled tortilla shells baked in a creamy chicken soup and cheese sauce. My…"},{"Title":"Beef Nacho Casserole","Description":"A simple meal to whip up in less than an hour that even the kids are sure to love. Layers of…"},{"Title":"Fiery Fish Tacos with Crunchy Corn Salsa","Description":"Spicy grilled fish are cooled down with a fresh crunchy veggie salsa featuring fresh corn. Your…"},{"Title":"Slow Cooker Enchiladas","Description":"An old Mexican classic with a new twist. Anytime we have a potluck, I am asked to bring these.…"},{"Title":"Red Enchilada Sauce","Description":"Tomato sauce is simmered with sauteed onion, salsa, and herbs, including cumin and…"},{"Title":"Salsa Chicken Burrito Filling","Description":"Chicken simmered with tomato sauce, salsa and seasonings - a great standard burrito filling."},{"Title":"Fajita Seasoning","Description":"Use this recipe as a DIY replacement for a prepared packet of fajita seasoning."},{"Title":"Quick and Easy Mexican Chicken","Description":"Seasoned chicken bakes under a crown of salsa and cheese. Served over rice or buttered…"},{"Title":"Seven Layer Tortilla Pie","Description":"Southwest cooking at its best. Two different kinds of beans are zipped up with picante…"},{"Title":"Apple Enchilada Dessert","Description":"Apples rolled in flour tortillas. VERY delicious, easy and fast to make. Substitute apples with…"},{"Title":"Layered Chicken and Black Bean Enchilada Casserole","Description":"Layers of sauce and tortillas mingle with a seasoned chicken and black bean mixture.…"},{"Title":"Fajita Marinade I","Description":"Delicious fajita marinade made with lime juice, olive oil, and soy sauce, and spiced up with…"},{"Title":"Best Black Beans","Description":"This simple black beans recipe works well with your favorite rice as a side dish for Mexican…"},{"Title":"Outrageous Warm Chicken Nacho Dip","Description":"Shredded chicken, tomatoes, and jalapeno peppers join Velveeta® in this addictive dip."},{"Title":"Tater Tot Taco Casserole","Description":"This recipe gives you a Mexican-style version of tater tot casserole."},{"Title":"Lime Cilantro Rice","Description":"Provide some flair to your rice by adding lime zest, lime juice, and cilantro."},{"Title":"Churros","Description":"These sweet Mexican fritters are easy to make at home!"},{"Title":"Southwest Chicken","Description":"Healthy and hearty, chicken simmers with tomatoes, black beans and corn."},{"Title":"Vegetarian Tortilla Soup","Description":"Simple and delicious. It's also vegan if you don't add the cheese at the end. If you prefer a…"},{"Title":"Sweet Corn Cake","Description":"Corn flour, or masa harina, is available at many larger grocers. Here it blends with corn meal,…"},{"Title":"Fresh Tomato Salsa","Description":"Finely chopped Serrano chilies make this salsa nippy and nice. Combine with tomatoes,…"},{"Title":"Chicken Enchilada Casserole II","Description":"Strata of tortillas, chicken, cheese and a hot salsa-bean-sour cream mixture make these…"},{"Title":"Sopapilla Cheesecake Dessert","Description":"Cream cheese, canned crescent rolls, cinnamon, and almonds create this delicious,…"},{"Title":"Mexican Chicken Corn Chowder","Description":"This creamy chicken and corn chowder, made spicy with ground cumin, green chilies, and…"},{"Title":"Enchiladas Suizas","Description":"Corn tortillas rolled up with shredded chicken and 2 kinds of cheese, and then served with a…"},{"Title":"Chicken Fiesta Salad","Description":"Salad greens, onions and tomatoes are topped with Mexican flavored black beans, corn, and…"},{"Title":"Whit's Chicken Enchiladas","Description":"Wonderful, cheesy chicken enchiladas that are easy to prepare. Everyone I have made these…"},{"Title":"Best Guacamole","Description":"For chips or a taco topping, guacamole--enhanced with lemon and onion--is a forever…"},{"Title":"Make Ahead Lunch Wraps","Description":"These are a delicious make-ahead lunch to freeze as a handy lunch to bring to work! Just…"},{"Title":"Hot Bean Dip","Description":"This bean dip is sooooo good. It is easy to make and is always a hit. I make it for my Super…"},{"Title":"Sour Cream Chicken Enchiladas","Description":"Plenty of heat to fire you up in these cheesy chicken enchiladas with salsa and jalapenos.…"},{"Title":"Nacho Cheese Sauce","Description":"Here's a simple cheese sauce to spread over tortilla chips. Add some jalapenos to spice…"},{"Title":"Margaritas","Description":"Frozen margaritas are made with limeade concentrate, tequila, triple sec, and ice."},{"Title":"Chicken Chimichangas with Sour Cream Sauce","Description":"Green chiles and Monterey Jack cheese make these chimichangas special."},{"Title":"Seven Layer Dip I","Description":"This is a great party dip because it's best served at room temperature. You can set it out on the…"},{"Title":"Albondigas","Description":"This is a quick and easy recipe that tastes delicious. Carrots and potatoes, with salsa…"},{"Title":"Jimmy's Mexican Pizza","Description":"Jimmy's specially seasoned ground beef, refried beans, salsa, and cheese layered between two…"},{"Title":"Authentic Enchiladas Verdes","Description":"These enchiladas are made with a fresh green salsa, just like you would find in a Mexican…"},{"Title":"Gerry's Chicken Enchiladas","Description":"These enchiladas are filled with chicken first simmered in tomatoes, chile peppers, and…"},{"Title":"Restaurant Style Chicken Nachos","Description":"Tortilla chips are topped with a chicken and salsa mixture, melted cheese and tomato.…"},{"Title":"Mexican Lasagna","Description":"My whole family loves this beefy lasagna flavored with taco seasoning. Even my picky…"},{"Title":"Tomatillo Salsa Verde","Description":"This authentic Mexican salsa verde has a fabulous flavor. Use it on chicken enchiladas…"},{"Title":"Cilantro-Lime Dressing","Description":"Fresh lime juice, cilantro, honey, and olive oil are the main components of this cilantro-lime…"},{"Title":"Mexican Beef Casserole","Description":"Like a giant baked taco! Ground beef with Ranch Style beans and tomatoes on top of corn…"},{"Title":"Hot Tamale Pie","Description":"Chef John's ground beef and cornbread casserole gives you delicious tamale flavors in…"},{"Title":"Taco Lasagna","Description":"A baked taco-style lasagna with layers of corn tortillas, salsa, seasoned ground beef and…"},{"Title":"Seafood Enchiladas","Description":"These crab and shrimp stuffed enchiladas taste like the ones served at a popular Mexican…"},{"Title":"Chicken Flautas","Description":"Lightly crisped corn tortillas are stuffed with a zesty chicken and cheese filling."},{"Title":"Mexican Style Shredded Pork","Description":"This is an amazing shredded pork recipe. It is easy to prepare and simmers in a slow cooker…"},{"Title":"Hot Mexican Spinach Dip","Description":"Take your taste buds on a wild joyride to old Mexico with this hot, creamy dip. Spinach,…"},{"Title":"Lisa's Favorite Carne Asada Marinade","Description":"I've tried many marinade recipes for carne asada and this spicy, citrusy version is our…"},{"Title":"Pico de Gallo","Description":"This fresh tomato salsa is made with red onion, minced jalapeno, lime juice, and seasonings.…"},{"Title":"Dee's Roast Pork for Tacos","Description":"This is a dish that will make your tongue jump out of your mouth, slap you in the face, and…"},{"Title":"Pico De Gallo","Description":"Pico de gallo, made with fresh tomato, onion, and jalapeno, is perfect for serving with your…"},{"Title":"Enchilada Casserole III","Description":"This is a layered casserole with ground beef, corn tortillas, enchilada sauce and refried…"},{"Title":"Lola's Horchata","Description":"A refreshing Mexican drink made with rice, milk, vanilla, and cinnamon. A great balance for…"},{"Title":"Taco Salad I","Description":"Put a twist on conventional taco salad recipe with this quick version using French dressing."},{"Title":"Baked Tortilla Chips","Description":"Cumin and lime juice add a real zing to these chips, and they're best when served warm."},{"Title":"Chicken Enchilada Soup III","Description":"Shredded chicken is simmered with masa harina, enchilada sauce and Cheddar cheese…"},{"Title":"Chicken Suiza Cornbread Bake","Description":"In this lightly spiced Mexican-inspired casserole, a layer of cornbread is baked with diced…"},{"Title":"Farmer's Market Vegetarian Quesadillas","Description":"Making the most of simple, fresh ingredients found at your local Farmer's Market, these…"},{"Title":"Shredded Beef Enchiladas","Description":"Corn tortillas filled with shredded beef, sour cream, onion, green chilies, then covered with…"},{"Title":"Vegetarian Mexican Inspired Stuffed Peppers","Description":"Green bell peppers are stuffed with rice, chili-style tomatoes, and Mexican cheese blend,…"},{"Title":"Pork Carnitas","Description":"Many find carnitas a little dry or flavorless. These have a great, distinctive flavor and are…"},{"Title":"Campbell's(R) Easy Chicken and Cheese Enchiladas","Description":"A creamy filling of chicken, sour cream, and cheese gets an added \"kick\" stirred into it…"},{"Title":"Black Bean Salad","Description":"This salad is a kaleidoscope of color and taste - black beans, yellow corn, green peppers, and…"},{"Title":"\"Pantry Raid\" Chicken Enchilada Casserole","Description":"With some chicken, a box of corn bread mix, and a few pantry items, you can whip up a tasty…"},{"Title":"Heather's Cilantro, Black Bean, and Corn Salsa","Description":"This lively summer recipe can be served with tortilla chips as an appetizer, or with chicken…"},{"Title":"Fish Tacos with Honey-Cumin Cilantro Slaw and Chipotle Mayo","Description":"What's not to like about flavorful tacos stuffed with breaded, fried tilapia topped with…"},{"Title":"Authentic Mexican Tortillas","Description":"I learned how to make these growing up watching my mother Alma. We have never…"},{"Title":"Stuffed Mexican Peppers","Description":"Mexican-inspired ground beef and rice stuffing fills red or green bell peppers for a…"},{"Title":"Empanadas","Description":"Better make plenty - these disappear fast. The unbaked dough may be frozen. The baked…"},{"Title":"Homemade Taco Seasoning Mix","Description":"Taco seasoning mix is easy to make at home with the right spices, such as chili powder,…"},{"Title":"Mexican Shepherd's Pie","Description":"This is a Mexican version of the Shepherd's Pie that is so popular in the UK. I decided to try…"},{"Title":"Bean Quesadillas","Description":"Veggies, beans, and cheese sandwiched between two tortillas then heated in oil until…"},{"Title":"Enchiladas","Description":"A friend of mine gave me this recipe for ground beef enchiladas and it is delicious!"},{"Title":"Terry's Texas Pinto Beans","Description":"An old fashioned 'pot of beans' recipe. It starts with dry pinto beans, onion, and chicken…"},{"Title":"Jalapeno Cream Cheese Chicken Enchiladas","Description":"Your family will love this dish of creamy chicken breast meat and green chili enchiladas baked…"},{"Title":"Vegan Bean Taco Filling","Description":"Black beans mingle with onions, peppers, garlic, cornmeal, and spices in this tasty taco filling.…"},{"Title":"Ronaldo's Beef Carnitas","Description":"Chuck roast is wrapped in foil with Mexican-style seasonings, and cooked at low temperature…"},{"Title":"Taco Dip I","Description":"This is a scrumptious taco dip. When I use all low-fat ingredients, such as low-fat sour…"},{"Title":"Margarita Cake","Description":"A margarita - tequila, lime juice, triple sec - is baked into a cake mix."},{"Title":"Mexican Cream Cheese Rollups","Description":"These south-of-the-border hors d'oeuvres -- with a cream cheese base -- are rolled up in…"},{"Title":"Chicken Tortilla Soup II","Description":"Chopped corn tortillas are cooked into this chicken soup along with garlic, onions, cumin…"},{"Title":"Chicken Tortilla Soup III","Description":"The base for this chicken stew with Mexican seasonings is made by combining chicken…"},{"Title":"Chicken with Chipotle","Description":"Chicken legs are roasted, then simmered in a spicy, chipotle cream sauce for a true Mexican…"},{"Title":"Spinach Enchiladas Verde","Description":"Spinach and Monterey Jack cheese are wrapped in corn tortillas and baked with green salsa.…"},{"Title":"One Skillet Mexican Quinoa","Description":"Kids and adults love this recipe for one-skillet Mexican quinoa; perfect for Cinco de Mayo but…"},{"Title":"Mexican Shrimp Cocktail","Description":"Cooked shrimp are chilled in a spicy tomato-juice cocktail with avocado, red onion, and…"},{"Title":"Acapulco Chicken","Description":"A spicy saute of chicken breast, tomato, onion, bell pepper, jalapenos and hot pepper sauce!"},{"Title":"Seven Layer Dip II","Description":"My mom's Seven Layer Dip is a big hit at all small gatherings! Refried beans are layered…"},{"Title":"Apple Enchiladas","Description":"Flour tortillas filled with apple pie filling and smothered in a simple syrup are baked until…"},{"Title":"Chicken Chimi in the Oven","Description":"A fragrant, spicy chicken mixture is rolled up in flour tortillas and baked. This is my absolute…"},{"Title":"Pork Chalupas","Description":"A simple slow cooker meal! Pork roast is cooked all day with pinto beans in a seasoned sauce…"},{"Title":"Chicken Fajita Melts","Description":"These cheesy chicken sandwich melts have all of the flavor of fajitas without the drippy mess!"},{"Title":"Hamburger Casserole","Description":"Taco sauce and taco seasoning mix give Mexican flavor to this beef and noodle casserole in…"},{"Title":"Mexican Corn","Description":"Corn simmered with cream cheese, butter, jalapeno peppers and garlic."},{"Title":"Chicken Enchiladas with Creamy Green Chile Sauce","Description":"Chicken- and cheese-stuffed corn tortillas baked under a creamy sauce infused with hot green…"},{"Title":"Chicken Enchilada Slow Cooker Soup","Description":"Chicken breasts cook up tender and flavorful when slow-cooked in this enchilada-inspired…"},{"Title":"Tres Leches Cake","Description":"The three milks in this Mexican favorite soak into the sponge cake, making it creamy and…"},{"Title":"Mexican Whole Wheat Flour Tortillas","Description":"Mexican tortillas perfect for fajitas, quesadillas, Mexican pizzas, burritos, nachos. They freeze…"},{"Title":"Margarita Grilled Shrimp","Description":"The shrimp can be marinated up to 3 hours before grilling. The amount of red pepper…"},{"Title":"Chipotle Shrimp Tacos","Description":"Warm corn tortillas filled with spicy chipotle shrimp and garnished with cilantro, onion,…"},{"Title":"Best Beef Enchiladas","Description":"These easy enchiladas are stuffed with a savory filling of ground beef, Cheddar cheese, black…"},{"Title":"Mexican Corn on the Cob (Elote)","Description":"As served by street vendors in Mexico. Grilled ears of fresh corn are spread with mayonnaise…"},{"Title":"Simple Sweet and Spicy Chicken Wraps","Description":"A flour tortilla is filled with sweet, spicy chicken simmered in salsa, and rolled with a…"},{"Title":"Easy Chicken Fajita Soup","Description":"Fire roasted tomatoes, fajita seasoning, and seasoned black beans give this quick and…"},{"Title":"Taco Bake I","Description":"Browned ground beef mixed with dried taco seasoning is layered in a casserole with…"},{"Title":"Texas Chicken Quesadillas","Description":"These are quesadillas filled with chicken cooked in barbeque sauce, caramelized onions,…"},{"Title":"Polvorones de Canele (Cinnamon Cookies)","Description":"Polvorones de Canele (cinnamon cookies) are a Mexican-style cookie rolled in cinnamon sugar."},{"Title":"15-Minute Dinner Nachos Supreme","Description":"Taco-seasoned ground beef simmered with tomato and rice is topped with salsa, cheese…"},{"Title":"Sweet Corn Tomalito","Description":"Steamed corn pudding made on the stovetop. This is a traditional Tex-Mex side dish that is a…"},{"Title":"Mexican Sour Cream Rice","Description":"Baked rice with cheese, diced chiles, cilantro, corn, and sour cream. Would be great served…"},{"Title":"Mild Cheesy Chicken Enchiladas","Description":"Sour cream and Cheddar set a smooth tone for these basic enchiladas baked with tomatoes."},{"Title":"Avocado Salad","Description":"Fresh avocados tossed with sweet onion, green pepper, tomato, cilantro and lime juice."},{"Title":"Chicken Tacos","Description":"This recipe is quick and easy - good for those nights you don't have a lot of time to prepare…"},{"Title":"Mexican Quesadilla Casserole","Description":"Quesadillas and casseroles meet in this fairly easy recipe for feeding many mouths hungry…"},{"Title":"Southwestern-Flavored Ground Beef or Turkey for Tacos & Salad","Description":"With Southwestern-Flavored Ground Beef, you can simultaneously make tonight's dinner…"},{"Title":"Carnitas - Pressure Cooker","Description":"Pork butt is pressure-cooked to tender shreds with onion, garlic, orange, and a blend of…"},{"Title":"Slow Cooker Chile Verde","Description":"Chile Verde the easy way. A delightful blend of Mexican favorites without all of the hard work."},{"Title":"Mexican Wedding Cookies","Description":"Delicious nutty cookies that are rolled in powdered sugar. These are perfect for any…"},{"Title":"Spicy Tortilla Roll-Ups","Description":"This vegetarian special gets its bite from canned green chiles and hot pepper sauce; cream…"},{"Title":"Enchilada Sauce","Description":"Onion and garlic are sauteed with cumin, cinnamon and chili powder, then simmered…"},{"Title":"Shredded Chicken Tacos","Description":"Bone and skin are left on the chicken breasts so they're extra flavorful as they simmer in…"},{"Title":"Caldo de Res (Mexican Beef Soup)","Description":"This is an extremely hearty and satisfying soup, made from scratch with beef bones, cabbage,…"},{"Title":"Sopapilla Cheesecake","Description":"This is a quick, easy, and tasty dessert. A rich and creamy filling surrounded by a crispy…"},{"Title":"Margaritas on the Rocks","Description":"Sweet and sour, tequila, triple sec and Grand Marnier With a squeeze of fresh lime juice.…"},{"Title":"Tortillas I","Description":"This Mexican flatbread can be filled with almost any savory concoction. You can make them…"},{"Title":"Poblano Chile Enchiladas a la Gringa","Description":"Freshly roasted poblano chiles and sour cream create a piquant sauce bathing these chicken…"},{"Title":"Hot Corn Dip","Description":"Colorful and spicy, this creamy tortilla chip dip is a blend of corn, tomatoes and spices."},{"Title":"Sue's Taco Salad","Description":"This is a great dish for pot-lucks. It's easy, and can be made in advance. Add dressing just…"},{"Title":"Mexican Pasta","Description":"Pasta tossed with a quickly cooked sauce of tomatoes, onion, bell pepper, corn, black…"},{"Title":"Shredded Beef Chimichangas","Description":"Usually deep fried, chimichangas can also be oven-fried with less mess, fuss, and fat. Use…"},{"Title":"Brunch Enchiladas","Description":"A delicious breakfast casserole made with flour tortillas. Enchiladas filled with ham,…"},{"Title":"Fresh Salsa I","Description":"This all purpose salsa is great on tortilla chips, tacos and other Mexican-style favorites.…"},{"Title":"Oaxacan Tacos","Description":"I learned how to make these tacos while a man from Oaxaca, Mexico lived with my family. …"},{"Title":"Fabulous Fajitas","Description":"Wedges of onion and colorful bell pepper sauteed with chicken and mushrooms make…"},{"Title":"Tortillas II","Description":"Make a small batch of fresh, tasty wheat tortillas with this easy-to-follow recipe."},{"Title":"Real Homemade Tamales","Description":"I had been looking for a Tamale recipe for years. One day I went to the international market…"},{"Title":"Andy's Spicy Green Chile Pork","Description":"Cook pork shoulder, green salsa, onion, cilantro, and serrano chile peppers together in a slow…"},{"Title":"Mexican Wedding Cakes II","Description":"Light, crunchy, round, buttery balls, with chopped nuts in them, coated with…"},{"Title":"Shrimp and Crab Enchiladas","Description":"Enchiladas made with shrimp, crab and Jack cheese. This is a great dish with a…"},{"Title":"Mexican Zucchini Cheese Soup","Description":"This flavorful soup is made with chicken broth, zucchini, summer squash, and Velveeta®,…"},{"Title":"Restaurant-Style Taco Meat Seasoning","Description":"This tastes very close to the taco seasoning favored by a very popular fast-food taco…"},{"Title":"Real Sopapillas","Description":"Crispy Mexican flatbread deep fried and golden brown."},{"Title":"Salsa II","Description":"This is a very good salsa recipe. Simple ingredients are boiled and blended to created…"},{"Title":"Seven Layer Tex Mex Dip","Description":"This super seven layer dip is piled high with Mexican style goodies. Serve it with tortilla…"},{"Title":"Slow Cooker Taco Soup with Ranch Dressing Mix","Description":"This slow cooker soup will remind you of tacos."},{"Title":"Maria's Mexican Rice","Description":"A serrano pepper kept whole adds flavor without bringing heat to this Mexican-style…"},{"Title":"Authentic Mexican Breakfast Tacos","Description":"Quick Easy and Delicious! I learned this recipe from many years of eating with the Mexican…"},{"Title":"LuvAnn's Guacamole","Description":"This great dip is always the first to go at our barbeques. It's a simple guacamole, perfect…"},{"Title":"Chicken Chimichangas","Description":"Tortillas filled with a chicken, rice, beans and olive mixture - rolled, fried and topped with a…"},{"Title":"Restaurant-Style Tequila Lime Chicken","Description":"This spicy, marinated broiled chicken dish is the same as that of a well-known restaurant…"},{"Title":"Simple Carnitas","Description":"This the easiest recipe for tasty pork carnitas with a hint of orange flavor and plenty of garlic."},{"Title":"Quick and Easy Refried Beans","Description":"A simple combination of pinto beans, garlic, spices, and lime juice will give you refried…"},{"Title":"Mexican Layered Dip","Description":"Like seven-layer salad, but with zesty Mexican ingredients that you can easily tuck into with…"},{"Title":"Mexican Lasagna II","Description":"Seasoned ground beef and refried beans layered with cheese and tortillas and baked until hot…"},{"Title":"Smothered Mexican Lasagna","Description":"A layered casserole made with ground turkey, ricotta and flour tortillas."},{"Title":"Chile Verde II","Description":"A delicious Mexican dish of pork simmered in tomatillos and chiles."},{"Title":"Easy Mashed Potato and Roasted Vegetable Enchiladas","Description":"This is the perfect comfort food for cold days. To make it vegan, substitute non-dairy…"},{"Title":"Taco Salad III","Description":"Seasoned ground beef, pinto and kidney beans, lettuce, tomatoes, Cheddar cheese, and…"},{"Title":"Chicken Taco Casserole","Description":"All of your favorite taco fixings can be found in this crowd-pleasing casserole. Plus, it uses…"},{"Title":"Avocado Mango Salsa","Description":"Yowzers! Sweet and hot salsa with tangy mangoes and habaneros. Great with pork,…"},{"Title":"Vegetarian Tortilla Stew","Description":"A delicious tortilla soup for vegetarians! The veggie chicken is optional, but adds a nice…"},{"Title":"Slow Cooker Spicy Chicken","Description":"Chicken breasts slowly simmer until very tender in an easy mixture of salsa, garlic, onion, and…"},{"Title":"Simple Slow-Cooked Korean Beef Soft Tacos","Description":"Beef gets a Korean spin in this preparation for taco filling with ginger, soy sauce, garlic, and…"},{"Title":"Antojitos Minis","Description":"These little Mexican inspired appetizers are easy to prepare and the many ingredients may be…"},{"Title":"Mexican Casserole","Description":"Small dinner pie made with salsa, tortillas, refried beans, cheese, and onions."},{"Title":"Mexican Rice","Description":"Saffron gives this special rice a wonderful flavor and color, along with cumin and chili powder.…"},{"Title":"Mexican Bean and Rice Salad","Description":"Brown rice gets dressed up Mexican style, with kidney and black beans, corn, peppers, lime,…"},{"Title":"Tomato Enchilada Bake","Description":"All the essential enchilada ingredients are here: spiced chicken, tomato-rich sauce, sour…"},{"Title":"Chicken Taco Filling","Description":"Slow-cooked chicken breasts need only chicken broth and taco seasoning to make a mean…"},{"Title":"Conchas (Mexican Sweet Bread)","Description":"I got this recipe from my friends mom who owns a Mexican Bakery. When they made these one…"},{"Title":"Taco Bake II","Description":"The whole family will enjoy this taco casserole consisting of ground beef, tomatoes and sour…"},{"Title":"Taco Pizza","Description":"Pizza dough prepared in the bread machine is topped with refried beans, salsa, seasoned…"},{"Title":"Bob's Mexican Stuffed Chicken","Description":"My boyfriend made me the best stuffed chicken last evening. It was so good that I crowned…"},{"Title":"Green Chicken Enchilada","Description":"Very easy to make! Chicken and Monterey Jack Cheese filled flour tortillas topped with green…"},{"Title":"Black Beans, Corn, and Yellow Rice","Description":"Make a meal out of a package of yellow rice by adding black beans, corn, and lime juice."},{"Title":"Slow Cooker Chicken Mole","Description":"A unique blend of spices and cocoa powder turns into a rich and complex mole sauce after…"},{"Title":"Veracruz-Style Red Snapper","Description":"Red snapper is cooked with a Mexican-inspired mixture of tomatoes, jalapeno peppers,…"},{"Title":"Enchilada Casserole","Description":"The inclusion of tempeh adds a good measure of protein to this spicy enchilada casserole."},{"Title":"Salsa","Description":"This is a recipe I just throw together, but it is very popular. Serve with tortilla chips."},{"Title":"Mexican Style Cornbread","Description":"This buttermilk cornbread is thick with creamed corn, Cheddar cheese, fresh onion and…"},{"Title":"Mexican Beef Supreme","Description":"My boyfriend is from Mexico and he whipped this up one night and it turned out great. Beef,…"},{"Title":"Spinach and Mushroom Quesadillas","Description":"Flour tortillas filled with creamy Cheddar cheese, portabella mushrooms, and spinach.…"},{"Title":"Jen's Fresh and Spicy Salsa","Description":"This recipe is bursting with flavor! It is fresh and spicy, and did I mention easy? This is the…"},{"Title":"Monterey Chicken with Potatoes","Description":"This is a delicious dinner recipe developed by my mom. Roasted potatoes and chicken…"},{"Title":"Mexican Pizza I","Description":"Mexican Pizzas are delicious corn tortillas topped with beans, beef and all the delicious…"},{"Title":"Adobo Sirloin","Description":"Chipotle chiles, cumin, and lime juice give Mexican flavor to marinated and grilled steak.…"},{"Title":"Mexican Chicken Soup","Description":"Tired of plain old Chicken Soup? Try this spunky Mexican inspired masterpiece. Adding the…"},{"Title":"Tangy Chicken Fajitas","Description":"Lime, vinegar and Italian salad dressing mix offer an alternative to the usual…"},{"Title":"The Best Red Enchilada Sauce","Description":"This smoky and savory enchilada sauce is flavored with dried Ancho chiles, garlic,…"},{"Title":"Gary's Turkey Burritos","Description":"Easy to make, these special low-fat burritos taste awesome! You don't eat red meat, but…"},{"Title":"Mexican Rice I","Description":"Easy to prepare and the flavor of Mexico is in your kitchen!"},{"Title":"Taco Soup II","Description":"This is a really good and easy recipe. Top with shredded cheese, and serve with chips."},{"Title":"Mexican Bean Pie","Description":"Layers and more layers make this tortilla and bean casserole incredible. It includes three…"},{"Title":"Chili Potato Burritos","Description":"You can use any kind of chili pepper you like - I like poblano or chipotle the best. Buy them…"},{"Title":"Crab Ceviche","Description":"This has always been a crowd pleaser in my home. This is wonderful as an appetizer…"},{"Title":"White Chicken Enchilada Slow-Cooker Casserole","Description":"An easy, creamy chicken enchilada casserole. Slow cooking gently melds together the…"},{"Title":"Authentic Mexican Chili Rellenos","Description":"Slightly spicy Anaheim chiles are stuffed with Mexican cheese, rolled in flour and beaten…"},{"Title":"Quick Fish Tacos","Description":"Tilapia fillets are pan-fried in a jalapeno-infused oil and served with a quick cabbage slaw. For…"},{"Title":"Mexican Tinga","Description":"This is an authentic Mexican favorite! Shredded chicken and onions are simmered in a thick…"},{"Title":"Fantastic Mexican Dip","Description":"This recipe was given to me by my sister-in-law and always goes fast! Cream cheese at the…"},{"Title":"Beef Chimichangas","Description":"Simple, yummy beef and cheese chimichangas bake for only 15 minutes in a hot oven. Then…"},{"Title":"Albondigas Soup I","Description":"Rice and bite-sized meatballs made with pork and beef float in beef broth seasoned with…"},{"Title":"Mexican White Cheese Dip/Sauce","Description":"Creamy and spicy, this cheese and green chili queso can be used as a dip for tortilla chips or…"},{"Title":"Chicken Enchilada Casserole I","Description":"Cook chicken with cheese, chiles, tomatoes and canned soups, then layer with tortillas for an…"},{"Title":"Fish Tacos Ultimo","Description":"The spicy yogurt sauce is what makes this fish taco the ultimate. With chipotle peppers and…"},{"Title":"Mrs Espy's Enchilada Sauce","Description":"Tomato sauce, water, and seasonings are thickened with browned flour. Chicken or beef…"},{"Title":"Cilantro-Lime Rice","Description":"Very similar to the rice of a famous burrito place, this rice pairs well with Mexican food and can…"},{"Title":"Sweet Potato Enchiladas","Description":"Corn tortillas are stuffed with a sweet potato and cream cheese filling and baked with…"},{"Title":"Taco in a Bag","Description":"This flavorful taco treat is a perfect snack to enjoy while mobile. Picnics and block parties…"},{"Title":"Ground Beef with Homemade Taco Seasoning Mix","Description":"Taking just a little extra time to make this flavorful ground beef makes all the difference…"},{"Title":"Easy Chicken Fajita Marinade","Description":"Chicken breast strips are marinated in Mexican-inspired flavorings and grilled for a tasty and…"},{"Title":"Pork Stew in Green Salsa (Guisado de Puerco con Tomatillos)","Description":"Tender chunks of pork are seasoned, browned, and simmered with tomatillos, cilantro, and…"},{"Title":"Mayan Couscous","Description":"Toasted garlic, jalapeno peppers, and fresh lime juice liven up this Mexican version of couscous…"},{"Title":"Amazing Southwest Cilantro Lime Mango Grilled Chicken Sandwiches","Description":"This is a recipe I came up with while trying to figure out what to do with stuff I had on hand. …"},{"Title":"Kiki's Borracho (Drunken) Beans","Description":"Growing up, my Mexican grandmother always had a pot of beans cooking on the stove. This…"},{"Title":"Tomato, Corn and Avocado Salsa","Description":"Tomatoes, corn, and avocado come together in this colorful salsa recipe seasoned with lime…"},{"Title":"Carne Asada Tacos","Description":"You will love these easy and flavorful tacos! Strips of beef are marinated in lime and…"},{"Title":"Zesty Chicken Meatloaf","Description":"Ground chicken is spiced with taco seasoning mix and salsa for a zesty switch from the usual…"},{"Title":"Chiles Rellenos Pie","Description":"This easy delicious dish is perfect in the winter, and light enough for summer. Anyone who…"},{"Title":"Amy's Spicy Beans and Rice","Description":"Black, red or pinto beans are baked with jalapeno chile peppers and spices, and served…"},{"Title":"Throw Together Mexican Casserole","Description":"Ground beef, olives, egg noodles, corn, taco sauce and seasoning give this throw together…"},{"Title":"Enchiladas Verdes","Description":"Using a roasted chicken from the grocery saves time in this enchilada recipe with a spicy…"},{"Title":"Ex-Girlfriend's Mom's Salsa Fresca (Pico de Gallo)","Description":"Tomatoes, red onion, jalapeno pepper, cilantro, and lime juice combine in this fresh-tasting…"},{"Title":"Roasted Tomato Salsa I","Description":"This chunky, smoky salsa tastes amazing with tortilla chips. Roasted tomatoes, garlic, onion…"},{"Title":"Black Bean Salsa","Description":"This thick, flavorful salsa will please everyone with it's exciting array of flavors and textures."},{"Title":"Chicken Enchilada Soup II","Description":"This hearty soup won't leave you hungry! Chicken broth hosts enchilada sauce,…"},{"Title":"Avocado Tacos","Description":"Lightly seasoned avocados and diced onions are spread on toasted tortillas and served with…"},{"Title":"Shrimp Burritos","Description":"I worked at a Mexican restaurant that specializes in Baja dishes, and became addicted to this…"},{"Title":"Enchanted Sour Cream Chicken Enchiladas","Description":"Sour cream and chicken fill these quick and easy enchiladas."},{"Title":"Chile Rellenos","Description":"Delicious green chiles stuffed with cheese, dipped in a special batter and fried in canola oil."},{"Title":"Over the Top Nachos","Description":"Ground beef is the key to these hearty classic nachos--it's generously spread over the chips…"},{"Title":"Easy Chicken Posole","Description":"This easy-to-make chicken and hominy soup is one of many great Mexican Christmas…"},{"Title":"Chicken Fajita Marinade","Description":"This easy to make marinade will give your chicken just the flavor you're looking for next…"},{"Title":"Chicken Kabobs Mexicana","Description":"Chicken and veggie skewers marinated in cilantro, lime, and cumin. Serve with rice,…"},{"Title":"Chicken Tortilla Soup IV","Description":"Freshly fried strips of corn tortilla garnish this chicken, black bean and corn soup seasoned…"},{"Title":"Aztec Casserole","Description":"You will need a siesta after eating this layered enchilada casserole featuring chicken with…"},{"Title":"Turkey Enchiladas","Description":"Use canned enchilada sauce to reduce the preparation time in these turkey filled corn…"},{"Title":"Green Chile Frittata","Description":"This rich recipe is great for either a brunch or breakfast. You can make this a day ahead if…"},{"Title":"Slow Cooker Guisado Verde","Description":"An easy tomatillo and pork stew that is my boyfriend's favorite. Make it as spicy as you…"},{"Title":"Beef Tamales","Description":"These are just like the tamales my Abuelita used to make for special occasions. This recipe…"},{"Title":"Taco Seasoning II","Description":"A mixture of spices and a little cornstarch for thickening, that closely resembles The…"},{"Title":"Healthier Slow-Cooker Chicken Tortilla Soup","Description":"This quick and easy chicken tortilla soup is made even healthier than the original by…"},{"Title":"Enchilada Casserole II","Description":"This flavorful casserole, layered with a seasoned ground beef and tomato mixture, flour…"},{"Title":"Spicy Fish Soup","Description":"Baby shrimp and cod fillets are cooked in chicken broth with green bell peppers,…"},{"Title":"Quesadillas II","Description":"Fabulous recipe for all you Mexican food lovers. It is quick and easy! Serve with salsa and sour…"},{"Title":"Mexican Cucumber Salad","Description":"Cool summer vegetables and warm spices make for a colorful, zesty salad!"},{"Title":"Corn Dip II","Description":"This is a recipe my mother found a few years ago. Corn, cheese, and a little Mexican spice…"},{"Title":"Potato and Bean Enchiladas","Description":"Vegetarian potato and pinto bean enchiladas smothered in tomatillo salsa and queso…"},{"Title":"Cool Cucumber Salsa","Description":"A great way to use all those cucumbers you get from your plants! A little zing from the…"},{"Title":"Beefy Spanish Rice","Description":"Dinner in one pot! Ground beef and rice are briefly sauteed with onion and bell pepper,…"},{"Title":"Sour Cream Enchiladas","Description":"Sour cream and cream of chicken soup make a tasty sauce for these cheesy chicken enchiladas."},{"Title":"Ranch Bean Dip","Description":"Packaged ranch-dressing mix discreetly perks up this bean and cheese puree."},{"Title":"Corn Tortillas","Description":"This is the real thing! A simple mixture of masa harina and water results in the most…"},{"Title":"Kris' Amazing Shredded Mexican Beef","Description":"My husband grew up in southern California, and he says this shredded Mexican beef is the best…"},{"Title":"Cinnamon and Lime Chicken Fajitas","Description":"Potatoes and chicken breast meat flavored with warm and lively seasonings are the fixings for…"},{"Title":"Chicken Tinga Tostados","Description":"This authentic Mexican recipe I picked up while living in Mexico. It has a spicy, smoky flavor…"},{"Title":"Beef Enchiladas I","Description":"Baked corn tortillas filled with sauteed beef, onion and chile peppers, topped with tomato…"},{"Title":"Real Chiles Rellenos","Description":"Chiles rellenos, that classic Mexican dish of cheese-stuffed fried peppers, is made from…"},{"Title":"Easy Never Forgotten Guacamole","Description":"This guacamole has been a hit at our house for years. Great for the Superbowl or any…"},{"Title":"Busy Night Turkey Taco Soup with Avocado Cream","Description":"Leftover cooked turkey is combined with salsa, corn, beans and cilantro in this quick soup…"},{"Title":"Chile Relleno Casserole","Description":"This is a Mexican-style casserole made with hamburger and green chile peppers. It…"},{"Title":"Soft Mahi Mahi Tacos with Ginger-Lime Dressing","Description":"A warm, flavorful dish filled with mahi-mahi, fresh fruit and an exotic ginger-lime dressing.…"},{"Title":"Colorful Vegetable Fajitas","Description":"Eat your veggies! No problem doing that with these fabulous fajitas. Summer squash, red…"},{"Title":"Black Bean Avocado Salsa","Description":"Black beans, avocado, corn, and roma tomatoes make the base of this salsa with a healthy…"},{"Title":"Cheater's Enchiladas","Description":"This is what we call fast and delicious cooking. Tortillas are layered with sour cream, cheese…"},{"Title":"Deep Fried Jalapeno Slices","Description":"These are addictively delicious. Spicy and sinful. Best if served with melted nacho cheese sauce."},{"Title":"Quick Brownbag Burritos","Description":"These are quick enough to whip up anytime and are even good cold, which makes them great…"},{"Title":"Mexican Quinoa","Description":"Use quinoa instead of rice to make a flavorful, spicy Mexican-style side dish that's light and…"},{"Title":"Easy Taco Casserole","Description":"Ground beef mixed with salsa and onion is layered into a casserole with crushed tortilla…"},{"Title":"Absolutely the Best Nacho Dip Ever","Description":"This attractive layered dip for tortilla chips is filled with fresh ingredients. The addition of…"},{"Title":"Green Chili Stew","Description":"Beef, potatoes, tomatoes and onion seasoned with cumin, garlic salt, and green chiles."},{"Title":"Quick and Easy Shrimp Fajitas","Description":"This is a twist on a classic recipe using shrimp instead of beef or chicken. I use regular old…"},{"Title":"Mexican Pork Chops","Description":"Tender pork chops are cooked up Mexican-style with tomatoes, corn, beans, and rice."},{"Title":"Southwestern Turkey Casserole","Description":"Use turkey leftovers to make this casserole baked with sour cream, green chilies, corn…"},{"Title":"Salsa De Tomatillo","Description":"This is the 'salsa de tomatillo' that I grew up with. It can be used as a sauce for grilled…"},{"Title":"Authentic Mexican Shrimp Cocktail (Coctel de Camarones estilo Mexicano)","Description":"A refreshing and authentic Mexican shrimp cocktail with plenty of spicy flavors makes a…"},{"Title":"Spicy Avocado Chicken","Description":"A simple sauce of onion, avocado, and lime juice is served over pan-fried chicken breasts for a…"},{"Title":"Lime Cilantro Cauliflower \"Rice\"","Description":"Grated cauliflower stands in for rice in this flavorful, grain-free side dish."},{"Title":"Tomatillo Soup","Description":"This is a Mexican-style chicken soup with tomatillos and chicken breast meat cooked in…"},{"Title":"Super Fajita Marinade","Description":"This is best when prepared a day ahead. Makes zesty flavorful fajitas every time. Great for beef…"},{"Title":"Cilantro Tomato Corn Salad","Description":"Very quick and tasty sidedish that can be altered to taste, almost every ingredient except the…"},{"Title":"Easy White Chicken Enchiladas","Description":"These white chicken enchiladas are a cinch to make with ingredients right off the shelf. The…"},{"Title":"Mexican Turkey Burgers","Description":"Inspired by Mexican tortillas, American burgers, and delicious breadcrumb coatings, I created…"},{"Title":"Healthy Mexican Chicken Bake","Description":"Chicken breasts are pan-fried and baked with salsa and cheese for a quick and healthier…"},{"Title":"Easy Chicken Taquitos","Description":"Corn tortillas are tightly rolled around a cheesy chicken mixture and baked until crisp. Serve…"},{"Title":"Ranch Chicken Tacos","Description":"Turn leftover rotisserie chicken into kid-friendly ranch chicken tacos. Corn tortillas are filled…"},{"Title":"Pork and Green Chile Casserole","Description":"Boneless pork chops are cubed and combined with black beans, diced tomatoes, green…"},{"Title":"Double Chili Cheese Dip","Description":"This is an easy appetizer that you can make at the last minute. I never have any leftovers.…"},{"Title":"Picante Chicken Rice Burritos","Description":"Flour tortillas filled with a mildly spicy, cheesy, picante chicken and rice mixture, then topped…"},{"Title":"Chiliquilla","Description":"This easy Mexican-inspired dish is simple to make and it has a beautiful in-the-pan…"},{"Title":"Easy Creamy Chicken Enchiladas","Description":"This enchilada dish is sure to be a new family favorite; it is simple to put together and also…"},{"Title":"Traditional Mexican Guacamole","Description":"This guacamole uses the traditional ingredients of avocado, lemon juice, cilantro, and onion.…"},{"Title":"Chiles Rellenos (Stuffed Peppers)","Description":"This is a great traditional Mexican dish. It takes a little bit of time, but it is worth every minute!…"},{"Title":"Pineapple Enchiladas","Description":"Flour tortillas are filled with pineapple, sour cream and Cheddar cheese, then smothered…"},{"Title":"Frijoles a la Charra","Description":"This is a really tasty pinto beans recipe made in the slow cooker. This recipe is great to serve…"},{"Title":"South Texas Carne Guisada","Description":"In this recipe, chunks of lean beef are simmered with fresh tomatoes, bell pepper, onion,…"},{"Title":"Flan Mexicano (Mexican Flan)","Description":"A creamy, rich, orange-scented custard displays a golden syrupy topping of caramelized sugar…"},{"Title":"Ken's Kickin' Posole","Description":"Pork and hominy simmer with roasted chiles and onions in a velvety red sauce in this…"},{"Title":"Pinto Beans With Mexican-Style Seasonings","Description":"Hearty, flavorful pinto beans cooked with Mexican-style seasonings make a great side…"},{"Title":"Taco Pies","Description":"Prepared pie crusts are baked briefly and packed with refried beans, browned ground…"},{"Title":"Mexican Cornbread Salad","Description":"This layered salad is made with green chile cornbread, pinto beans, peppers, corn, bacon…"},{"Title":"Anaheim Fish Tacos","Description":"Delicious halibut is cooked with an array of spicy flavors to make the perfect filling for tacos!"},{"Title":"Tex-Mex Beef and Cheese Enchiladas","Description":"Cheese filled tortillas are covered with a spicy meat sauce and cheese before baking.…"},{"Title":"Carne Guisada II","Description":"A Mexican beef stew smothered in a semi-spicy gravy. Simple to make, but tastes wonderful. …"},{"Title":"Flan II","Description":"Caramelized sugar, milk and eggs -- a sweet and simple baked custard."},{"Title":"Mexican Rice","Description":"Ground beef, rice, onion, green pepper and fresh corn are simmered in a spicy tomato and beef…"},{"Title":"Guacamole Cilantro Lime Cheeseburger","Description":"Melted Monterey Jack cheese lends an added zing to these spiced up hamburgers. A dollop…"},{"Title":"Linnie's Spanish Rice","Description":"The best and easiest Spanish rice!"},{"Title":"Mexican Bean Burgers","Description":"These burgers can be baked, grilled, or fried. Great served on a bun with avocado, lettuce,…"},{"Title":"Southwestern Black Bean Stew","Description":"Browned ground beef seasoned with a package of taco seasoning mix is combined with whole…"},{"Title":"Spicy Southwestern Slaw","Description":"This is a spicy, flavorful coleslaw speckled with diced jalapenos, red bell pepper and cilantro."},{"Title":"Cheesy Onion Roll-Ups","Description":"These attractive rolled tortilla bites always go over great at parties! A cheese, sour cream…"},{"Title":"Vegetarian Black Bean Enchiladas","Description":"Flour tortillas are filled with creamy vegetarian refried black beans and baked with a…"},{"Title":"Beef Enchiladas with Spicy Red Sauce","Description":"Ground beef enchiladas in flour tortillas topped with spicy red sauce, cheese and fresh…"},{"Title":"Vegan Fajitas","Description":"Zucchini, yellow squash, bell peppers and onion are marinated and then sauteed. Serve with…"},{"Title":"Spanish Rice","Description":"Very easy, very good Spanish rice!"},{"Title":"Mijo's Slow Cooker Shredded Beef","Description":"Chuck roast, piquant seasonings, liquid smoke, and beer or cola are combined in a slow…"},{"Title":"Poblano Chicken Enchilada Casserole","Description":"I've begun making my enchiladas casserole style, which saves a lot time, not to mention…"},{"Title":"Rich Mexican Corn","Description":"This recipe came from my step-mom in Dallas, Texas. They like it hot so they put in a few…"},{"Title":"Authentic Huevos Rancheros","Description":"This is an easy to make tostada-type breakfast that will definitely satisfy your hunger until…"},{"Title":"Bean Burrito Casserole","Description":"I usually keep frozen burritos stocked in my freezer just for this recipe. It's so quick and…"},{"Title":"Vegetarian Refried Beans","Description":"This is a traditional vegetarian refried bean recipe that tastes great with hardly any fat! …"},{"Title":"Double Crust Bean Pie","Description":"Black beans, cheese, bell peppers, onion and spices baked between 2 pie crusts."},{"Title":"Barbacoa-Style Shredded Beef","Description":"In this Chipotle(R) copycat recipe, beef is slow-cooked barbacoa-style - with garlic, lime, and…"},{"Title":"Creamy Chicken Enchiladas Verde","Description":"Enjoy the dining out experience at home with this restaurant-inspired recipe."},{"Title":"Simple Mexican Rice","Description":"A very simple tomato Mexican rice recipe. I can have this in the oven and cooking in one set of…"},{"Title":"Shrimp Tacos","Description":"I got the idea for these shrimp tacos from a favorite restaurant. The shrimp is sauteed in…"},{"Title":"Becca's Taco Soup","Description":"Taco ingredients such as browned ground beef, onion, corn, kidney beans and a package of…"},{"Title":"Pan de Muertos (Mexican Bread of the Dead)","Description":"This sweet yeast bread, or pan dulce, is baked for the November 2 celebration known as the…"},{"Title":"Southwestern Chicken Lasagna","Description":"Spaghetti sauce in the mix gives a nod to the Italian origins of this layered casserole, in…"},{"Title":"Taco Dip","Description":"We love refried beans and this dip has lots. Said beans are spread into a pan, then slathered…"},{"Title":"Black Bean and Rice Enchiladas","Description":"These vegetarian black bean and rice enchiladas are just as satisfying as those served in…"},{"Title":"Karen's Slow Cooker Chicken Fajitas","Description":"Getting delicious chicken fajitas on the table is a breeze using a slow cooker; and clean up…"},{"Title":"Spicy Shredded Beef","Description":"Browned, cubed beef is simmered with diced tomatoes, cumin, and garlic, then shredded.…"},{"Title":"White Cheese Sauce","Description":"This is an awesome Monterey Jack sauce that goes great over chicken enchiladas, or used as…"},{"Title":"Mexican Salad","Description":"The dressing of olive oil, lime juice and honey is a nice addition to this traditional…"},{"Title":"Salsa Cube Steaks","Description":"These steaks are baked for 30 to 40 minutes in salsa along with green pepper and onions,…"},{"Title":"Taco Salad II","Description":"Envision a thick taco brimming with chopped tomatoes, ground beef, lettuce, and lots of…"},{"Title":"Chili Relleno Casserole","Description":"Canned green chiles and lots of shredded cheese bake up into a meltingly good, easy…"},{"Title":"Cilantro Chicken and Rice","Description":"Chicken, beans, corn, and rice are cooked together in a tomato-based sauce flavored…"},{"Title":"Vegetarian Burrito Casserole","Description":"Soy burger-style crumbles, tomatoes, rice, vegetarian refried beans, cheese, and taco…"},{"Title":"Corn Tortilla Chips","Description":"Here's a simple recipe for making corn tortilla chips spiced only with salt. The chips may…"},{"Title":"Migas II","Description":"This was my husband's favorite breakfast growing up in a Mexican household. Now we…"},{"Title":"Roasted Tomatillo and Garlic Salsa","Description":"Tomatillos, lots of garlic and spicy jalapenos charred under the broiler give this salsa a rich,…"},{"Title":"Fideo (Mexican Spaghetti)","Description":"A very unusual but very delicious pasta dish. My Mexican grandfather used to make it and I…"},{"Title":"Super Nachos","Description":"These are definitely super nachos with a layering of ground beef, refried beans,…"},{"Title":"Breakfast Burritos","Description":"A different way to start your day. Burritos with fried eggs, bacon and refried beans topped…"},{"Title":"Tex Mex Black Bean Dip","Description":"Traditionally Southwestern flavors like cumin and cilantro lend a distinctive note to this…"},{"Title":"Monterey Jack Salsa","Description":"A totally unique salsa that's great with tortilla chips, and keeps for several days. This salsa…"},{"Title":"Chili Casserole","Description":"Red taco sauce is used in this casserole of browned ground beef combined with celery,…"},{"Title":"Chili Cheese Dip III","Description":"This quick, easy chili cheese dip is a little different from most, and is sure to be a favorite!"},{"Title":"Taco Soup III","Description":"Browned ground beef is combined with packets of ranch dressing mix and taco seasoning in…"},{"Title":"Taco Rice","Description":"This tasty rice great addition to tacos either on the inside or out. My fiance raves over this…"},{"Title":"Chile Colorado","Description":"I like to make this chile for my Mexican husband, who also doesn't like tomatoes in his chile. …"},{"Title":"Chilaquiles II","Description":"Fried tortilla chips are cooked with eggs, salsa, and cheese. Don't wait to try this Mexican…"},{"Title":"Garden Tomato Salsa","Description":"A fresh, easy way to use up your garden tomatoes. Mix and match different varieties of…"},{"Title":"Corn Dip","Description":"This is a cool, refreshing dip that can be served anytime. Serve with chips, crackers or sliced…"},{"Title":"Shrimp Salsa","Description":"Salad shrimp, tomatoes, onion, cilantro, and lime juice combine for an tasty version of…"},{"Title":"Shrimp Quesadillas","Description":"These spicy quesadillas are filled with shrimp, onions, bell peppers, and melted Mexican…"},{"Title":"Jalapeno Hot Sauce","Description":"Jalapenos, garlic and onion sauteed and pureed into fresh homemade hot sauce."},{"Title":"Easy Enchilada Casserole","Description":"No stuffing or rolling necessary to make these enchiladas. Just mix together shredded…"},{"Title":"Ground Turkey Taco Meat","Description":"Ground turkey is seasoned with chili powder, cumin, paprika, and cayenne in this easy…"},{"Title":"Spicy Lime-Cilantro Marinated Flank Steak","Description":"Flank steak is grilled after having spent the night in a fresh and spicy marinade. The marinade…"},{"Title":"1-Dish Taco Bake","Description":"Here's a one-dish family pleaser with all your favorite Mexican ingredients--salsa, cheese,…"},{"Title":"Cheese Enchiladas","Description":"These enchiladas are filled with Cheddar cheese, onion, olives and mushrooms. Use…"},{"Title":"Southwest Chicken Bake","Description":"Flavorful and juicy chicken pieces bake with layers of salsa, black beans, and brown rice…"},{"Title":"Chicken Enchiladas IV","Description":"Chicken, sour cream, cheese and green onions spiced with cumin and flavored with fresh…"},{"Title":"Carrot Chile and Cilantro Soup","Description":"This delicious soup combines carrots and potatoes with garlic, cilantro and chile paste…"},{"Title":"Acapulco Margarita Grouper","Description":"Sea bass or any firm-fleshed fish may be used if grouper is not available. The grilled fish and…"},{"Title":"Chicken Taquitos","Description":"Smoked cheese and green salsa give these crispy chicken taquitos that extra yum!"},{"Title":"Spicy Corn Dip","Description":"A can of Mexican-style corn adds texture, taste and color to this standard Southwestern dip."},{"Title":"Pressure Cooker Carnitas","Description":"Cubes of pork shoulder meat are browned, then cooked in a pressure cooker with poblano,…"},{"Title":"Sweet Pork for Burritos","Description":"This rich, sweet, and tangy pork recipe cooks up easily in the slow cooker. Serve it with rice…"},{"Title":"Double Decker Tacos","Description":"Like the ones you get at that famous taco place, only homemade. A soft flour tortilla, spread…"},{"Title":"Mexican Mole Sauce","Description":"Whip up this quick mole sauce with ingredients you have in the cupboard. Serve it over…"},{"Title":"Picante Chicken","Description":"Just simmer chicken breasts in your favorite salsa for an easy, zesty entree."},{"Title":"Carne Adovada","Description":"This is a wonderful, melt in your mouth recipe for Carne Adovada. My family absolutely loves…"},{"Title":"Fat Free Refried Beans","Description":"Need to make a quick meal or snack? Refried black beans are easy and delicious!"},{"Title":"Texas Coleslaw","Description":"Coleslaw with Southwestern twist! Tangy with lime juice, cayenne and cumin, and bursting…"},{"Title":"Pressure Cooker Chili","Description":"Chili cooked in a pressure cooker is fast, and the spices and unsweetened cocoa give it a rich…"},{"Title":"Easy and Delicious Mexican Pork Chops","Description":"Pork chops bake up tender in a bed of Mexican-style rice for a dinner you can fix anytime with…"},{"Title":"Drip Beef Sandwiches","Description":"This recipe makes tender, wonderfully flavored meat that is great for sandwiches. I also like to…"},{"Title":"Chicken Enchilada Soup I","Description":"This enchiladas-inspired soup is made with corn tortilla-thickened chicken broth, cans of red…"},{"Title":"Salsa Cheese Boule Dip","Description":"Cheddar, sour cream and cream cheese melt to a luscious dipping consistency in this spicy,…"},{"Title":"Santa Fe Rice Salad","Description":"This flavorful salad is composed of black beans, rice, fresh tomatoes, Cheddar cheese and…"},{"Title":"Paella","Description":"A traditional spiced dish made in a wok. The sausage, chicken and shrimp blend nicely…"},{"Title":"Colorado Green Chili (Chile Verde)","Description":"Tender chunks of pork are stewed together with roasted green chiles in this classic stew."},{"Title":"'Calabacitas Guisada' (Stewed Mexican Zucchini)","Description":"This classic comfort food consists of Mexican zucchini rounds simmered in stewed…"},{"Title":"Sopa De Lima (Mexican Lime Soup)","Description":"This light and refreshing lime-accented chicken tortilla soup can be hot or mild, depending on…"},{"Title":"Texas Enchilada Sauce","Description":"Crushed tomatoes, tomato sauce, onion, garlic, bell pepper and spices make this authentic…"},{"Title":"Black Bean Lasagna","Description":"A delicious vegetarian lasagna using corn tortillas instead of lasagna noodles, layered…"},{"Title":"Spicy South of the Border Spinach Cheese Dip","Description":"Good 'n' spicy. Not your typical spinach dip recipe. No artichokes, here! Serve this tasty…"},{"Title":"Calabacitas con Elote (Zucchini with Corn)","Description":"This mixture of zucchini, corn, tomatoes, and poblano pepper can be served as a side dish…"},{"Title":"Easy Authentic Mexican Rice","Description":"This Mexican rice is cooked with onion powder, garlic powder, and tomato sauce for an easy…"},{"Title":"Latin-Inspired Spicy Cream Chicken Stew","Description":"Boneless chicken breasts simmer for hours in the slow cooker with green salsa, tomatoes,…"},{"Title":"Mexican Lasagna I","Description":"Mexican seasonings and refried beans are added to this lasagna. You don't even have to…"},{"Title":"Ceviche","Description":"This recipe is a staple in Mexico. Raw seafood is cooked by the lime juice! Now don't wrinkle…"},{"Title":"Tres Leches III","Description":"A light sponge cake soaked with a mixture of three kinds of milk. This is the BEST Tres…"},{"Title":"Corn and Avocado Salsa","Description":"Avocados and fresh corn from the cob cohabitate with red pepper flakes, red wine,…"},{"Title":"Venison Fajitas","Description":"A homemade fajita seasoning nicely compliments the venison in these fajitas."},{"Title":"Bananas Foster Chimichangas","Description":"These fried, sweet burrito-like bundles are stuffed with a tried-and-true mixture of…"},{"Title":"Zucchilattas","Description":"Zucchini enchiladas are great way to enjoy fresh garden vegetables."},{"Title":"My Favorite Mexican Rice","Description":"This one-skillet side dish is wonderfully spicy and cheesy. Serve it with your favorite…"},{"Title":"Carne en su Jugo (Meat in its Juices)","Description":"Small pieces of flank steak are simmered with a tomatillo sauce and mixed with pinto beans…"},{"Title":"Famous Taco Seasoning Mix","Description":"Avoid the pre-packaged taco seasoning mix by combining some spices from your pantry."},{"Title":"Slow Cooker Chicken Tinga","Description":"Chicken and chorizo sausage are simmered in the slow cooker with plenty of spices and hot…"},{"Title":"Real Texas Chili","Description":"Cubes of chuck roast are cooked in beef broth seasoned with garlic, cumin, chili powder and…"},{"Title":"Black Bean and Artichoke Burritos","Description":"Sauteed sliced artichoke hearts provide a new twist on an old favorite. Cooked black beans…"},{"Title":"Javi's Really Real Mexican Ceviche","Description":"This recipe is one of my family's favorites. It can be served as a meal or as an appetizer, as it is…"},{"Title":"Southwestern Haystacks","Description":"Browned ground beef is combined with whole-kernel corn, tomatoes, kidney beans, and…"},{"Title":"Homemade Chicken Enchiladas","Description":"These cheesy chicken enchiladas are great for the whole family."},{"Title":"Sarah's Easy Shredded Chicken Taco Filling","Description":"Chicken breast meat simmers with just a couple of seasonings in tomato sauce for a…"},{"Title":"Easy Spicy Mexican-American Chicken","Description":"Some like it hot, and if that's you, try this simple Mexican-inspired recipe for baked chicken…"},{"Title":"Green Chili and Cheese Chicken","Description":"This is a super-easy weeknight recipe with Mexican flair. Server with Spanish rice, refried…"},{"Title":"Asparagus and Goat Cheese Quesadillas","Description":"Easy and elegant quesadillas made with fresh asparagus and soft goat cheese. A royal…"},{"Title":"Peanut Butter Quesadillas","Description":"What could be more simple than spreading peanut butter on a tortilla and heating it in…"},{"Title":"Chorizo Breakfast Burritos","Description":"A yummy breakfast burrito of cooked, crumbled chorizo sausage with onions and scrambled…"},{"Title":"Roast Beef Burritos","Description":"Sliced deli beef or cooked leftover roast beef mixed with onions, garlic, tomatoes, green…"},{"Title":"Zeke's Tortilla Soup","Description":"An authentic, savory soup from the Mexican food capital of the world - El Paso Texas! You…"},{"Title":"Southwestern Bake","Description":"This southwestern dish is great for parties or if you have a large family. Ground beef, black…"},{"Title":"Flank Steak with Avocado Salsa","Description":"A spicy chili-flavored rub is used to add depth and complexity to grilled flank steak. Top with…"},{"Title":"Pastel de Tres Leches (Three Milk Cake)","Description":"A sponge cake is soaked in a mixture of three kinds of milk and topped with whipped cream…"},{"Title":"Cinco de Chili Chocolate Cupcakes with Chili Cream Cheese Frosting","Description":"First made for a chili cookoff, these dark chocolate cupcakes have the zing and deep,…"},{"Title":"Queso Dip","Description":"Otherwise known as cheese dip, this is a great recipe for any get together. Cheddar cheese is…"},{"Title":"Margarita Chicken II","Description":"Lime zest, lime juice, gold tequila and honey flavor the sauce for this dish. This is similar to…"},{"Title":"Tres Leches 'Three Milks'","Description":"It is a delicious cake with a special syrup on it, and a meringue frosting. This cake requires…"},{"Title":"Chicken Chilaquiles","Description":"This easy casserole is made with fresh chorizo, tortilla chips, chicken breast, and corn, then…"},{"Title":"Slow Cooker Beef Barbacoa","Description":"This Mexican-style shredded beef is cooked in the slow cooker until very tender, then cooked…"},{"Title":"Homemade Enchilada Sauce","Description":"Make your enchilada sauce at home with canned tomato sauce seasoned with cumin,…"},{"Title":"Tacos De Matamoros","Description":"A staple dish in Matamoros, Mexico, this simple recipe starts with ground beef mixed with…"},{"Title":"Vegan Mexican Stew","Description":"This vegan stew is absolutely excellent. A spicy hearty dish that is sure to make everyone…"},{"Title":"Pancho Villa Baked Tilapia","Description":"Each fillet is individually seasoned with lime and fresh cilantro, and then wrapped in foil…"},{"Title":"Grilled Chicken Quesadillas","Description":"This recipe is a delicious snap. The meat is coated with adobo seasoning, grilled, and cut…"},{"Title":"Caldo De Res (Beef Soup)","Description":"This is a traditional Mexican beef and vegetable soup seasoned with cumin, cilantro and lime."},{"Title":"Chicken Encilantrada","Description":"A sprightly sauce of cilantro and tomatillos (similar to green tomatoes) graces this simple…"},{"Title":"Quick and Easy Taco Dip","Description":"This is a quick and easy taco dip that everyone is sure to love!! Better make a double batch,…"},{"Title":"Tex-Mex Pork","Description":"Spicy shredded pork loin with onion and green chili peppers, seasoned Mexican style."},{"Title":"Summer Vegetarian Chili","Description":"Throw summer's fresh vegetables into a pot and stew them up for an antioxidant-packed,…"},{"Title":"Chiliville Chili","Description":"Steaming, succulent and savory. A robust and hearty classic that never goes out of style."},{"Title":"Black Bean Cigars","Description":"I created this one night out of whatever I had on hand that I thought might taste good…"},{"Title":"Quick and Easy 20-Minute Chicken Posole","Description":"Strips of chicken breast are simmered in chicken broth with green chiles, hominy and black…"},{"Title":"Mexican Chocolate Cake","Description":"This is a moist chocolate cake with a hint of cinnamon. This recipe will make a large one…"},{"Title":"Spicy Mexican Salad","Description":"This salad couldn't be easier to make; everything - lettuce, tomatoes, cheese, and…"},{"Title":"Taco Soup I","Description":"Browned ground beef or turkey is combined with kidney beans, tomatoes, avocado and…"},{"Title":"Sopapillas","Description":"This is a flat bread that is easy to prepare, and is usually served with something sweet to put…"},{"Title":"Poor Man's Caviar","Description":"A colorful, light, and delicious concoction to serve with tortilla chips or pita bread.…"},{"Title":"Best Football Dip Ever","Description":"This dip is made for 3 to 6 men, sitting together on a Sunday, enjoying football and eating…"},{"Title":"Black Bean Huevos Rancheros","Description":"Layered with black beans along with fresh salsa and shredded Monterey Jack cheese, this is a…"},{"Title":"Easy Slow Cooker Carne Guisada","Description":"Carne guisada is a hearty Mexican-style beef stew. It is excellent with tortillas or cornbread,…"},{"Title":"Albondigas Soup II","Description":"In this version of the spicy Mexican soup, beef meatballs are cooked in a broth with carrots,…"},{"Title":"Tortilla and Bean Soup","Description":"Boneless, skinless chicken meat is combined with pinto, black, kidney and ranch-style…"},{"Title":"Buffalo Chicken and Ranch Wraps","Description":"Boneless skinless chicken breasts, cut into bite size pieces, cooked and covered in Buffalo…"},{"Title":"Grilled Shrimp Tacos","Description":"Hot, grilled shrimp are dressed with a sauce made from Taco Ranch Dressing, and served…"},{"Title":"Buffy's Refried Beans","Description":"These smooth and creamy beans make a tasty side for any Mexican dish."},{"Title":"Pork Carnitas with Cilantro Tomatillo Sauce","Description":"Slow cooking blends the flavors."},{"Title":"Spicy Chicken Enchiladas","Description":"Enchiladas filled with ground chicken and assorted additions. Bake topped with sauce…"},{"Title":"Green Sauce Enchiladas","Description":"A little extra attention to the rice results in a particularly well-flavored enchilada with…"},{"Title":"Margarita Cake with Key Lime Cream Cheese Frosting","Description":"A yummy cake with a margarita flavor and cream cheese frosting, this is fun for Cinco de…"},{"Title":"Mexican Cookie Rings","Description":"This cookie is sure to win compliments and they don't take hours to make."},{"Title":"Carne Asada Marinade","Description":"This simple garlic and olive oil rub is a great way to marinate beef steaks before grilling."},{"Title":"Cilantro Serrano Cream Sauce","Description":"This quick sauce is great for chicken tacos and fish tacos. It's also great as a dip!"},{"Title":"Chipotle Shrimp","Description":"This is a quick and easy dish of shrimp sauteed in a spicy sauce of butter, garlic,…"},{"Title":"Mexican Egg Rolls","Description":"These are easy and delicious! Use them as an appetizer, or as a main dish. As an appetizer,…"},{"Title":"Avocado Stuffed Yams","Description":"This is a simple and filling recipe. The cool and spicy avocado topping is a pleasant contrast…"},{"Title":"Carnitas Filling","Description":"Pork shoulder is simmered with Mexican spices to make this shredded filling for tacos,…"},{"Title":"Carol's King Ranch Casserole","Description":"Layers of boiled chicken, a creamy soup mixture with red bell pepper, diced tomatoes and…"},{"Title":"Impossible Cake","Description":"Mexican caramel sauce, chocolate cake, and creamy flan bake in layers in this beautiful…"},{"Title":"Cyndi's Shrimp Fajitas","Description":"Marinated shrimp, vegetables, and cheese enclosed in flour tortillas. I love making these…"},{"Title":"Mashed Potato Quesadilla","Description":"I had something like this at a restaurant last night and I had to try to duplicate it at home!…"},{"Title":"Chicken Enchiladas Suizas","Description":"'Suizas,' Spanish for Swiss, refers to the creamy white sauce that tops these chicken and green…"},{"Title":"Chicken with Tomatillos and Poblanos","Description":"A spicy chicken dish with a tomatillo sauce, best served over rice and accompanied with beans…"},{"Title":"Spicy Mexican Torte","Description":"This is a great recipe my husband loves to make - it's a whole meal in it self and very simple to…"},{"Title":"Armadillo Eggs","Description":"Cheese-stuffed jalapeno peppers are stuffed inside cheesy, spicy biscuits!"},{"Title":"Quesadilla Jalapeno Spread","Description":"A creamy blend of mayonnaise and jalapeno seasoned with cumin, cayenne pepper,…"},{"Title":"Taco Bell(R) Seasoning Copycat","Description":"Make your tacos like your favorite Mexican chain restaurant does with this copycat taco…"},{"Title":"G-ma's Rice","Description":"This is the recipe for my grandma's rice. Being Hispanic, this is about as Mexican as you can…"},{"Title":"Across the Border Tequila Shrimp","Description":"I used to visit my friend Teresa in Brownsville, TX. We would cross the border to this open air…"},{"Title":"Green Chili Chicken Burgers","Description":"Guacamole and salsa give a Southwestern flair to flavorful grilled chicken burgers."},{"Title":"One - Two - Three - Mexican Macaroni Salad","Description":"Ole! Make it mild or make it zesty, you can have it your way. Always a hit and easy as can be."},{"Title":"Jalapeno Popper Quesadillas","Description":"Jalapeno poppers in quesadilla-form are easy to make and don't involve frying in oil. Slice into…"},{"Title":"Spicy Black Bean Salad","Description":"Black beans, corn, salsa, cilantro, and lime juice are combined to make a spicy and refreshing…"},{"Title":"Chicken and Red Bean Enchiladas","Description":"With rotisserie, whole roasted chickens so readily available from carryout shops to…"},{"Title":"Tuna Lime Tostadas","Description":"This refreshing recipe is great for a hot summer day! White albacore tuna, onion, and corn are…"},{"Title":"Pork Chile Rojo (Pulled Pork with Red Chile Sauce)","Description":"The pork shoulder roast, sometimes labeled as Boston butt, is a rich and flavorful cut that…"},{"Title":"Mexican White Sauce","Description":"This is the white sauce that you find in Mexican restaurants. Serve with tortilla chips."},{"Title":"Quick and Easy Fish Tacos","Description":"Soft, warm corn tortillas are filled with crisp fish sticks and cabbage, and topped with tartar…"},{"Title":"Casa Dressing","Description":"This tangy dressing is accentuated with lime and cilantro. It is a simple, refreshing topping for a…"},{"Title":"Avocado Dip II","Description":"This is a wonderful, yet simple, guacamole recipe that was given to me by my friend…"},{"Title":"Black Bean and Corn Pasta with Chicken","Description":"Great quick dinner, perfect for summer corn leftovers. Two ears of corn yield one cup of…"},{"Title":"Four Seasons Enchiladas","Description":"Nice and spicy use for leftover turkey in a form that even the children will enjoy. Quick, too!…"},{"Title":"Lazy Katie's Taco Salad","Description":"You do not need to be lazy to appreciate the simplicity of this quickly prepared meal.…"},{"Title":"Mexican Style Dip","Description":"This Tex-Mex recipe was a big hit when brought it to work. My shift starts at 7 AM the dip was…"},{"Title":"Wet Burrito","Description":"Big fat burritos stuffed with seasoned ground beef, beans, and cheese bake under a savory…"},{"Title":"Mexican Lasagna Lite","Description":"Mexican-inspired light ingredients including refried beans, prepared enchilada sauce, sour…"},{"Title":"Sonoran Tilapia","Description":"Seasoned tilapia fillets are covered with fresh cilantro and a squeeze of fresh lime and…"},{"Title":"Cheesy Cornbread Casserole","Description":"This Mexican-style casserole tastes just like homemade tamales, with just a fraction of the…"},{"Title":"Baja Stuffed Potatoes","Description":"My brother, Paul, invented these double stuffed potatoes for a barbecue we had in Mexico. …"},{"Title":"Mexican Beans","Description":"Wonderful Mexican beans to serve as a side dish with your meal."},{"Title":"Turkey Posole","Description":"An authentic rural Mexican dish usually prepared with pork, posole is traditionally…"},{"Title":"Parker's Famous Margaritas","Description":"This is the signature drink at my in-law's home. My father-in-law developed a taste for…"},{"Title":"Rum-Spiked Horchata","Description":"The Mayans and Aztecs called this creamy, rum and vanilla-flavored cocktail 'the drink of the…"},{"Title":"Mexican Soup","Description":"Shredded chicken in a cumin-spiced soup with kidney beans, corn, tomatoes, red and green…"},{"Title":"Mexican Casserole with Tortillas","Description":"Green chile peppers, leftover cubed chicken breast, creamy soups, milk, sour cream and…"},{"Title":"Chipotle Cream Chicken","Description":"Tender chunks of chicken breast simmer in a savory, creamy sauce with a smoky chipotle…"},{"Title":"Mexican Pumpkin Empanadas","Description":"Fat little Mexican-style pastries stuffed with sweet pumpkin filling make a great snack or a…"},{"Title":"Honey-Lime Enchiladas","Description":"Spicy-sweet, cheesy chicken enchiladas are baked in a casserole and served hot."},{"Title":"Southwest Breakfast Burritos","Description":"You'll never buy frozen breakfast burritos again! Loaded with sausage, eggs, and cheese, you…"},{"Title":"Slow Cooker Cheesy Chicken and Tortillas","Description":"Slow cooking the chicken before shredding makes it especially tender and…"},{"Title":"Mexican Strawberry Water (Agua de Fresa)","Description":"Fresh fruit waters, or Aguas de Frutas, made with crushed or blended fruit are a common…"},{"Title":"Fresco Salsa","Description":"No cooking, no cans. All fresh ingredients and flavor no one will be able to walk away from!…"},{"Title":"Italian Amaretto Margaritas","Description":"Amaretto gives this drink a fun twist! Frosty glasses rimmed with amaretto and sugar…"},{"Title":"Southwest Black Bean Chicken Soup","Description":"This Southwest-inspired chicken soup is loaded with black beans, tomatoes, jalapeno…"},{"Title":"Chicken and Mushroom Chimichangas","Description":"Packed with chicken, mushrooms, and poblano peppers, these chicken and mushroom…"},{"Title":"Fideo","Description":"This fideo recipe was given to me by my mother in-law. Fideo pasta is toasted, then simmered…"},{"Title":"Central American Tacos","Description":"Wonderful authentic tacos I first tasted in Guatemala at a taco stand. May be a little…"},{"Title":"Swiss Enchiladas","Description":"Fried corn tortillas are filled with a mixture of chicken, green chilies, green chile salsa, and…"},{"Title":"Churros II","Description":"These fried crullers are rolled in cinnamon sugar while still hot. A wonderful treat!"},{"Title":"Mexican Rice Pilaf","Description":"A nice vegetable broth and tomato sauce give this rice pilaf a hearty flavor. Cumin, chili…"},{"Title":"Ground Beef for Tacos","Description":"Browned ground beef, onion, and taco seasoning -- great for tacos or serve it over rice."},{"Title":"Biscochitos Traditional Cookies","Description":"This is New Mexico's traditional cookie. A great thick sugar cookie that is dusted with…"},{"Title":"No Bull Burritos","Description":"These are wonderfully different and so good. I like to serve them with Mexican rice.…"},{"Title":"Chicken Nachos","Description":"Super-simple but totally killer nachos! These chicken nachos are made with tortilla chips…"},{"Title":"Squash Calabacitas","Description":"A light lunch, or serve with cheese and tortillas. Also good as a side dish with your favorite…"},{"Title":"Taco Seasoning III","Description":"A great basic taco seasoning that mimics the commercial packages."},{"Title":"Mexican Tomato-Flavored Rice","Description":"Make light and fluffy tomato-accented rice flavored with onion and garlic powders using…"},{"Title":"Avocado and Black Eyed Pea Salsa","Description":"Serve this festive, colorful salsa salad, made with black-eyed peas, avocado, and white…"},{"Title":"Mexican Goulash","Description":"Fill your kids up with a cheesy, Mexican-inspired mac and beef dish with beans and salsa."},{"Title":"Easy Mexican Rice","Description":"Brown rice is cooked with taco seasoning, kidney beans, tomatoes and lettuce for a sort…"},{"Title":"Quick Enchilada Sauce","Description":"Just mix tomato sauce, tomato paste, and some spices together for a quick and very easy…"},{"Title":"Easy Taco Rolls","Description":"A taco meat mixture is rolled up into flour tortillas and baked in the oven for a few…"},{"Title":"Spicy Dorito(R) Taco Salad","Description":"A slightly spicy taco salad combines lettuce with ground seasoned beef, cheese, beans, and…"},{"Title":"Breakfast Enchiladas","Description":"A hearty breakfast dish that includes hashbrowns, cheese, ham and diced green…"},{"Title":"Authentic Mexican Enchiladas","Description":"This is the real thing! Corn tortillas are dipped in a home made sauce, fried, filled with Mexican…"},{"Title":"Spicy Albondigas","Description":"Meatballs with rice are simmered in a spicy broth with vegetables in a Mexican-style soup."},{"Title":"Chicken and Black Bean Casserole","Description":"I usually make this the day after we have roast chicken. The recipe calls for baking, but the…"},{"Title":"Vegan Black Bean Quesadillas","Description":"These vegan black bean quesadillas replace the traditional cheese filling with pureed great…"},{"Title":"Salsa Chicken Meatloaf","Description":"Light chicken meatloaf made with salsa and seasoned croutons has a bit of…"},{"Title":"Green Chile Beef Tacos","Description":"Beef chuck roast, taco seasoning mix, green salsa, and beef broth are all you need in your…"},{"Title":"Watermelon Agua Fresca","Description":"This is a drink served throughout Mexico. It is made with several different fruits. This is a…"},{"Title":"Orange and Milk-Braised Pork Carnitas","Description":"Chunks of pork shoulder are braised in milk with herbs and orange zest in Chef John's recipe…"},{"Title":"Pico de Tuna","Description":"A low budget, low fat, easy and delicious salsa. You can add as many or as little veggies to…"},{"Title":"Santa Fe Chicken Salad","Description":"This recipe makes four composed salads that are delicious and fun to make. Lettuce is piled…"},{"Title":"Tex-Mex Corn Chowder","Description":"Cream cheese, chicken broth and milk provide the creamy base for this corn chowder…"},{"Title":"Veggie Fajitas","Description":"My family loves these peppery veggie fajitas! Serve the fajitas with flour tortillas, cheddar…"},{"Title":"Slow Cooker Salsa Chicken","Description":"Cook chicken under layers of vegetables and prepared salsa for a simple, flavor-packed…"},{"Title":"Mexican Grilled Corn","Description":"Fresh ears of corn are grilled until browned and smoky, then topped with an ancho chile and…"},{"Title":"Mexican Blackened Corn","Description":"Kernels of sweet corn are blackened in a skillet with a little beer, cumin and cayenne pepper,…"},{"Title":"Beef Fajitas","Description":"Marinated New York steak makes a terrific beef fajita. Serve it warm white corn tortillas, salsa,…"},{"Title":"Healthier Chicken Enchiladas I","Description":"A family favorite, these chicken enchiladas are made healthier by using reduced-fat cheese,…"},{"Title":"Taco Seasoning (without the chili powder)","Description":"The title says it all. If you seek a recipe for taco seasoning that does not use chili powder,…"},{"Title":"6 Can Chicken Tortilla Soup","Description":"Soup doesn't get much more simple than simmering six cans of prepared food together…"},{"Title":"Corn Chip Salad","Description":"All the standard taco salad fixings (ground beef, lettuce, tomatoes and onion) are chopped…"},{"Title":"Chicana","Description":"This is delicious served in tortillas (although a bit saucy) or over rice. It's easy to make and…"},{"Title":"Delicious Beef Tongue Tacos","Description":"This is a really mouth-watering way of making tongue. It practically melts in your mouth.…"},{"Title":"Salsa Ninety Nine (Mild)","Description":"A salsa recipe for those with a tomato and pepper garden. If you prefer a hotter salsa,…"},{"Title":"Poblano Chile Pepper Soup","Description":"This recipe uses roasted poblano chiles. They are fairly spicy and very flavorful."},{"Title":"Steak Fajitas","Description":"Beef strips are marinated for 2 to 4 hours in lime juice with cilantro, then sauteed, and…"},{"Title":"Chicken Cheddar and Guacamole Burgers","Description":"Using ground chicken to make burgers topped with guacamole allows the added flavors of…"},{"Title":"Arroz Rojo (Mexican Red Rice)","Description":"A dish of savory tomato-flavored rice is an authentic side dish for your Mexican meal."},{"Title":"Super Easy Slow Cooker Chicken Enchilada Meat","Description":"This easy slow cooker recipe delivers tender chicken in an enchilada sauce perfect for your…"},{"Title":"Low-Carb \"Tacos\"","Description":"You don't need to sacrifice your taco cravings when watching your carbohydrates thanks to…"},{"Title":"Monster Sour Cream Enchiladas","Description":"Muenster and longhorn cheeses top corn tortillas stuffed with shredded chicken, sour…"},{"Title":"Mexican Lasagna Chip Dip","Description":"I'm not sure why it's called lasagna, but it is very good. A beef and refried bean mixture is…"},{"Title":"Bean Salad","Description":"A spicy bean salad with a kick of lime that is great as a side dish, nacho topping, or all on…"},{"Title":"Frijoles I","Description":"A friend passed this recipe to me. It is a little more work, but worth it for authentic refried…"},{"Title":"Mexican Style Meatballs","Description":"Yummy miniature meatballs in a chipotle tomato sauce. I have been serving these for…"},{"Title":"Easy Frozen Margaritas","Description":"Authentic margaritas call for lots of fresh lime juice - both expensive and time-consuming.…"},{"Title":"Santa Fe Soup","Description":"Browned ground beef is combined with processed cheese, onions, tomatoes, corn…"},{"Title":"Turkey Tortilla Soup","Description":"Cans of green and red enchilada sauce are combined in this turkey and corn tortilla soup…"},{"Title":"Taco Stew","Description":"Ground beef and onions sauteed with a packet of taco seasoning mix are combined in this…"},{"Title":"Chicken Tortilla Soup in the Slow Cooker","Description":"Everyone loves using their slow cooker to make delicious meals easily. This recipe will get you…"},{"Title":"Bountiful Garden Zucchini Enchiladas","Description":"Fresh zucchini and Monterey Jack cheese filled enchiladas make a fabulous vegetarian entree…"},{"Title":"Bean and Honey Burrito Casserole","Description":"Here's a great way to feed burritos to a crowd. Layer chicken, veggies, and a creamy honey…"},{"Title":"Green Chile Chicken Stew","Description":"This stew will keep you warm and cozy on those cold winter days!! I got this recipe together…"}]