[{"Title":"Indian Peanut Stew","Description":"This is an easy, authentic dish from South Asia that appeals to a wide range of tastes. The…"},{"Title":"Roomali Roti","Description":"There is no leavening in this simple, tender Indian flatbread of bread flour, oil, salt and…"},{"Title":"Spicy Sweet Potato Salad","Description":"It's important to use good mayonnaise in this recipe, and to let the cooked potatoes chill…"},{"Title":"Chicken Saag","Description":"The classic Indian chicken and spinach dish gets richness from sour cream."},{"Title":"Paleo Slow Cooker Pork Loin","Description":"Boneless pork loin slowly cooks in a curried fruit sauce until tender and delicious."},{"Title":"Bombay Chicken and Rice","Description":"Chicken parts are brushed with a butter and curry mixture and baked in a mixture of rice,…"},{"Title":"Indian Carrots, Peas and Potatoes","Description":"Potatoes, peas and carrots are cooked with Indian spices for an easy yet exotic side dish."},{"Title":"Wendy's Indian Butter Chicken","Description":"This recipe resembles a dish from an Indian restaurant in my town. I love it. It's got a great…"},{"Title":"Indian Chickpeas","Description":"Garbanzo beans, onions, and spices are simmered together in this typical Northern…"},{"Title":"Dal Makhani (Indian Lentils)","Description":"These richly spiced lentils are simmered for two hours in a spicy tomato sauce and finished…"},{"Title":"Raita","Description":"Chopped tomatoes and cucumbers are tossed with a sour cream, yogurt, garlic and cumin…"},{"Title":"Yogurt-Marinated Salmon Fillets (Dahi Machhali Masaledar)","Description":"A yogurt-based marinade with cayenne pepper, ginger and garlic spice up your salmon fillets…"},{"Title":"Indian-Spiced Roasted Chickpeas","Description":"Spicy roasted chickpeas are crisp, spicy little nibbles. This is one snack that you can feel…"},{"Title":"Cauliflower and Tofu Masala","Description":"Pressed tofu cubes are baked with a yogurt and spice sauce, then simmered with cauliflower…"},{"Title":"Channa Masala (Chickpea Curry)","Description":"This fantastic Indian vegetarian curry recipe is great with Indian-style breads or rice."},{"Title":"Bengali Chicken Curry with Potatoes","Description":"Thy this delicious and authentic recipe for chicken and potato curry with cayenne…"},{"Title":"Indian Sweet Bread","Description":"A crisp and sweet flatbread that's fried on the griddle."},{"Title":"Rosy's Palak Paneer","Description":"An Indian friend of mine showed me the ropes for cooking this delicious and completely…"},{"Title":"Roti Bread from India","Description":"This version of the delicate Indian flatbread uses durum wheat flour - the kind often used to…"},{"Title":"Indian Vegetable Rice","Description":"Basmati rice enhanced with the flavors of jeera (cumin), garam masala, mixed vegetables and…"},{"Title":"Aloo Gobi Masala (Cauliflower and Potato Curry)","Description":"This is a traditional Indian cauliflower and potato curry recipe."},{"Title":"Tandoori Fish","Description":"This fish curry recipe works well with catfish, tilapia, or orange roughy. As with all Indian…"},{"Title":"Punjabi Chicken in Thick Gravy","Description":"Chicken legs simmer in a thick curry sauce for a delicious dinner with just the right amount of…"},{"Title":"Pumpkin Curry with Lentils and Apples","Description":"East meets West in this inspired curry dish combining fresh pumpkin with lentils, carrots,…"},{"Title":"Aloo Gobi","Description":"Traditional Indian dish made of spiced cauliflower and potatoes. This dish is steamed…"},{"Title":"Spicy Peach Chutney","Description":"This chutney closely resembles imported Indian chutneys and is good with all curry dishes. It…"},{"Title":"Naan Bread","Description":"A yeast-raised South Asian flatbread with a delicious chewy texture."},{"Title":"Potatoes Madras","Description":"Great for dinner parties, this colorful and flavorful dish is inspired by southern Indian…"},{"Title":"Steve's Chicken Korma","Description":"Always a favorite, this version of the classic chicken curry from North India is made…"},{"Title":"Roasted Curried Chicken with Couscous","Description":"A great blend of exciting and subtle flavors are infused into a whole chicken during cooking."},{"Title":"Kashmiri-Style Kidney Beans with Turnips","Description":"This flavorful recipe is a winter staple in Kashmir."},{"Title":"Maharaja Curry","Description":"Chicken is simmered in an onion-tomato sauce in this really nice Indian recipe, taught to me…"},{"Title":"Curried Chicken and Rice Salad","Description":"This is a crunchy chicken and rice salad with an East Indian influence."},{"Title":"Slow Cooker Chicken Curry with Quinoa","Description":"Chicken, quinoa, and apples, combine in this tasty, easy curry!"},{"Title":"Vegetable Biryani","Description":"This is a tasty and interesting vegetable biryani. The color looks appetizing and the taste is…"},{"Title":"Chicken Hariyali Tikka","Description":"Chicken breast meat is rubbed with an intoxicating paste made with cilantro, mint,…"},{"Title":"Easy Chickpea Curry","Description":"A rich chickpea and potato curry with coconut milk and Indian spices is surprisingly easy to…"},{"Title":"Kashmiri Lamb","Description":"This lamb curry features green and red chiles, dried coconut, and almonds in a…"},{"Title":"Rajma (Kidney Bean Curry)","Description":"This delicious vegetarian stew is made in the pressure cooker, using dried kidney beans…"},{"Title":"Pantry Curried Quinoa with Garbanzo Beans and Roasted Peppers","Description":"Pantry staples like canned garbanzo beans, quinoa, roasted red peppers, and dried herbs…"},{"Title":"Indian Vegetable Bhaji","Description":"In this Indian dry curry, potatoes, cauliflower, carrots and peas are fried and flavored with…"},{"Title":"Slow Cooker Chicken Tikka Masala","Description":"Everyone's favorite Indian take-out dish comes together in a slow cooker for an easy way to…"},{"Title":"Lamb Madras Curry","Description":"This amazing curry is made by simmering lamb in a homemade curry paste. It takes time, but…"},{"Title":"Strawberry Lassi","Description":"First popular in Punjab, India, and originally sometimes flavored with ground cumin,…"},{"Title":"Basic Curry Sauce","Description":"Fragrant and rich, this sauce includes spices like coriander, cumin and turmeric with the…"},{"Title":"Shahi Paneer","Description":"This delightful recipe for cubes of paneer in a tomato-cream sauce is sure to be a nice treat."},{"Title":"Sweet and Spicy Curry with Chickpeas","Description":"An easy curry of turkey and garbanzo beans simmers with coconut milk and bottled…"},{"Title":"Apple Chutney","Description":"This easy chutney is a great companion for so many dishes from turkey sandwiches to pork…"},{"Title":"Garam Masala Seared Salmon with Coconut-Curry Butter","Description":"Salmon fillets are dusted with garam masala, seared for a crispy crust, then served with a…"},{"Title":"Roasted Grapes and Carrots","Description":"Grapes and carrots are tossed with cumin and roasted to create this Indian dish I had while…"},{"Title":"Chicken Biryani, Hyderabadi Style","Description":"A trademark of home-cooking in southern India, this luscious chicken dish is an authentic…"},{"Title":"Cucumber Peanut Salad","Description":"This is a fresh and delicious cucumber salad tossed with lemon, cumin, cilantro, and…"},{"Title":"Gulab Jamun","Description":"This is a traditional Indian dessert. Spongy milky balls soaked in rose scented syrup.…"},{"Title":"Beef and Spinach Curry","Description":"Beef, spinach, tomatoes, and coconut milk are simmered together with a variety of spices,…"},{"Title":"Mild Curry Powder","Description":"A fragrant yellow curry powder to use in soups, sauces, rice, and anything else you can think of!"},{"Title":"Green Chutney","Description":"This is a very tasty cilantro-based chutney that can be prepared in minutes. Just add fresh…"},{"Title":"Easy Veggie Samosas","Description":"Quick vegetarian samosas with a curried garbanzo bean filling. You can adjust the…"},{"Title":"Bunjal Chicken","Description":"Steamed chicken is blanketed in a garlic-tomato-curry sauce flavored with garam…"},{"Title":"Jorge's Indian-Spiced Tomato Lentil Soup","Description":"Tomato lentil soup seasoned with Indian spices is a warm and comforting meal that pairs…"},{"Title":"Spicy Lentil Dip","Description":"You boil lentils, then blend them until smooth to make this pungent puree; curry-scented…"},{"Title":"Cilantro Jalapeno Pesto with Lime","Description":"This is a spicy alternative to classic basil pesto. Add to pasta, fish, or chicken dishes as you…"},{"Title":"Red Kidney Beans (Rajma)","Description":"Enjoy this Indian recipe for rajma (red kidney beans) with jeera (cumin) rice. You can spice…"},{"Title":"Curried Chicken and Potatoes","Description":"This is a hearty meal of chicken and potatoes simmered with Indian spices, tomatoes, Swiss…"},{"Title":"Mango-Pineapple Chutney","Description":"The sweetness of mango, pineapple and red pepper is given a zing from fresh ginger and a…"},{"Title":"Delicious Chana Masala","Description":"A delicious traditional vegetarian Indian dish of chickpeas, onions, and tomatoes you can…"},{"Title":"Beef Vindaloo","Description":"This make-ahead vindaloo recipe is a guaranteed crowd pleaser and will convert…"},{"Title":"Spicy Chicken Curry","Description":"The special curry compound known as garam masala is the key to this vigorous chicken,…"},{"Title":"Samosas","Description":"These stuffed savory pastries are a traditional Indian favorite. Lamb meat and spices are…"},{"Title":"Chicken Vindaloo","Description":"This spicy potato and chicken dish can be adapted to use any meat you wish."},{"Title":"Exotic Brinjal (Spicy Eggplant)","Description":"Eggplant cubes are browned, then simmered with onions in a sauce fragrant with Indian…"},{"Title":"Okra Curry","Description":"Sliced okra rounds are seasoned with cumin and curry powder in this quick and easy dry curry…"},{"Title":"Chicken Korma","Description":"Prepare this flavorful Indian curry in less than hour! Serve with rice or naan."},{"Title":"Whole Wheat Chapati","Description":"Similar to a wheat pita, it is bread made of whole wheat flour. I make it for my diabetic…"},{"Title":"Sweet Tamarind Chutney","Description":"This is an East Indian sweet tamarind chutney."},{"Title":"Masala-Spiced Roast Chicken","Description":"Garam masala and lime give an Indian flavor to this simple roast chicken."},{"Title":"Quick Nariyal Burfi (Indian Coconut Fudge)","Description":"This traditional, cardamom-flavored Indian sweet may now be made in under 15 minutes!"},{"Title":"Indian Sweet Potato and Lentil Soup","Description":"Lentils, sweet potatoes, onions, and spinach are simmered with aromatic Indian-inspired…"},{"Title":"Indian Chole Aloo Tikki","Description":"This is a delicious vegan Indian recipe where vegetables and chickpeas are served over…"},{"Title":"Indian Pork Chops","Description":"This is a great weeknight dinner entree - quick and easy with only five ingredients and…"},{"Title":"Aloo Gobi ki Subzi (Potatoes and Cauliflower)","Description":"This is a simple and easy to toss together recipe using cauliflower. Serve this dish with Indian…"},{"Title":"Slow Cooker Chai","Description":"Spicy, creamy, and sweet chai tea is easy to make with the help of your slow cooker."},{"Title":"Indian Hot Curried Mangos with Tofu","Description":"Mango slices and tofu cubes are simmered together in curry-seasoned coconut milk. If…"},{"Title":"Easy Baked Indian Samosas","Description":"Baked samosas made with pie crust and seasoned potatoes and peas are an easy…"},{"Title":"Spinach and Cauliflower Bhaji","Description":"Cauliflower and spinach are simmered in a curry-flavored tomato broth for a warm and…"},{"Title":"Restaurant Style Mango Lassi","Description":"This mango lassi uses canned mangos to create a smoother, tastier drink."},{"Title":"Carrot Recipe","Description":"Shredded carrots are cooked with sugar, raisins and cashews. This is a healthy dessert recipe…"},{"Title":"Pineapple, Lime, and Ginger Soup","Description":"Ground cumin, chile peppers and ginger are stirred into a hot mixture of tomatoes,…"},{"Title":"Indian Spiced Rice Treats","Description":"This is a variation on the traditional crispy rice cereal treat with an international twist!…"},{"Title":"Curried Pork Chops and Cauliflower with Basmati Rice","Description":"Lean pork chops and tender cauliflower florets in a creamy and lightly sweet curry sauce are…"},{"Title":"Creamy Cashew Chicken Curry","Description":"After marinating in a curry rub, chicken thighs are simmered with aromatics and homemade…"},{"Title":"Simple Spiced Rice","Description":"Simple basmati rice, with its subtle, flowery fragrance, cooks up light and fluffy with…"},{"Title":"Easy Indian Curried Lamb","Description":"Tender lamb meat is simmered in an Indian-inspired curry sauce for a delicious and…"},{"Title":"Chef John's Tandoori Chicken","Description":"In this simple recipe, chicken is marinated in yogurt and tandoori masala, then grilled over…"},{"Title":"Chana Masala (Chickpeas and Tomatoes)","Description":"Chana masala, an Indian-inspired dish, contains chickpeas and tomatoes simmered in a nicely…"},{"Title":"Chicken Chicken Curry","Description":"Tender morsels of chicken breast are simmered in a fragrant combination of Bengali flavors…"},{"Title":"Gujarati Carrot and Peanut Salad","Description":"A refreshing Indian salad that is the perfect complement to a curry meal. The peanuts add…"},{"Title":"Jeera (Cumin) Rice","Description":"Cumin seeds are fun to cook with, they come alive when you drop them in hot oil, and they…"},{"Title":"Jeera Fried Rice","Description":"Indian fried rice made with long-grain rice, cumin, black peppercorns, and onions."},{"Title":"Indian Barbeque Chicken","Description":"Marinate the chicken overnight for a deliciously flavorful and tender chicken dish. This is an…"},{"Title":"Indian Peas And Cauliflower","Description":"A simple, flavorful Indian-style dish! Peas and cauliflower are sauteed with cumin and…"},{"Title":"Garam Masala Spice Blend","Description":"Garam masala is a spicy blend of aromatic spices and chiles from northern India. Make it…"},{"Title":"Blue Ribbon Curry Chicken","Description":"This creamy curry is sweetened up with bits of apple. Serve it over a bed of steamy rice, and…"},{"Title":"Easy Palak Paneer","Description":"Spinach is mixed with curry, garam masala, fresh ginger, and paneer cheese in this…"},{"Title":"Naan-like Easy Flatbread","Description":"Make these from-scratch flatbreads without yeast using this quick and easy recipe the next…"},{"Title":"Indian Rice Pilaf","Description":"Indian-inspired rice is nicely spiced with curry powder, cinnamon, and garlic powder for a…"},{"Title":"Lamb (Gosht) Biryani","Description":"This Indian lamb and rice dish is a delicious meal for dinner parties."},{"Title":"Coconut Curried Tofu with Green Beans and Coconut Rice","Description":"This is the no-fuss curry recipe for 'quick and easy' cooks out there. The rice is simple yet…"},{"Title":"Traditional Chicken Curry","Description":"A traditional North Indian (Punjabi) curry dish. An aromatic and spicy combination of chicken…"},{"Title":"Indian Spiced Rice","Description":"This rice is delicious and full of surprises -raisins, lentils, bell peppers, peas and potatoes -…"},{"Title":"Curried Microwaved Chicken","Description":"Apple imparts a sweet complexity to this curried mushroom cream sauce, quickly prepared…"},{"Title":"Coconut Curry Cabbage","Description":"Cabbage is simmered with coconut milk and curry, making a wonderful side dish to serve…"},{"Title":"Cucumber-Cilantro Raita (Yogurt)","Description":"This quick and tasty Indian yogurt side dish is accented with green chile pepper, cilantro,…"},{"Title":"Chicken Saagwala","Description":"Simple, fragrant, Indian-inspired chicken simmers in a light sauce made flavorful with…"},{"Title":"Chai Tea Latte","Description":"Make a homemade version of a chai tea latte with boiling water, milk, sugar, honey, and a…"},{"Title":"Lamb Shank Vindaloo","Description":"Lamb shanks are slow cooked with garam masala, ginger, paprika, cayenne, onions, and…"},{"Title":"Indian Rice (Pulao)","Description":"Saffron threads lend a deep, golden color to this spice infused, Indian rice dish."},{"Title":"Indian-Style Butter Chicken (Murgh Makhani)","Description":"Red chiles, cinnamon, nutmeg, cloves, ginger, and garlic all lend their robust flavors to this…"},{"Title":"Bangan ka Bhurta (Indian Eggplant)","Description":"This is a very simple, quick and more importantly authentic Indian side dish of…"},{"Title":"Pav Bhaji","Description":"This is a very popular recipe in India, liked by almost everyone. You may have to go to a…"},{"Title":"Easy Vegetable Biryani","Description":"Basmati rice is lightly fried with cumin, cloves and onion, then simmered with garam…"},{"Title":"Turmeric Milk","Description":"Fresh turmeric and fresh ginger give this warm turmeric milk, made with almond milk, a…"},{"Title":"Indian Butter Chicken (Chicken Makhani)","Description":"Chicken is simmered in a smooth and fragrant tomato-based sauce with cashews and Indian…"},{"Title":"Curried Peas","Description":"First you saute onion with cinnamon and cumin. A very happy beginning. Then you stir in…"},{"Title":"Paneer (Home Made)","Description":"Paneer is an essential ingrediant in Indian cooking. Often people substitue riccotta or…"},{"Title":"Rogan Josh, Lamb Shanks","Description":"Rogan Josh is an aromatic lamb dish that originates in Northern India. In this variation,…"},{"Title":"Maharani Cupcakes","Description":"These coconut cupcakes with curry lemon curd and a sweet basil cream topping are regal…"},{"Title":"Sweet Lamb Curry","Description":"A mild, fragrant mix of lamb, raisins, and apples produces a wonderful, slow cooked curry."},{"Title":"Curried Corn","Description":"A unique and delicious way to serve corn!"},{"Title":"Mini Sweet Potato Samosas","Description":"These attractive little samosas of curried sweet potatoes make a nice appetizer or cocktail…"},{"Title":"Peanut Rice","Description":"Fragrant basmati rice is cooked with peanuts, green peas, and a little turmeric."},{"Title":"Spiced Eggplant Indian Style","Description":"This simple recipe combines the traditional Indian flavors of eggplant, tomatoes, onions…"},{"Title":"Best Potatoes Ever!","Description":"Everyone will enjoy these delicious potatoes cooked up with Indian spices."},{"Title":"Carrot and Cilantro Soup","Description":"This easy carrot and coriander soup is lovely and creamy, with a bit of a twang. It's an ideal…"},{"Title":"Cilantro Garlic Chicken","Description":"Chicken thighs and drumsticks simmer in a creamy yogurt sauce flavored with lots of…"},{"Title":"Curried Lamb","Description":"Lamb is seasoned with a homemade curry mixture of coriander, cumin, cardamom, and…"},{"Title":"Bhindi Masala (Spicy Okra Curry)","Description":"This is a spicy curry dish with okra, tomatoes, and onion."},{"Title":"Quorn(TM) and Chickpea Curry","Description":"Vegetarian curry recipe made with chickpeas and Quorn(R), and seasoned with a…"},{"Title":"Four Seasons Chicken Curry","Description":"A hot, sweet, sour and fragrant explosion of taste on a plate. The longer you leave to…"},{"Title":"Broken Thermostat Curry","Description":"This flavorful, vegetarian curry is made with carrot, yam, red potatoes, tomatoes, and…"},{"Title":"Spicy Baked Cod Fillets","Description":"Cod fillets are marinated in a blend of yogurt and spices then oven baked. This is a rich…"},{"Title":"Fruited Tofu Curry Salad","Description":"A vegetarian tofu salad that's just loaded with flavor! Cubed tofu tossed with rice, grapes,…"},{"Title":"Paneer Butter Masala","Description":"Lightly fried paneer simmers in a thick tomato sauce spiced with cumin, coriander, red chile…"},{"Title":"Bombay Chicken Wings","Description":"Chicken wings with a light curry flavor will make a nice snack, appetizer, or game-day treat."},{"Title":"Tofu Masala","Description":"This flavorful blend of spices, vegetables, and tofu is great served over basmati rice."},{"Title":"Seared Salmon with Indian-Inspired Cream Sauce","Description":"A creamy stovetop sauce accented with curry and saffron and made from chopped fresh…"},{"Title":"Indian Lassi","Description":"Here is a basic recipe for Indian Lassi (yogurt drink). You can add more or less yogurt or…"},{"Title":"Mango Lassi I","Description":"A cooling drink made with mango and yogurt, Eastern Indian Lassi."},{"Title":"Kedgeree","Description":"A delicious traditional English breakfast dish using smoked white fish, rice and eggs. It is…"},{"Title":"Masala Chai","Description":"This chai tea is hot, spicy, and has a hint of the exotic...gotta love it!"},{"Title":"Masur Dahl","Description":"This is a delicious Indian lentil soup with spicy red onions!"},{"Title":"Authentic South Indian Biryani","Description":"The deep flavors and piquant aromas of southern Indian cooking come to life in this…"},{"Title":"Quinoa Biryani","Description":"Quinoa replaces basmati rice in this fragrant take on a traditional Indian side dish."},{"Title":"Indian Pot Roast","Description":"An extremely flavorful roast with very aromatic gravy. You can add cubed potatoes and peas…"},{"Title":"Samosadilla (Samosa Quesadilla)","Description":"You can't mess up a samosa quesadilla, Chef John's easier, tortilla-wrapped alternative to…"},{"Title":"Easy Instant Pot(R) Chicken Tikka Masala","Description":"This absolutely irresistible chicken tikka masala made in the Instant Pot(R) - with all the…"},{"Title":"Spinach and Tomato Dal (Indian Lentil Soup)","Description":"This basic dal (Indian lentil soup) recipe makes a hearty and healthy dish that leaves you…"},{"Title":"Naan Bread Margherita Pizza with Prosciutto","Description":"Substitute naan bread for pizza dough and top with mozzarella cheese, tomatoes, and…"},{"Title":"Black Pepper Goat Curry","Description":"Black peppercorns, coriander, and cayenne lend a distinct flavor to this South Indian goat curry."},{"Title":"Indian-Style Salmon Fry","Description":"Canned salmon is pan-fried with onions, tomatoes, and spices to make a quick,…"},{"Title":"Basic Indian Curry with Paneer","Description":"This is a wonderful Indian curry made with paneer cheese and frozen peas."},{"Title":"Reshmi Kebab (Silken Kebabs)","Description":"This is a traditional Muglai dish prepared in India. It gets its name from the succulence of…"},{"Title":"Quick and Easy Indian-Style Okra","Description":"Exciting Indian spices bring a warm, exotic flavor to fried okra."},{"Title":"Masala Beef with Ginger and Curry Leaf","Description":"Cubed beef is simmered in a spicy liquid until nearly dry, then combined with an onion…"},{"Title":"Indian Chai Hot Chocolate","Description":"Put yourself in a holiday mood with this merry drink blending spiced chai tea with hot…"},{"Title":"Besan (Gram Flour) Halwa","Description":"If you like the flavor of chickpea flour (besan) in sweets, you will love this halwa. Your kids may…"},{"Title":"Aloo Gobhi","Description":"Try this version of a classic vegetarian Indian stir-fry dish featuring cauliflower and potatoes."},{"Title":"Kale and Spinach Saag","Description":"Fresh spinach and kale are cooked with ginger, garlic, and spices, then simmered with milk…"},{"Title":"Vegan Indian Curry with Cauliflower and Lentils","Description":"Coconut milk, cauliflower, red lentils, and green beans are the main ingredients of this vegan…"},{"Title":"Hot and Spicy Himalayan Tea (Chai Tea)","Description":"Milk, tea leaves, cardamom, cinnamon stick, peppercorns, and cloves are simmered…"},{"Title":"Cauliflower Rice (Biryani-Style)","Description":"Cauliflower rice is seasoned with garam masala, turmeric, cumin, and coriander in this…"},{"Title":"Vendakka Paalu","Description":"This spicy, creamy, and vegan-friendly okra curry dish is very simple to make and will…"},{"Title":"Turkey Curry","Description":"A great use for leftover Thanksgiving turkey. Serve with warm naan bread or atop steamed…"},{"Title":"Tandoori Chicken I","Description":"Yogurt and lemon mix with tandoori spice--a blend including cumin, ginger, turmeric and…"},{"Title":"Curried Stew with Lamb","Description":"Lamb is marinated in yogurt and garlic overnight, then slowly stewed with curry…"},{"Title":"Spiced Naan","Description":"This Indian stuffed naan bread has a wonderful, spicy filling and is surprisingly easy to make."},{"Title":"Curried Beef with Winter Vegetables","Description":"A medley of winter vegetables--parsnips, carrots, potatoes, celery, garlic and…"},{"Title":"Indian Salad","Description":"This is a very tasty brown rice recipe salad made with asparagus, apples, raisins, and a curry…"},{"Title":"Biriyani","Description":"One of the most well-known Indian-Pakistani dishes made. A spicy chicken and rice dish."},{"Title":"Punjabi Sukha Urad Dal","Description":"Try this warm, thick, and comforting dish with split black lentils to warm yourself on a cold…"},{"Title":"Ras Malai","Description":"This version of a popular Indian dessert consists of cheese dumplings in a cream sauce topped…"},{"Title":"Easy Curry Rice","Description":"This rice side dish recipe utilizes a rice cooker."},{"Title":"Turnip with Coconut","Description":"Turnips and turnip greens are cooked with onion and mustard seeds and finished with…"},{"Title":"Goan Pork Vindaloo","Description":"This traditional Goan pork dish flavored with chilies, garlic and vinegar is spicy and tangy…"},{"Title":"Grilled \"Tandoori\" Lamb","Description":"Yogurt, lemon, and spices combine to make a rich and creamy marinade that coats Chef…"},{"Title":"Tandoori Masala Spice Mix","Description":"Homemade tandoori masala spice mix, a staple for Indian butter chicken, is easy to make at…"},{"Title":"Indian Chicken Tikka Masala","Description":"Chicken breasts, garlic, ginger, yogurt, tomatoes, and curry paste come together…"},{"Title":"Seitan Makhani (Vegan-Style Indian Butter Chicken)","Description":"Seitan is a meat substitute made from wheat protein (gluten). It makes a terrific substitute…"},{"Title":"Mango Lassi-Come-Home","Description":"Pureed mango and mango nectar are blended with lemon yogurt, vanilla yogurt, milk, and…"},{"Title":"Fried Curry Chicken","Description":"Chicken strips are coated in a creamy, spicy yogurt sauce, dipped in bread crumbs, and…"},{"Title":"Spicy Yogurt Dressing","Description":"Delicious, creamy dressing with just a bit of spice."},{"Title":"Spicy Indian Chicken with Green Masala","Description":"Chicken drumsticks are simmered in a home made green masala packed with fresh cilantro."},{"Title":"Spinach and Buttermilk Soup","Description":"This tangy curried spinach soup gets a spicy kick from serrano chiles and cumin seeds, with a…"},{"Title":"Coconut Sevai (Rice Noodles)","Description":"This is one of my favorite easy-to-make Indian recipes. Although I try to make it the best as I…"},{"Title":"Cilantro Chutney Chicken","Description":"A garlic and ginger rub sets the stage for a spicy, homemade cilantro chutney to serve over…"},{"Title":"Chicken Curry V","Description":"This is the Malaysian version of Indian chicken curry, which uses coconut milk. It can be…"},{"Title":"Spicy Swordfish","Description":"Swordfish chunks are simmered in a mango and coconut mixture. Serve over rice."},{"Title":"Spicy Tomato Chutney","Description":"Spicy and sweet - ginger, garlic, chili powder, and curry paste are just a few of the flavors in…"},{"Title":"Chai Tea","Description":"This exotic tea uses cardamom, cinnamon and pepper for flavor."},{"Title":"Quick Vegetable Curry","Description":"A bountiful medley of beans and vegetables. This easy curry can be made in minutes.…"},{"Title":"Fettuccine Bombay","Description":"Italy meets India in this delicious variation on the usual tomato sauce."},{"Title":"East Indian Chicken with Tomato, Peas, and Cilantro","Description":"East Indian curried chicken simmered in a spiced tomato sauce is a flavorful one-pan…"},{"Title":"Lamb Korma","Description":"Lamb is simmered in a coconut milk curry sauce with potatoes and chickpeas in this tasty…"},{"Title":"Biryani with Yogurt Marinated Chicken","Description":"Chicken marinated in yogurt and rice scented with saffron, cardamom, cinnamon, and…"},{"Title":"Chicken Cauliflower Korma","Description":"A mild, creamy chicken cauliflower curry is loaded with both vegetables and flavor in this…"},{"Title":"Paneer Tikka Masala","Description":"Paneer floats in a perfectly seasoned, creamy sauce in this traditional Indian recipe for…"},{"Title":"Vegan Sweet Potato Chickpea Curry","Description":"This delicious vegan curry dish with sweet potatoes, chickpeas, spinach, and coconut…"},{"Title":"Chicken Navratan Curry (Indian)","Description":"Chicken and vegetables are simmered in spiced coconut milk for an aromatic and flavorful…"},{"Title":"Pixie's Indian Style Halibut","Description":"Mild and delicious halibut fillets are rubbed in Indian inspired spices and quickly pan fried."},{"Title":"Baked Chicken Curry Flavor-Fest","Description":"This chicken is spicy, tangy, and juicy, but with no added fat. It's easy to make in large…"},{"Title":"Curried Hash Browns","Description":"This recipe fuses an American breakfast favorite-hash browns-with some South Asian flavors…"},{"Title":"Green Pea Poulourie","Description":"Indian-spiced, vegetarian green pea balls are deep fried and served either as a main dish, or…"},{"Title":"Curry Sauce","Description":"This sauce base for curry is made with onions, tomatoes, turmeric, cumin, garam masala,…"},{"Title":"Best Burgers Ever","Description":"I made up this mixture on a whim and wow! These are definitely the best hamburgers I've…"},{"Title":"Spicy Dry Fried Curry Chicken","Description":"This recipe is from North India where my mother was born. She gave me the recipe when I was…"},{"Title":"Chocolate Chai","Description":"Spicy cinnamon chai tea with chocolate is a great warm drink for those cold winter nights!"},{"Title":"Dairy-Free Cauliflower Fritters","Description":"Battered and fried cauliflower is a delicious way to eat cauliflower, and a great snack! These…"},{"Title":"Chicken Fry","Description":"Hotly spiced, this golden Indian chicken saute is ready to serve in minutes."},{"Title":"Mulligatawny Soup III","Description":"If you like a less spicy Mulligatawny, this recipe is for you. You will need to have five cups of…"},{"Title":"Indian Matar Paneer (Cottage Cheese and Peas)","Description":"Learn how to make your own paneer (Indian cheese) in this recipe for stir fried vegetables…"},{"Title":"Pumpkin, Butter Bean, and Spinach Curry","Description":"The whole family will love this mild and creamy vegetarian curry. It's easy to make too!"},{"Title":"South Indian Chickpea Salad","Description":"Garbanzo beans, mango, romaine lettuce, pineapple, cucumber, celery, and carrots are…"},{"Title":"Mango-Mint Lassi with Indian Sweet Spices","Description":"Mint and mango are joined by star anise and cardamom in this refreshing Indian yogurt…"},{"Title":"Batata Nu Shak (Potato Curry)","Description":"This spicy potato dish is delicious served with rice."},{"Title":"Paneer Makhani","Description":"A richly fragrant sauce made with spices, cream, and tomato is served with Indian paneer…"},{"Title":"Indian Sabji Recipe","Description":"Cabbage and potatoes are flavored with an array of aromatic Indian spices for a…"},{"Title":"Indian Chicken Rub","Description":"Indian-inspired spices are combined to create a flavorful and aromatic spice rub for chicken."},{"Title":"Prawn Malai Curry","Description":"This creamy curry dish combines prawns with coconut milk, onion, ginger and garlic pastes,…"},{"Title":"Kheema Matar (Beef and Pea Curry)","Description":"Ground beef and green peas are simmered together in this easy Kheema Matar curry full…"},{"Title":"Red Split Lentils (Masoor Dal)","Description":"These Indian-inspired red lentils (masoor dal) flavored with cumin, turmeric, and ginger can…"},{"Title":"Egg Curry","Description":"Make this aromatic, quick and easy curry with hard-boiled eggs the next time you're craving…"},{"Title":"Chai Tea Concentrate","Description":"Homemade chia tea concentrate is simple to prepare using a variety of spices steeped with…"},{"Title":"Chennai Chicken Wings","Description":"Spicy, piquant flavors intensify with every bite of Chef John's baked Chennai chicken wings,…"},{"Title":"Bombay Potatoes","Description":"A yummy Indian side dish, Bombay potatoes are vegan, super simple to make, and family…"},{"Title":"Layered Chutney Dip","Description":"Curry cream cheese is topped with chutney, cashews, coconut, and green onions for a…"},{"Title":"Quick Whole Wheat Chapati","Description":"Fresh whole wheat chapati is quick, easy, and delicious; perfect with butter, as an…"},{"Title":"Bangaladumpa (Potato) Upma Koora","Description":"This potato curry is seasoned with green chile peppers, dried red chile peppers, fresh curry…"},{"Title":"Paneer Jalfrazie","Description":"This Indian dish features fried cubes of Paneer, a southeastern Asian cheese, in a mixture of…"},{"Title":"Dosas (Indian-style Pancakes)","Description":"A blend of spices flavor this adaptation of traditional South Indian dosas, a thin,…"},{"Title":"Mango Coconut Sauce","Description":"Fresh mango puree forms the base of a luxurious tropical sauce flavored with coconut…"},{"Title":"Sugar-Free Cardamom-Mango Smoothie","Description":"This Indian-inspired smoothie is creamy like a milkshake, sweet, smooth, and doesn't use…"},{"Title":"Vegetable Koftas","Description":"These fried potato and vegetable balls are an Indian specialty served on special occasions. …"},{"Title":"Lasooni Murgh (Garlic Flavored Spicy Chicken)","Description":"Chicken is marinated overnight in spiced yogurt, then cooked together with cumin and cream…"},{"Title":"Indian-Inspired Egg Salad","Description":"Unexpected Indian flavorings take this favorite to an appealing new place. Eat with pita…"},{"Title":"Carrot-Bean Sprouts Salad","Description":"Carrots and bean sprouts are tossed with fresh coconut, cilantro, and a simple dressing made…"},{"Title":"Spicy Chicken in Tomato-Coconut Sauce","Description":"This chicken dish is served over rice, and explodes with the flavors of India!"},{"Title":"Grilled Indian Chicken","Description":"This is an Indian dish. If it is marinated for as long as 2 to 3 hours it will be tastier."},{"Title":"Sambar","Description":"Lightly spiced lentils in a tamarind and coconut sauce, tempered with Indian spices. Serve hot…"},{"Title":"Keerti's Karwari Prawns","Description":"A prawn preparation made with coconut. Typical to the coastal areas of Karwar in…"},{"Title":"Chaat - Dahi Batata Puri","Description":"Fragrant and aromatic and delicious, as all Indian cooking seems to be. Spiced yogurt…"},{"Title":"Yogurt Samosas","Description":"Cilantro and yogurt give these samosas the Indian flavor. This is an amazing recipe that…"},{"Title":"Marian's Pumpkin Soup","Description":"This fresh pumpkin soup seems straightforward since it's made with the standards-- fresh…"},{"Title":"Sooji Upma","Description":"This semolina-based dish features onion, tomatoes, and chile peppers."},{"Title":"Rose Ice Cream","Description":"Rose syrup, saffron, cardamom, and pistachios turn a plain carton of vanilla ice cream into an…"},{"Title":"Spicy Shrimp (Chingri Maach)","Description":"This Bengali spicy shrimp curry can be made with a variable amount of spice, and goes…"},{"Title":"Spicy Tomato Soup","Description":"Warm up your menu with this spicy Indian-inspired curried tomato soup."},{"Title":"South Indian Lentil Kootu","Description":"This south Indian dish of lentils and pigeon peas is quick, and easy on the stomach."},{"Title":"Prawns in Cashew Coconut Curry Sauce","Description":"This is a very mellow tasting dish that has a rich creamy taste of the coconut sauce with the…"},{"Title":"Prawn Biryani","Description":"This spicy rice dish cooked in mouth-watering prawn curry is extremely easy to make in a…"},{"Title":"Spicy Banana Curry","Description":"This recipe finds its harmony in the way the bold, bursting flavor of curry interacts with…"},{"Title":"Masale Aaloo (Spice Potatoes)","Description":"Cubed potatoes are cooked with cumin, coriander, and green mango powder in this…"},{"Title":"Easy Meat Samosas","Description":"These baked Indian-style samosas are filled with a curry-seasoned mixture of ground beef,…"},{"Title":"Kebab Massalam","Description":"Ground lamb is mixed with turmeric, green chili peppers, and coriander seeds, then formed…"},{"Title":"Minty Cucumber Raita","Description":"A simple tangy yogurt and cucumber sauce makes a cooling accompaniment to your spicy…"},{"Title":"Indian Lentils and Spinach","Description":"Indian lentils with spinach are nicely spiced with cardamom, cinnamon, ginger, and cinnamon…"},{"Title":"Makhani Daal (Buttery Lentils)","Description":"A spiced onion-tomato mixture is folded into pressure-cooked black lentils, chickpeas, and…"},{"Title":"Instant Pot(R) Indian Butter Chicken","Description":"This deeply flavored Indian butter chicken, originally created by a Pakistani food cart…"},{"Title":"Tomato Cucumber Kachumbar","Description":"This Indian salad called kachumbar is a mix of cucumber, tomato, lemon juice, and fresh…"},{"Title":"Spicy Lentil Quinoa Curry","Description":"This flavorful vegetarian Indian curry is made with vegetables, lentils, quinoa, and lots of…"},{"Title":"Delicious and Fast Chicken Curry","Description":"Curry-coated chicken pieces are simmered in coconut milk with onion, garlic, spinach, and…"},{"Title":"Jonagold's Chicken Vindaloo","Description":"Chicken drumsticks are simmered in a spicy onion sauce in this popular dish from Goa."},{"Title":"Grilled Lamb Chops with Curry, Apple and Raisin Sauce","Description":"Grilled lamb chops, all rosy-pink inside, are served up with a spiced apple-curry-raisin…"},{"Title":"Heinz(R) Butter Chicken","Description":"In this classic Indian-inspired recipe, tender chunks of chicken simmer in a creamy, tangy…"},{"Title":"Chicken Salad with Mango Chutney","Description":"Chicken salad with an Indian-inspired twist of mango chutney and curry powder is quick…"},{"Title":"Palak Paneer (Indian Spinach and Paneer)","Description":"Cubes of paneer simmer in a smooth spinach puree, fragrant with cumin seeds, ground…"},{"Title":"Indian Samosa Pie","Description":"This recipe uses the flavors of a samosa and the idea of a pot pie to make a savory,…"},{"Title":"Indian-Style Chicken and Onions","Description":"This chicken curry is seasoned with just the right amount of spices for a warm and flavorful…"},{"Title":"Cilantro Chutney","Description":"Green chile peppers, ginger, and cumin flavor this fresh cilantro condiment."},{"Title":"Kheema Malai Kofta","Description":"This tasty party dish can be made with ground lamb or beef."},{"Title":"Moong Dal with Spinach","Description":"Lentils and spinach deliver a warm and tasty comfort dish."},{"Title":"Mild Curry Omelet","Description":"This delicious Indian-inspired omelet will certainly awaken your groggy tastebuds!"},{"Title":"Carrot Soup Indienne I","Description":"Carrots and featured in this creamy curried vegetable soup which is pureed and then…"},{"Title":"Saffron Rice with Raisins and Cashews","Description":"Basmati rice is simmered with clarified butter, cloves, raisins and cashews to create this…"},{"Title":"Okra Fry","Description":"We love recipes that stretch our culinary horizons. We now know what asafetida…"},{"Title":"Tandoori Grilled Chicken","Description":"Yogurt and tandoori spice are stirred together and used as a marinade and basting sauce for…"},{"Title":"Charred Eggplant Raita","Description":"Whole eggplants are charred over an open flame to remove their skins, then mashed with…"},{"Title":"Bangalore Cornish Hens","Description":"Halved Cornish game hens are baked with a multitude of vegetables and spices, making…"},{"Title":"Indian Mustard Fish","Description":"A traditional Bengali dish. It is easy to make and usually prepared using hilsa fish. However…"},{"Title":"Elijah's Phulourie","Description":"These savory fritters are made with split pea flour and a blend of mild spices. An East…"},{"Title":"Exotic Indian Tangy Rice","Description":"A tangy rice dish made with tamarind and curry leaves has a slightly sour flavor. It is very easy…"},{"Title":"Alu Baigan","Description":"Alu Baigan is a West Indian curry made with potato and eggplant which is served with roti…"},{"Title":"Bhuna Gosht","Description":"Pan-frying a variety of spices with the lamb chops gives this curry dish a deep flavor."},{"Title":"Beet and Yogurt Salad","Description":"This dish consists of sliced beets mixed with yogurt and seasoned with Indian spices. It can…"},{"Title":"Easy Mango Lassi","Description":"This delicious mango and yogurt shake is great for extinguishing the fire in your mouth after…"},{"Title":"Aloo Matar Paneer (Simmered Potatoes with Peas and Paneer)","Description":"An aromatic blend of spices are simmered with potatoes, peas, and paneer cheese in this…"},{"Title":"Creamy Curried Root Vegetable Soup","Description":"Turnips, radishes, garlic, onion, potatoes, and carrots are pureed together in this creamy…"},{"Title":"Sarson Ka Saag (Indian Mustard Greens)","Description":"When the farmer's markets or your garden are pumping out greens like there's no tomorrow,…"},{"Title":"Akki Rotti","Description":"Green mung beans, soaked overnight, are mixed with rice flour, coconut, vegetables, and…"},{"Title":"Spiced Chickpeas (Chole)","Description":"Garbanzo beans are simmered with onions and spices, then sprinkled with raw ginger and…"},{"Title":"Nitya's Cauliflower","Description":"Cauliflower is sauteed with potatoes and a mix of spices to produce this delicious alternative…"},{"Title":"Butternut Squash Coconut Curry","Description":"Butternut squash, simmered with curry spices and coconut milk, makes a tasty and easy…"},{"Title":"Indian-Influenced Zucchini Onion Pepper Latkes","Description":"Made with grated zucchini instead of potato, these Indian-influenced latkes are flavored…"},{"Title":"Dal Makhani (Butter Lentils)","Description":"Lentils are simmered with tomatoes and loads of spices in this thick and buttery dal makhani…"},{"Title":"Banana Lassi","Description":"If you don't have any mango on hand, why not substitute in a banana to make a creamy…"},{"Title":"Indian Spiced Chicken","Description":"This Indian-inspired slow cooker meal cooks chicken thighs with tomatoes, cauliflower,…"},{"Title":"Spiced Turnips (Shalgam Masala)","Description":"Turnips are simmered in a spicy tomato-based sauce with Indian spices then coarsely…"},{"Title":"The Maharajah's Mulligatawny","Description":"Fresh chile peppers bring the heat in this Indian lamb soup."},{"Title":"Palak Paneer (Spinach Curry)","Description":"Store bought paneer cheese is served with a quick, spiced spinach sauce in this easy…"},{"Title":"Easy Carrot Salad (Indian-Style)","Description":"Cilantro, peanuts, and lemon juice deliver flavor in this cold carrot salad you can have ready in…"},{"Title":"Indian Curry Potato Fries","Description":"Potato cubes are fried in Indian-inspired spices for a perfect accompaniment to a curry dish.…"},{"Title":"Chana Masala","Description":"This version of the Indian dish, chana masala, substitutes spinach for the traditional…"},{"Title":"Tom's Mulligatawny Soup","Description":"Mulligatawny is an Indian-style soup. This recipe simmers chicken, apples, onion, carrots, bell…"},{"Title":"Savory Lassi","Description":"This is an Indian-style yogurt lassi drink that's tangy, refreshing, subtly spiced with cumin…"},{"Title":"Potato Cutlets","Description":"A mouthwatering appetizer of Indian origin, these tantalizing fried potato cutlets are…"},{"Title":"Besan Ladoo","Description":"This sweet confection from India and Pakistan combines chickpea flour, coconut,…"},{"Title":"Curried Chicken with Rice","Description":"Chutney provides a delicious shortcut in this lime-accented chicken and red bell pepper…"},{"Title":"Gobi Masala (Cauliflower Curry)","Description":"Small florets are stirred into and combined with tamarind water, coconut milk, flour and chili…"},{"Title":"Coconut Chutney","Description":"Fresh grated coconut and yogurt form the base of this tangy chutney from South India."},{"Title":"Indian-Style Grilled Chicken Salad","Description":"Spicy, tandoori-spiced chicken breasts are grilled and served with an Italian-inspired salad."},{"Title":"Indian Style Chicken with Apples","Description":"Chicken is served in a spicy yogurt sauce with apples, onion and red bell pepper. It tastes…"},{"Title":"Fish in Ginger-Tamarind Sauce","Description":"Its a very simple and easy fish curry from Kerala, a southern state of India. The curry is made…"},{"Title":"Lemon Lentil Rice","Description":"This is a complete meal with rice lentil and vegetables. This is my version of the South…"},{"Title":"Cabbage, Tomato and Onion Salad","Description":"This cabbage and tomato salad resonates with the spicy, nutty and pungent flavors of Indian…"},{"Title":"Mediterranean Yellow Rice and Vegetables","Description":"A colorful medley of instant brown rice with zucchini, pineapple, red and yellow peppers is…"},{"Title":"Chicken Karhaai","Description":"Chicken is simmered with tomato and hot chili peppers for this popular Indian dish."},{"Title":"Curried Mushroom Hot Pot","Description":"This steaming curried-mushroom soup with a touch of coconut and lemon warms you up on…"},{"Title":"Potatoes in Spicy Peanut and Sesame Paste","Description":"Diced potatoes, onions, and tomato are cooked in a creamy peanut and sesame seed sauce to…"},{"Title":"Faux Bombay Potatoes","Description":"Replace potatoes with turnips for a nice variation on an Indian side dish."},{"Title":"Tandoori Chicken Salad","Description":"Tangy grilled chicken atop a bed of greens mixed with onions, raisins, almonds,…"},{"Title":"Tandoori Chicken Skewers","Description":"Chicken breasts are marinated in a spiced yogurt sauce, then baked or grilled."},{"Title":"Apricot Chutney","Description":"A sweet and spicy apricot chutney made with preserves has roasted garlic for depth of…"},{"Title":"Frizzled Onions","Description":"These crispy fried onions taste like the onion rings from a can, but better! They're great…"},{"Title":"Chickpea Coconut Salad","Description":"Garbanzo beans get a lift when tossed with grated coconut, fresh cilantro, and lemon…"},{"Title":"Yogurt Rice","Description":"This cooling, flavorful Indian dish is perfect as an accompaniment to grilled meats."},{"Title":"Sweet Corn Subji With Paneer and Cashew Nuts","Description":"Subji is an Indian dish that literally translates as \"vegetable dish\". The vegetable here is corn…"},{"Title":"Chicken Chutney Sandwiches with Curry","Description":"This simple, tasty sandwich combines the great textures of whipped cream cheese, chicken,…"},{"Title":"Cabbage Koora","Description":"This cabbage stir fry is seasoned with fresh green chile peppers, dried red chile peppers,…"},{"Title":"Bengaladumpa Vepudu (Potato Stir-Fry)","Description":"Potatoes are stir-fried with a variety of spices in this vegetarian curry recipe."},{"Title":"Aloo Palak","Description":"Spinach and potatoes are stir-fried in this simple vegetarian dish from India."},{"Title":"Makhani Murgh (Butter Chicken)","Description":"Chicken in a spicy tomato cream sauce is the best way to describe this Indian restaurant…"},{"Title":"Tamarind Sauce Fish Curry","Description":"This tangy fish curry is an authentic coastal Indian dish that is ready in less than an hour."},{"Title":"Egg Bhurji","Description":"Egg bhurji, scrambled eggs seasoned with garam masala, turmeric, and coriander, is an…"},{"Title":"Vegetable Biryani (Tehri)","Description":"This bright yellow vegetarian biryani (tehri) is full of deliciously soft vegetables and fragrant…"},{"Title":"Curry Red Lentil Soup","Description":"Fresh vegetables and aromatic spices combine in this comforting red lentil soup that's ready…"},{"Title":"Easy Vegetarian Kofta Curry","Description":"Make Indian kofta curry easy and vegetarian-friendly by using meatless vegetable…"},{"Title":"Indian Chicken Korma in the Slow Cooker","Description":"Indian chicken korma is a mild, delicately fragrant curry in a rich and flavorful cream…"},{"Title":"Tandoori Paneer Tikka Masala","Description":"Baked tandoori-style, these Indian tikka masala kebabs with paneer, peppers, and onion are…"},{"Title":"Turmeric Golden Milk with Turmeric Paste","Description":"A bright golden turmeric paste is heated with almond milk, spices, and coconut oil to make…"},{"Title":"Indian Tomato Rice","Description":"This tomato rice with onion, turmeric, and ginger is an Indian-inspired comfort food that…"},{"Title":"Vegetarian Splendor Chickpea Curry","Description":"This Indian-inspired chickpea curry is a hearty vegetarian main dish rich with flavor and…"},{"Title":"Tampa Coconut Cilantro Rice","Description":"The subtle sweetness of this basmati rice, cooked in coconut water and finished with…"},{"Title":"Easy Masala Hash Browns","Description":"These quick and easy hash browns tossed in garam masala make an Indian-inspired potato…"},{"Title":"Potato Chapati Bread","Description":"Use leftover mashed potatoes in this flavorful whole wheat flatbread."},{"Title":"Easy Malai Kulfi","Description":"Kulfi is best described as Indian-style ice cream. However, unlike ice cream, kulfi is not…"},{"Title":"Chettinad-Style Chicken","Description":"This peppery Indian chicken curry comes from the Chettinad region and features green chile…"},{"Title":"Indian-Style Vegetable Rice","Description":"This is a standard Indian pilaf dish with a slight twist. The combination of colorful vegetables…"},{"Title":"Besan Laddu","Description":"Chickpea flour, pistachios, and cashews make a delicious Indian sweet, commonly gifted…"},{"Title":"Kiwi Raita","Description":"A slightly sweet, slightly tangy, cooling condiment that goes great with spicy Indian…"},{"Title":"Beetroot Aloo Koora","Description":"The sweetness of the beets works great with potatoes and the spices in this dish best…"},{"Title":"Kashmiri Garam Masala","Description":"A good friend of mine gave me her recipe for Kashmiri Garam Masala some years ago. I am…"},{"Title":"Hot Coffee Masala","Description":"This warming, spicy coffee drink contains interesting Asian spices, giving it a chai-like…"},{"Title":"Indian Curry Couscous with Broccoli and Edamame","Description":"Edamame soy beans and broccoli are stir-fried with exotic Indian spices for a delicious…"},{"Title":"Cauliflower and Potato Stir-Fry - East Indian Recipe","Description":"Cauliflower and potatoes are simmered with aromatic Indian-inspired spices for a quick…"},{"Title":"Cucumber Carrot Salad (Raita)","Description":"This side dish consists of shredded cucumbers and carrots mixed in yogurt."},{"Title":"Palak Paneer","Description":"Homemade paneer simmered in a fragrant, creamy spinach and tomato sauce makes this…"},{"Title":"Quinoa Pilau","Description":"Quinoa is the star ingredient in this Indian-inspired side dish. Onion and ginger are…"},{"Title":"Easy Indian Tomato Soup (Saar)","Description":"Just the thing for a cold wintry night. Here is a wonderfully easy recipe for traditional Indian…"},{"Title":"Tangy Chicken with Pistachios and Fruit","Description":"A sweet and tangy mixture of chicken with peaches, apricots and pistachios. Indian curry…"},{"Title":"Masala Spicy Tea","Description":"Masala tea is also known as chai, and this is an easy, authentic version of the drink, made…"},{"Title":"Matar Pulao with Nuts","Description":"This Basmati rice pilaf with peas, cashews, and almonds is similar to the rice pilaf served in…"},{"Title":"Indian Spiced Onions","Description":"Spicy onions just like the ones served in Indian restaurants as a side dish! Delicious served…"},{"Title":"Grilled Italian Burgers","Description":"These burgers are stuffed with kalamata olives, capers, and feta cheese resulting in burgers…"},{"Title":"Yummy Curd Rice","Description":"This yummy rice, seasoned with fresh ginger and garlic, curry leaves, and cinnamon, is an…"},{"Title":"Chicken Roti From India","Description":"A fragrant home-made masala--an exotic spice mixture--will reward you with this hotly…"},{"Title":"Sago Sabudana Khichdi","Description":"This Indian snack food made with sago is a traditional favorite, often enjoyed during…"},{"Title":"Carrot Soup Indienne II","Description":"Dill weed is used in this highly seasoned vegetable soup which is pureed before cream…"},{"Title":"Smoky Eggplant and Yogurt Salad","Description":"Pureed eggplant, yogurt, green onions and cilantro are mixed together and placed on a…"},{"Title":"Sweet and Sour Chutney","Description":"Pungent and quite wonderful. Dates, tamarind extract, cumin, brown sugar and water are…"},{"Title":"Egg Halwa","Description":"This halwa is a rich, Indian dessert of eggs and milk flavored with cardamom. Keep stirring or…"},{"Title":"Lucy's Tomato and Peach Chutney","Description":"A sweet and spicy chutney made with tomatoes, peaches, apples, celery and onion that's very…"},{"Title":"Tomato Rasam","Description":"Rasam is the chicken soup (I make it vegan) of South India and a must in every household. A…"},{"Title":"Potatoes with Fresh Ginger and Chilies","Description":"Inspired by Indian dishes, potatoes acquire an exotic, zesty personality when cooked in a…"},{"Title":"Keema Matar","Description":"This ground lamb curry is a combination of what I remember from a Patak's® recipe and other…"},{"Title":"Mad's Peach-Curry Soup","Description":"The surprising combination of peaches and curry powder gives this innovative soup its…"},{"Title":"Mixed Grill of Sausage, Chicken and Lamb With Tandoori Flavorings","Description":"The Indian-flavored main course uses one basic spice rub. Half is rubbed on the lamb chops,…"},{"Title":"Crazy Spicy Chicken","Description":"Sweet mango adds a fruity taste to a chicken curry with tomatoes and warm…"},{"Title":"Cranberry Curry Chicken","Description":"Cranberry sauce, curry powder, cubed apple, and raisins combine for a sweet, savory take…"},{"Title":"Egg and Potato Curry","Description":"This flavor-packed recipe for hard-cooked eggs and potatoes in a spicy gravy makes a great…"},{"Title":"Lentil Samosas","Description":"Baked samosas filled with lentils, yam, dried apricot, and coconut milk are a hearty and…"},{"Title":"Vegetable Shepherd's Pie with Baked Beans","Description":"A unique combination of Indian flavors and baked beans replace the usual ground beef in…"},{"Title":"Spicy Potato Noodles (Bataka Sev)","Description":"Chickpea flour and mashed potatoes get heat and flavor from fresh green chiles, ginger,…"},{"Title":"Tomato Onion Koora","Description":"Tomatoes, onions, and green chile peppers are the base of this quick and simple curry dish."},{"Title":"Tamarind-Date Chutney","Description":"This sweet and sour chutney works well with anything."},{"Title":"Roti Canai/Paratha (Indian Pancake)","Description":"Roti Canai, an Indian pancake, are easy to make at home using 6 simple ingredients; eat as a…"},{"Title":"Khitchari","Description":"This bowl of split mung bean and basmati rice khitchari is a quick and easy meal to throw…"},{"Title":"Mutton Varuval (Malaysian Indian-Style Goat Curry)","Description":"A showstopper dish at Diwali gatherings, this goat curry melds a myriad of spices evoking…"},{"Title":"One-Pot Vegan Potato-Lentil Curry","Description":"This wonderful vegan one-pot curry contains red lentils, potatoes, tomatoes, and onions…"},{"Title":"Chicken Thighs with Bok Choy and Farro","Description":"This low-calorie, spicy, citrusy chicken recipe combines farro and chicken thighs with bok…"},{"Title":"Slow Cooker Vegetarian Curry","Description":"This wonderfully aromatic vegetarian curry recipe is made easy in the slow cooker -…"},{"Title":"Curry in a Hurry","Description":"This red lentil curry in a hurry is made in a multi-functional pressure cooker and is perfect for a…"},{"Title":"Veggie Samosas","Description":"These vegetarian samosas made with a simple homemade dough pack plenty of heat with…"},{"Title":"My Mango Lassi","Description":"Mango lassi is very rich and luxurious drink with yogurt and mangoes. It is the perfect summer…"},{"Title":"Jackfruit Curry (Kathal Subzi)","Description":"This tomato-based Indian curry recipe uses meaty chunks of jackfruit to create a…"},{"Title":"Tandoori Roasted Root Vegetable Stew","Description":"This colourful meal combines lentils, quinoa, zucchini, and tomatoes."},{"Title":"Indian Chicken Marinade","Description":"This spicy yogurt-based chicken marinade with Indian spices like cinnamon and ginger keeps…"},{"Title":"Indian Onion Dipping Sauce","Description":"Minced onion is mixed with lemon juice, paprika, and cayenne creating a copycat…"},{"Title":"Slow-Cooked Chicken Biryani","Description":"Chicken breast is layered with basmati rice, yogurt, and loads of Indian spices in this…"},{"Title":"Country Captain Chicken with Rice","Description":"Made with Madras curry, currants, and raisins, this recipe for country captain chicken with…"},{"Title":"Creamy Indian Yogurt Soup","Description":"This is a quick Indian-style yogurt-based soup seasoned with coriander, cumin, and garam…"},{"Title":"Instant Pot(R) Chicken Biryani","Description":"Thanks to the multicooker, this recipe saves time but still produces an mouthwatering…"},{"Title":"Methi Murgh (Fenugreek Chicken)","Description":"Fenugreek fans will love this recipe for chicken using both fresh and dried fenugreek leaves…"},{"Title":"Sundal","Description":"This traditional vegetarian dish from southern India is made with chickpeas, mango,…"},{"Title":"Prawns Curry","Description":"This delicious curry dish with prawns uses rice flour and turmeric to coat the prawns which…"},{"Title":"Gujarati Kadhi","Description":"Try this Indian yogurt-based dish over rice for a nice sweet-and-sour vegetarian meal."},{"Title":"Rasgullas","Description":"These milk dumplings are cooked in a pressure cooker and served in a sweet cardamom syrup."},{"Title":"Ada (Adai)","Description":"Try these crepe-like items for an Indian-style breakfast made with lentils and rice."},{"Title":"Pesarattu","Description":"Pesarattu is a crepe-like flatbread made with a batter made of rice and lentils."},{"Title":"Machhere Jhol (Bengali Fish Curry)","Description":"This delicate fish stew comes from the Bengal region of India."},{"Title":"Pork Chops with Sweet Tomato Chutney","Description":"Everyday pork chops get a new lease on life when served with this zesty Bengali style…"},{"Title":"Rob's Lamb Curry Pie","Description":"Make a savory lamb pot pie, scented with curry and spices, and top it with a curry-flavored…"},{"Title":"Garam Masala","Description":"Make your own garam masala spice mixture to have ready for homemade Indian meals."},{"Title":"Indian Stuffed Eggplant","Description":"Delicious, fried eggplant shells are stuffed with a spicy vindaloo eggplant and onion stuffing in…"},{"Title":"Curried Green Bean Salad","Description":"This version of a cold bean salad is made with canned green beans, garlic, ginger, and curry…"},{"Title":"Curry Vinaigrette Dressing","Description":"Curry vinaigrette dressing is a nice Indian-inspired addition to any salad. Refrigerate…"},{"Title":"Indian-Inspired Cauliflower and Potato Casserole","Description":"Cauliflower and potatoes are baked in a creamy and spicy Indian-inspired curry sauce."},{"Title":"Zucchini Soup with Curry Spices","Description":"Zucchini is simmered with curry spices for a nicely aromatic and light Indian-inspired soup."},{"Title":"Broiled Chicken Breasts with Chutney-Lime Glaze and Broccoli Slaw","Description":"This convenient recipe makes getting two meal on the table a snap."},{"Title":"Muscat Gosht (Lamb in Spicy Tomato Gravy)","Description":"This Indian recipe for mutton lets the meat stew in a spicy clarified butter and tomato gravy."},{"Title":"Sweet Lentil Soup with Asparagus Tips","Description":"Lentils are simmered with roasted garlic and red bell pepper, carrot, onion, asparagus tips and…"},{"Title":"Madras Tomato Chutney","Description":"This is a savory tomato chutney which has a lot of flavor and is GREAT with Samosas."},{"Title":"Awadi Dahi Murg (Chicken in Yogurt Gravy)","Description":"Make your own yogurt-based curry-like sauce using a variety of spices."},{"Title":"Eggless Mango Bread","Description":"This basic mango bread uses milk powder instead of eggs. Pureed mango, superfine…"},{"Title":"Vegan Yogurt Sundae","Description":"This completely vegan yogurt sundae is easy to make with just a microwave, a fork, and a few…"},{"Title":"Kesari Bhat","Description":"This is a traditional Indian sweet of saffron and semolina is prepared all over India. It is the…"},{"Title":"Capsicum Zunka","Description":"In this traditional side dish of rural Western India, green bell peppers are sauteed with…"},{"Title":"Bhel Puri","Description":"Puffed rice is folded into a spicy coconut and cilantro base for a savory Indian-inspired snack."},{"Title":"Tandoori Chicken Burgers","Description":"Tandoori chicken burgers made with ginger paste, tandoori paste, and garam masala are a…"},{"Title":"Eastern-Style Mulligatawny Soup","Description":"This spicy split pea soup is a great addition to any Indian-themed meal. It pairs well with…"},{"Title":"Cucumber Raita with Mint","Description":"This soothing Indian yogurt condiment is excellent samosas or whatever you like to dip:…"},{"Title":"Samosa Pot Pie","Description":"This pot pie is influenced by the samosa, using a puff pasty to top a baked casserole of…"},{"Title":"Real Indian Mango Chutney","Description":"Make your own Indian-style mango chutney with dates and raisins. This recipe makes…"},{"Title":"Lamb Meatballs Over Tandoori Naan","Description":"Tandoori naan bread is topped with homemade lamb meatballs, hearty tomato sauce, and…"},{"Title":"Chocolate Chai Coffee Mix","Description":"This homemade mix will turn your cup of coffee into a delightfully chai-spiced treat."},{"Title":"Indian Style Shrimp Fry","Description":"Shrimp flavored with a nice variety of Indian-inspired spices are pan-fried with onions,…"},{"Title":"Rabri (Barley-Yogurt Drink)","Description":"Barley and fat-free yogurt combine in this drink from northern India."},{"Title":"Hara Masala Murgh","Description":"This is a very flavorful and fresh-tasting recipe for chicken with fresh herbs. It is a welcome…"},{"Title":"Khara Pongal","Description":"This classic south Indian lentil dish combines dried red chilies and fresh green chile peppers…"},{"Title":"Anapakaya Paala Koora","Description":"This recipe for calabash can be served with rice for a nice vegetarian meal. You can also try it…"},{"Title":"Egg Kulambu","Description":"Kulambu is a spicy stew from Tamil, India. The main flavors are from tamarind and jaggery…"},{"Title":"Tomato Bhath (Tomato Rice)","Description":"Leftover rice and a homemade spice mixture called 'Masala Podi' are the key components…"},{"Title":"Mixed Vegetable Pulao","Description":"This Indian rice dish is packed with vegetables for a quick and easy dinner option."},{"Title":"Kheema Pulao","Description":"This is a sort of a lazy man's biryani. Basically you cook the kheema masala first and then…"},{"Title":"Minty Mint Chutney","Description":"This mint chutney will give any dish a nice little kick thanks to the lemon juice, onion, and…"},{"Title":"Gujarati Shrikhand","Description":"Shrikhand is a sweet strained yogurt dish from Gujarat made with cardamom, saffron, and…"},{"Title":"Curried Celery","Description":"This curry-powered appetizer recipe delivers a new topping for raw celery by mixing apple…"},{"Title":"Indian Chickpeas in Tea","Description":"This vegetarian chickpea recipe brings a little kick to an easy and very flavorful Indian dish…"},{"Title":"Indian-Style Scrambled Eggs","Description":"Scrambled eggs get a hint of Indian-inspiration when curry powder and cumin are added to…"},{"Title":"Easy Indian-Style Pumpkin Curry","Description":"This recipe from southern India for fresh pumpkin in a curry sauce is easy to prepare…"},{"Title":"Chai Tea Ice Cream","Description":"If you like the Indian-style spiced tea, you will love this chai tea ice cream recipe."},{"Title":"Veg Biryani","Description":"A traditional spiced rice dish with lots of vegetables makes a delicious side dish or…"},{"Title":"Pressure Cooker Goat Curry","Description":"An electric pressure cooker cooks this tantalizing tomato-based goat curry seasoned…"},{"Title":"Green Curry with Sweet Potato and Aubergine (Eggplant)","Description":"Sweet potatoes and eggplant are boiled in creamy coconut milk and seasoned with…"},{"Title":"Kadai Chicken","Description":"Chicken breast is pan-fried in a thick, spicy tomato sauce in this pared-down recipe for…"},{"Title":"Healthier and Tastier Tikka Masala","Description":"This nicely seasoned chicken tikka masala recipe, using leftover cooked chicken, is a…"},{"Title":"Serena's Strawberry Lassi","Description":"This is an absolutely delicious, refreshing Indian yogurt drink with fresh strawberries. It is so…"},{"Title":"Spiced Mango Lassi","Description":"Mango lassi is the queen of mango drinks; this quick and easy recipe features bright Indian…"},{"Title":"Andrea's Dal for Instant Pot(R)","Description":"In India, dal means any number of dried pulses; it is also the name for a classic dish made…"},{"Title":"Traditional Beef Samosas","Description":"Coriander, garam masala, and cumin are just a preview of the many spices that flavor these…"},{"Title":"Instant Pot(R) Indian Chicken Curry","Description":"This quick and easy Indian chicken curry comes together faster than you would expect with…"},{"Title":"Easy Chicken Madras Recipe","Description":"Instead of ordering take-out, try this easy Indian chicken curry recipe made with spicy Madras…"},{"Title":"Vegetarian Matar Paneer","Description":"Matar paneer is a classic vegetarian Indian dish with paneer cheese, peas, tomatoes, and lots…"},{"Title":"Slow Cooker Chicken Massaman Curry","Description":"This slow cooker chicken Massaman curry dish combines vegetables, coconut milk, peanut…"},{"Title":"Indian Masala Chicken Wings","Description":"Marinate chicken wings ahead of time in a simple homemade masala paste for an…"},{"Title":"Vegan Roasted Curry Cauliflower","Description":"If you like cauliflower, try this Indian-inspired vegan version of roasted cauliflower seasoned…"},{"Title":"Snow on the Mountain (Lamb Curry)","Description":"Make this rich, savory Indian lamb curry with lamb shoulder and chunks of potato in a…"},{"Title":"Indian Curried Spinach Dip","Description":"This recipe for curried spinach dip is very easy to make and full of the flavors of North Indian…"},{"Title":"Vegetarian Palak Moong Dal","Description":"Indian dal is a classic, soup-like vegetarian comfort food with rich and spicy flavors from…"},{"Title":"Palak Paneer Curry","Description":"Palak paneer is an Indian curry with soft cubes of cheese simmered in a mildly spiced…"},{"Title":"Red Lentil Dal with Yogurt Raita","Description":"Red lentils and tons of vegetables simmer among spices in this quick dal brightened…"},{"Title":"Kerala Chicken Curry","Description":"This family recipe for Indian chicken curry is from the Southern state of Kerala. A very…"},{"Title":"Slow Cooker Chicken Jalfrezi","Description":"This Indian-inspired chicken jalfrezi recipe is a very simple chicken curry that comes out…"}]